<!DOCTYPE html>
<html class="has-navbar-fixed-top">
<head><meta name="generator" content="Hexo 3.9.0">
    <!-- hexo-inject:begin --><!-- hexo-inject:end --><meta charset="utf-8">
<title>求导的哲学 - 萧爽楼</title>
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">

<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/outdated-browser/1.1.5/outdatedbrowser.min.css">




<meta name="description" content="我叫李家丞，现在在USTC念书。博客的内容主要包括个人的生活、读书感想，也包括数学、互联网、编程语言、人工智能等方面的学习侧记。">





    <meta name="description" content="&amp;#x4E2A;&amp;#x4EBA;&amp;#x516C;&amp;#x4F17;&amp;#x53F7;&amp;#x7684;&amp;#x6B22;&amp;#x8FCE;&amp;#x6587;&amp;#x7AE0;&amp;#xFF0C;&amp;#x8C08;&amp;#x201C;&amp;#x6C42;&amp;#x5BFC;&amp;#x201D;&amp;#x4E4B;&amp;#x6DB5;&amp;#x4E49;&amp;#x548C;&amp;#x5FAE;&amp;#x4FE1;&amp;#x516C;&amp;#x4F17;&amp;#x5E73;">
<meta name="keywords" content="Drivative,Digital Life,Reading">
<meta property="og:type" content="article">
<meta property="og:title" content="求导的哲学">
<meta property="og:url" content="https://blog.ddlee.cc/posts/da5ae4d8/index.html">
<meta property="og:site_name" content="萧爽楼">
<meta property="og:description" content="&amp;#x4E2A;&amp;#x4EBA;&amp;#x516C;&amp;#x4F17;&amp;#x53F7;&amp;#x7684;&amp;#x6B22;&amp;#x8FCE;&amp;#x6587;&amp;#x7AE0;&amp;#xFF0C;&amp;#x8C08;&amp;#x201C;&amp;#x6C42;&amp;#x5BFC;&amp;#x201D;&amp;#x4E4B;&amp;#x6DB5;&amp;#x4E49;&amp;#x548C;&amp;#x5FAE;&amp;#x4FE1;&amp;#x516C;&amp;#x4F17;&amp;#x5E73;">
<meta property="og:locale" content="zh-cn">
<meta property="og:updated_time" content="2020-05-16T04:12:20.288Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="求导的哲学">
<meta name="twitter:description" content="&amp;#x4E2A;&amp;#x4EBA;&amp;#x516C;&amp;#x4F17;&amp;#x53F7;&amp;#x7684;&amp;#x6B22;&amp;#x8FCE;&amp;#x6587;&amp;#x7AE0;&amp;#xFF0C;&amp;#x8C08;&amp;#x201C;&amp;#x6C42;&amp;#x5BFC;&amp;#x201D;&amp;#x4E4B;&amp;#x6DB5;&amp;#x4E49;&amp;#x548C;&amp;#x5FAE;&amp;#x4FE1;&amp;#x516C;&amp;#x4F17;&amp;#x5E73;">





<link rel="icon" href="/favicon.png">


<link rel="stylesheet" href="//fonts.googleapis.com/css?family=Ovo|Source+Code+Pro">
<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/bulma/0.6.2/css/bulma.min.css">


<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/lightgallery/1.6.8/css/lightgallery.min.css">
<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/justifiedGallery/3.6.5/css/justifiedGallery.min.css">


<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/highlight.js/9.12.0/styles/atom-one-light.min.css">

<link rel="stylesheet" href="/css/style.css">

<script defer src="//use.fontawesome.com/releases/v5.0.8/js/all.js"></script><!-- hexo-inject:begin --><!-- hexo-inject:end -->


    
    
    
    
    
    
    
    
    
    

    


</head>
<body>
    
<!-- hexo-inject:begin --><!-- hexo-inject:end --><nav class="navbar is-transparent is-fixed-top navbar-main" role="navigation" aria-label="main navigation">
    <div class="container">
        <div class="navbar-brand">
            <a class="navbar-item navbar-logo" href="/">
                
                    
                    萧爽楼
                    
                
            </a>
            <div class="navbar-burger">
                <span></span>
                <span></span>
                <span></span>
            </div>
        </div>
        
        <div class="navbar-menu navbar-start">
            
            <a class="navbar-item " href="/archives">归档</a>
            
            <a class="navbar-item " href="/gallery">图库</a>
            
            <a class="navbar-item " href="/recommendation">推荐</a>
            
            <a class="navbar-item " href="/links">友链</a>
            
            <a class="navbar-item " href="/about">关于</a>
            
        </div>
        
        <div class="navbar-menu navbar-end">
            
            <a class="navbar-item search" title="搜索" href="javascript:;">
                <i class="fas fa-search"></i>
            </a>
            
            
            
            <a class="navbar-item" title="RSS" href="/atom.xml">
                
                RSS
                
            </a>
               
            <a class="navbar-item" title="ddlee.cc" href="https://ddlee.cc">
                
                ddlee.cc
                
            </a>
               
            
        </div>
    </div>
</nav>

    <section class="section">
    <div class="container">
    <article class="article content gallery" itemscope itemprop="blogPost">
    <h1 class="article-title is-size-3 is-size-4-mobile" itemprop="name">
        
            求导的哲学
        
    </h1>
    <div class="article-meta columns is-variable is-1 is-multiline is-mobile is-size-7-mobile">
        <span class="column is-narrow">
            <time datetime="2019-01-07T11:05:00.000Z" itemprop="datePublished">1月 7 2019</time>
        </span>
        
        
        <span class="column is-narrow">
            
            
            22 分钟 读完 (约 3303 字)
        </span>
        
    </div>
    <div class="article-entry is-size-6-mobile" itemprop="articleBody">
    
        <link rel="stylesheet" type="text/css" href="https://cdn.jsdelivr.net/hint.css/2.4.1/hint.min.css"><blockquote>
<p>&#x6309;&#xFF1A;&#x6B64;&#x6587;&#x4E3A;&#x4E2A;&#x4EBA;&#x516C;&#x4F17;&#x53F7;&#x7684;&#x6B22;&#x8FCE;&#x6587;&#x7AE0;&#xFF0C;&#x70E6;&#x8BF7;&#x60F3;&#x8C61;&#x81EA;&#x5DF1;&#x662F;&#x5728;&#x5FAE;&#x4FE1;&#x91CC;&#x8BFB;&#x5230;&#x8FD9;&#x4E9B;&#x6587;&#x5B57;&#x3002;</p>
</blockquote>
<blockquote>
<p>&#x7531;&#x662F;&#x5219;&#x751F;&#xFF0C;&#x800C;&#x6709;&#x4E0D;&#x7528;&#x4E5F;&#xFF1B;&#x7531;&#x662F;&#x5219;&#x53EF;&#x4EE5;&#x907F;&#x60A3;&#xFF0C;&#x800C;&#x6709;&#x4E0D;&#x4E3A;&#x4E5F;&#x3002;&#x2014;&#x2014;&#x5B5F;&#x5B50;</p>
</blockquote>
<p>&#x4F60;&#x597D;&#xFF0C;&#x6B22;&#x8FCE;&#x4F60;&#x5173;&#x6CE8;&#x6C42;&#x5BFC;Derivative&#x3002;</p>
<h2 id="&#x4E00;&#x4E2A;&#x6BD4;&#x55BB;"><a href="#&#x4E00;&#x4E2A;&#x6BD4;&#x55BB;" class="headerlink" title="&#x4E00;&#x4E2A;&#x6BD4;&#x55BB;"></a>&#x4E00;&#x4E2A;&#x6BD4;&#x55BB;</h2><p>&#x5047;&#x5982;&#x4F60;&#x662F;&#x5965;&#x7279;&#x66FC;&#xFF0C;&#x524D;&#x9762;&#x6709;&#x4E2A;&#x8DEF;&#x53E3;&#x602A;&#x517D;&#x6B63;&#x5728;&#x90A3;&#x91CC;&#x5403;&#x4EBA;&#xFF0C;&#x53EF;&#x4F60;&#x6CE8;&#x610F;&#x5230;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x4EBA;&#x5F80;&#x90A3;&#x4E2A;&#x65B9;&#x5411;&#x8D70;&#xFF0C;&#x4F60;&#x8BE5;&#x600E;&#x4E48;&#x529E;&#xFF1F;<br>A. &#x5927;&#x58F0;&#x547C;&#x558A;&#xFF0C;&#x201C;&#x75AF;&#x4E86;&#x5427;&#x4F60;&#xFF0C;&#x518D;&#x5F80;&#x90A3;&#x8D70;&#x4F60;&#x4F1A;&#x6CA1;&#x547D;&#x7684;&#xFF0C;&#x6709;&#x4E2A;&#x602A;&#x517D;&#x5728;&#x5403;&#x4EBA;&#xFF01;&#x201D;<br>B. &#x8DD1;&#x8FC7;&#x53BB;&#xFF0C;&#x62E6;&#x4F4F;&#x4ED6;&#xFF0C;&#x6B7B;&#x6D3B;&#x4E5F;&#x4E0D;&#x8BA9;&#x4ED6;&#x518D;&#x5F80;&#x524D;&#x8D70;&#x4E86;<br>C. &#x4F60;&#x4ED4;&#x7EC6;&#x89C2;&#x5BDF;&#xFF0C;&#x53D1;&#x73B0;&#x8FD9;&#x4E2A;&#x4EBA;&#x662F;&#x4E2A;&#x9AD8;&#x5EA6;&#x8FD1;&#x89C6;&#xFF0C;&#x4F46;&#x5FD8;&#x4E86;&#x6234;&#x773C;&#x955C;&#xFF0C;&#x4F60;&#x8FC7;&#x53BB;&#x628A;&#x773C;&#x955C;&#x9012;&#x7ED9;&#x4ED6;</p>
<p>&#x6211;&#x7684;&#x9009;&#x62E9;&#x662F;C&#x3002;&#x4F46;&#x771F;&#x6B63;&#x7684;&#x5965;&#x7279;&#x66FC;&#x5E94;&#x8BE5;&#x51FA;&#x73B0;&#x5728;&#x8DEF;&#x53E3;&#x90A3;&#x91CC;&#xFF0C;&#x5FD9;&#x7740;&#x628A;&#x602A;&#x517D;&#x8D76;&#x8D70;&#xFF0C;&#x5F88;&#x9057;&#x61BE;&#x6211;&#x4E0D;&#x662F;&#x771F;&#x6B63;&#x7684;&#x5965;&#x7279;&#x66FC;&#x3002;</p>
<h2 id="&#x6C42;&#x5BFC;&#x7684;&#x54F2;&#x5B66;"><a href="#&#x6C42;&#x5BFC;&#x7684;&#x54F2;&#x5B66;" class="headerlink" title="&#x6C42;&#x5BFC;&#x7684;&#x54F2;&#x5B66;"></a>&#x6C42;&#x5BFC;&#x7684;&#x54F2;&#x5B66;</h2><p>&#x5176;&#x5B9E;&#x8FD9;&#x5C31;&#x662F;&#x6211;&#x60F3;&#x7528;&#x201C;&#x6C42;&#x5BFC;&#x201D;&#x8868;&#x8FBE;&#x7684;&#x610F;&#x601D;&#x3002;&#x6211;&#x4EEC;&#x5E94;&#x8BE5;&#x591A;&#x770B;&#x4E00;&#x5C42;&#xFF0C;&#x6CE8;&#x610F;&#x5230;&#x95EE;&#x9898;&#x8FD8;&#x8FDC;&#x8FDC;&#x4E0D;&#x591F;&#xFF0C;&#x6211;&#x4EEC;&#x5E94;&#x8BE5;&#x53BB;&#x63A2;&#x5BFB;&#x9020;&#x6210;&#x95EE;&#x9898;&#x7684;&#x90A3;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x5373;&#x662F;&#xFF0C;&#x6C42;&#x4E00;&#x6B21;&#x5BFC;&#x3002;&#x800C;&#x4E14;&#xFF0C;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x662F;&#x80FD;&#x591F;&#x8FED;&#x4EE3;&#x7684;&#x3002;<br>&#x6B63;&#x5982;&#x4F60;&#x60F3;&#x6539;&#x53D8;&#x901F;&#x5EA6;&#xFF0C;&#x4F60;&#x5E94;&#x8BE5;&#x5728;&#x52A0;&#x901F;&#x5EA6;&#x7684;&#x5C42;&#x9762;&#x64CD;&#x4F5C;&#xFF0C;&#x4F60;&#x60F3;&#x8BF4;&#x670D;&#x4E00;&#x4E2A;&#x4EBA;&#xFF0C;&#x53EA;&#x5728;&#x73B0;&#x8C61;&#x548C;&#x7ED3;&#x8BBA;&#x4E0A;&#x8DDF;&#x4ED6;&#x5BF9;&#x7740;&#x5E72;&#x662F;&#x5F92;&#x52B3;&#x7684;&#xFF0C;&#x4F60;&#x5E94;&#x8BE5;&#x53BB;&#x627E;&#x5230;&#x4ED6;&#x7684;&#x8BBA;&#x636E;&#x548C;&#x8BBA;&#x8BC1;&#x8FC7;&#x7A0B;&#xFF08;&#x540C;&#x65F6;&#xFF0C;&#x68C0;&#x89C6;&#x81EA;&#x5DF1;&#x7684;&#x8BBA;&#x636E;&#x548C;&#x8BBA;&#x8BC1;&#x8FC7;&#x7A0B;&#xFF09;&#x3002;<br>&#x8FD9;&#x4E5F;&#x662F;&#x6211;&#x6B63;&#x5728;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x6211;&#x4ECE;&#x81EA;&#x5DF1;&#x7684;&#x535A;&#x5BA2;&#x91CC;&#x642C;&#x8FD0;&#x4E86;&#x51E0;&#x7BC7;&#x6587;&#x7AE0;&#x8FC7;&#x6765;&#xFF0C;&#x65B9;&#x4FBF;&#x670B;&#x53CB;&#x4EEC;&#x80FD;&#x591F;&#x770B;&#x5230;&#x3002;<br><a href="https://blog.ddlee.cn/posts/3a6233e2/" target="_blank" rel="noopener">&#x300A;&#x6211;&#x7684;&#x4FE1;&#x606F;&#x65B9;&#x6CD5;&#x8BBA;&#x300B;</a>&#x8BB2;&#x6211;&#x81EA;&#x5DF1;&#x6297;&#x62D2;&#x4FE1;&#x606F;&#x6D2A;&#x6D41;&#x6240;&#x8FDB;&#x884C;&#x7684;&#x52AA;&#x529B;&#x548C;&#x601D;&#x8003;&#xFF0C;&#x68B3;&#x7406;&#x4E86;&#x81EA;&#x5DF1;&#x7684;&#x539F;&#x5219;&#x548C;&#x601D;&#x8DEF;&#x3002;<a href="https://blog.ddlee.cn/posts/599cb823/" target="_blank" rel="noopener">&#x300A;&#x5728;&#x7EBF;&#x6587;&#x5B57;&#x521B;&#x4F5C;&#x4E0D;&#x5B8C;&#x5168;&#x6307;&#x5357;&#x300B;</a>&#x5219;&#x5199;&#x7ED9;&#x6709;&#x8868;&#x8FBE;&#x613F;&#x671B;&#x7684;&#x8BFB;&#x8005;&#xFF0C;&#x5EFA;&#x7ACB;&#x7F16;&#x8F91;&#x63A5;&#x53E3;&#x3001;&#x5B9A;&#x5236;&#x6027;&#x548C;&#x5206;&#x53D1;&#x6E20;&#x9053;&#x4E09;&#x4E2A;&#x6307;&#x6807;&#x6765;&#x70B9;&#x8BC4;&#x5728;&#x7EBF;&#x5199;&#x4F5C;&#x7684;&#x5404;&#x79CD;&#x65B9;&#x5F0F;&#xFF0C;&#x5E76;&#x63D0;&#x4F9B;&#x9009;&#x62E9;&#x5EFA;&#x8BAE;&#x3002;&#x800C;<a href="https://blog.ddlee.cn/posts/5768c6d/" target="_blank" rel="noopener">&#x300A;RSS&#xFF1A;&#x7ED9;&#x4F60;&#x6240;&#x7231;&#x7684;&#x4EBA;&#x4EE5;&#x81EA;&#x7531;&#x300B;</a>&#xFF0C;&#x5219;&#x7740;&#x529B;&#x4ECB;&#x7ECD;RSS&#x8BA2;&#x9605;&#x8FD9;&#x4E00;&#x4FE1;&#x606F;&#x83B7;&#x53D6;&#x65B9;&#x5F0F;&#xFF0C;&#x6307;&#x51FA;&#x5E73;&#x53F0;&#x4E4B;&#x6076;&#x548C;RSS&#x4E4B;&#x8F7B;&#x91CF;&#x901A;&#x7528;&#x3002;<br>&#x8FD9;&#x4E9B;&#x539F;&#x5219;/&#x6280;&#x672F;&#x5E2E;&#x52A9;&#x4E86;&#x6211;&#xFF0C;&#x6211;&#x5F88;&#x5E0C;&#x671B;&#x80FD;&#x8DDF;&#x670B;&#x53CB;&#x4EEC;&#x5206;&#x4EAB;&#x3002;</p>
<h2 id="&#x672C;&#x516C;&#x4F17;&#x53F7;&#x7684;&#x547D;&#x8FD0;"><a href="#&#x672C;&#x516C;&#x4F17;&#x53F7;&#x7684;&#x547D;&#x8FD0;" class="headerlink" title="&#x672C;&#x516C;&#x4F17;&#x53F7;&#x7684;&#x547D;&#x8FD0;"></a>&#x672C;&#x516C;&#x4F17;&#x53F7;&#x7684;&#x547D;&#x8FD0;</h2><p>&#x6211;&#x4F1A;&#x9009;&#x62E9;&#x6027;&#x5730;&#x5C06;&#x81EA;&#x5DF1;&#x672A;&#x6765;&#x5199;&#x4F5C;&#x7684;&#x5173;&#x4E8E;&#x201C;&#x6C42;&#x5BFC;&#x201D;&#x7684;&#x6587;&#x7AE0;&#x642C;&#x8FD0;&#x5230;&#x8FD9;&#x91CC;&#xFF0C;&#x53EF;&#x4EE5;&#x9884;&#x8BA1;&#x7684;&#x4E3B;&#x9898;&#x5305;&#x62EC;&#xFF1A;&#x4E2A;&#x4EBA;&#x7BA1;&#x7406;&#x3001;&#x8BFB;&#x4E66;/&#x627E;&#x4E66;&#x7ECF;&#x9A8C;&#x3001;&#x77E5;&#x8BC6;&#x6574;&#x7406;&#x5F52;&#x7C7B;&#x7684;&#x539F;&#x5219;&#x7B49;&#x7B49;&#x3002;&#x8FD9;&#x91CC;&#x4E0D;&#x4F1A;&#x6709;&#x4EFB;&#x4F55;&#x201C;&#x6C42;&#x5BFC;&#x201D;&#x4E3B;&#x9898;&#x4E4B;&#x5916;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x8003;&#x8651;&#x5230;&#x66F4;&#x65B0;&#x7684;&#x901F;&#x5EA6;&#xFF0C;&#x5927;&#x6982;&#x7387;&#x4F1A;&#x6210;&#x4E3A;&#x4E00;&#x5177;&#x5B89;&#x9759;&#x65E0;&#x6BD4;&#x7684;&#x5C38;&#x4F53;&#x3002;<br>&#x201C;&#x6C42;&#x5BFC;&#x201D;&#x4E4B;&#x540D;&#xFF0C;&#x672C;&#x6765;&#x662F;&#x4E3A;&#x6211;&#x73B0;&#x5DF2;&#x6401;&#x6D45;&#x7684;&#x64AD;&#x5BA2;&#xFF08;&#x4E00;&#x79CD;&#x97F3;&#x9891;&#x8282;&#x76EE;&#xFF09;&#x5236;&#x4F5C;&#x8BA1;&#x5212;&#x800C;&#x60F3;&#x7684;&#xFF0C;&#x539F;&#x672C;&#x7684;&#x8BBE;&#x60F3;&#x662F;&#x9080;&#x8BF7;&#x5404;&#x884C;&#x4E1A;&#x7684;&#x670B;&#x53CB;&#x4EEC;&#x4E00;&#x8D77;&#x804A;&#x804A;&#x4ED6;&#x4EEC;&#x65E5;&#x5E38;&#x751F;&#x6D3B;&#x548C;&#x4E13;&#x4E1A;&#x9886;&#x57DF;&#x201C;&#x6C42;&#x5BFC;&#x201D;&#x601D;&#x60F3;&#x7684;&#x5C55;&#x793A;&#xFF0C;&#x4F46;&#x6127;&#x4E8E;&#x81EA;&#x5DF1;&#x7684;&#x8D2B;&#x4E4F;&#x548C;&#x4EF7;&#x503C;&#x8F93;&#x51FA;&#x80FD;&#x529B;&#xFF0C;&#x6050;&#x6015;&#x5F88;&#x4E45;&#x4E4B;&#x540E;&#x624D;&#x80FD;&#x91CD;&#x542F;&#x8FD9;&#x4E2A;&#x9879;&#x76EE;&#x4E86;&#x3002;&#x5982;&#x679C;&#x60A8;&#x5728;&#x9605;&#x8BFB;&#x4E86;&#x4E0B;&#x9762;&#x7684;&#x5185;&#x5BB9;&#x540E;&#x4ECD;&#x7136;&#x51B3;&#x5B9A;&#x4E0D;&#x53D6;&#x6D88;&#x5173;&#x6CE8;&#x8FD9;&#x4E2A;&#x516C;&#x4F17;&#x53F7;&#xFF0C;&#x6211;&#x540C;&#x6837;&#x627F;&#x8BFA;&#x4E4B;&#x540E;&#x91CD;&#x542F;&#x7684;&#x64AD;&#x5BA2;&#x8BA1;&#x5212;&#x4F1A;&#x88AB;&#x642C;&#x8FD0;&#x5230;&#x8FD9;&#x91CC;&#x3002;</p>
<h2 id="&#x4E3A;&#x4EC0;&#x4E48;&#x6211;&#x4E0D;&#x9F13;&#x52B1;&#x60A8;&#x5173;&#x6CE8;&#x672C;&#x516C;&#x4F17;&#x53F7;"><a href="#&#x4E3A;&#x4EC0;&#x4E48;&#x6211;&#x4E0D;&#x9F13;&#x52B1;&#x60A8;&#x5173;&#x6CE8;&#x672C;&#x516C;&#x4F17;&#x53F7;" class="headerlink" title="&#x4E3A;&#x4EC0;&#x4E48;&#x6211;&#x4E0D;&#x9F13;&#x52B1;&#x60A8;&#x5173;&#x6CE8;&#x672C;&#x516C;&#x4F17;&#x53F7;"></a>&#x4E3A;&#x4EC0;&#x4E48;&#x6211;&#x4E0D;&#x9F13;&#x52B1;&#x60A8;&#x5173;&#x6CE8;&#x672C;&#x516C;&#x4F17;&#x53F7;</h2><p>&#x6700;&#x7B80;&#x5355;&#x7684;&#x539F;&#x56E0;&#xFF0C;&#x662F;&#x56E0;&#x4E3A;&#x672C;&#x516C;&#x4F17;&#x53F7;&#x662F;&#x6700;&#x5BB9;&#x6613;&#x88AB;&#x66FF;&#x4EE3;&#x7684;&#x3002;&#x5982;&#x679C;&#x66F4;&#x8BE6;&#x7EC6;&#x4E9B;&#xFF0C;&#x6211;&#x4EEC;&#x4ECE;&#x94FE;&#x63A5;&#x5F00;&#x59CB;&#x8BB2;&#x8D77;&#x5427;&#x3002;<br>&#x672C;&#x6765;&#x7684;&#x94FE;&#x63A5;&#xFF0C;&#x5C31;&#x662F;&#x4EE3;&#x8868;&#x201C;&#x8FDE;&#x63A5;&#x201D;&#xFF0C;&#x610F;&#x601D;&#x662F;&#x4F60;&#x70B9;&#x51FB;&#x4E00;&#x4E0B;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x4ECE;&#x8FD9;&#x4E2A;&#x7F51;&#x9875;&#x8DF3;&#x8F6C;&#x5230;&#x90A3;&#x4E2A;&#x7F51;&#x9875;&#xFF0C;&#x8FD9;&#x4E2A;&#x5141;&#x8BB8;&#x8DF3;&#x8F6C;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x610F;&#x5473;&#x7740;&#x4E24;&#x4E2A;&#x7F51;&#x9875;&#x662F;&#x8FDE;&#x63A5;&#x7740;&#x7684;&#x3002;<br>&#x5982;&#x679C;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x94FE;&#x63A5;&#x6307;&#x5411;&#x67D0;&#x4E2A;&#x9875;&#x9762;&#xFF0C;&#x90A3;&#x8FD9;&#x4E2A;&#x9875;&#x9762;&#x6211;&#x4EEC;&#x8FD8;&#x53EF;&#x4EE5;&#x8BBF;&#x95EE;&#x5417;&#xFF1F;&#x5F53;&#x7136;&#x53EF;&#x4EE5;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x624B;&#x52A8;&#x8F93;&#x5165;&#x5176;&#x5730;&#x5740;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;URL&#xFF0C;URL&#x5C31;&#x662F;&#x7F51;&#x7EDC;&#x4E16;&#x754C;&#x91CC;&#x7684;&#x95E8;&#x724C;&#x53F7;&#x3002;<br>&#x7136;&#x800C;&#x8FD9;&#x5F88;&#x9EBB;&#x70E6;&#xFF0C;&#x5373;&#x4FBF;&#x662F;&#x95E8;&#x724C;&#x53F7;&#xFF0C;&#x4E5F;&#x5E76;&#x4E0D;&#x597D;&#x8BB0;&#xFF0C;&#x800C;&#x4E14;&#x6211;&#x4EEC;&#x4E5F;&#x8BB0;&#x4E0D;&#x4E86;&#x8FD9;&#x4E48;&#x591A;&#x3002;<br>&#x4E8E;&#x662F;&#xFF0C;&#x95E8;&#x6237;&#x7F51;&#x7AD9;&#xFF0C;&#x4E00;&#x79CD;&#x4E13;&#x95E8;&#x63D0;&#x4F9B;&#x6307;&#x5411;&#x5230;&#x5176;&#x4ED6;&#x7F51;&#x7AD9;&#x7684;&#x94FE;&#x63A5;&#x7684;&#x7F51;&#x7AD9;&#xFF0C;&#x5E94;&#x8FD0;&#x800C;&#x751F;&#xFF0C;&#x6700;&#x6210;&#x529F;&#x7684;&#x4F8B;&#x5B50;&#x4E4B;&#x4E00;&#x4FBF;&#x662F;Yahoo!&#x3002;<br>&#x518D;&#x540E;&#x6765;&#x7F51;&#x7AD9;&#x589E;&#x957F;&#x7684;&#x901F;&#x5EA6;&#x8D85;&#x51FA;&#x4E86;&#x5206;&#x7C7B;&#x6574;&#x7406;&#x7684;&#x901F;&#x5EA6;&#xFF0C;&#x5206;&#x7C7B;&#x7684;&#x5C42;&#x7EA7;&#x4E5F;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#xFF0C;&#x53E6;&#x4E00;&#x79CD;&#x7D22;&#x5F15;&#x7F51;&#x7AD9;&#x7684;&#x65B9;&#x5F0F;&#x8D8A;&#x6765;&#x8D8A;&#x53D7;&#x6B22;&#x8FCE;&#xFF0C;&#x8FD9;&#x4FBF;&#x662F;&#x641C;&#x7D22;&#x5F15;&#x64CE;&#x3002;<br>&#x641C;&#x7D22;&#x5F15;&#x64CE;&#x7684;&#x6210;&#x529F;&#x4E4B;&#x5904;&#x5728;&#x4E8E;&#x6316;&#x6398;&#x4E86;&#x94FE;&#x63A5;&#x884C;&#x4E3A;&#x7684;&#x9AD8;&#x5C42;&#x4FE1;&#x606F;&#xFF1A;&#x4E00;&#x4E2A;&#x7F51;&#x9875;&#x88AB;&#x94FE;&#x63A5;&#x8D8A;&#x591A;&#xFF0C;&#x90A3;&#x5B83;&#x5E94;&#x8BE5;&#x8D8A;&#x6709;&#x4EF7;&#x503C;&#xFF0C;&#x4ECE;&#x5B83;&#x94FE;&#x63A5;&#x51FA;&#x53BB;&#x7684;&#x7F51;&#x9875;&#xFF0C;&#x4E5F;&#x5E94;&#x8BE5;&#x66F4;&#x6709;&#x4EF7;&#x503C;&#x3002;&#x8FD9;&#x5176;&#x5B9E;&#x662F;PageRank&#x7B97;&#x6CD5;&#x7684;&#x7406;&#x5FF5;&#xFF0C;&#x5B83;&#x4E0D;&#x4EC5;&#x89E3;&#x51B3;&#x4E86;&#x4E00;&#x4E2A;&#x7F51;&#x9875;&#x8D28;&#x91CF;&#x8BC4;&#x4F30;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x4E5F;&#x50AC;&#x751F;&#x4E86;&#x4E00;&#x5BB6;&#x582A;&#x79F0;&#xFF08;&#x8FC7;&#xFF09;&#x4F1F;&#x5927;&#x7684;&#x516C;&#x53F8;&#x3002;</p>
<p>&#x6211;&#x8BB2;&#x8FF0;&#x4E0A;&#x9762;&#x8FD9;&#x4E9B;&#xFF0C;&#x662F;&#x60F3;&#x8BF4;&#xFF0C;&#x94FE;&#x63A5;&#x662F;&#x4E92;&#x8054;&#x7F51;&#x4E4B;&#x201C;&#x4E92;&#x8054;&#x201D;&#x4E8C;&#x5B57;&#x7684;&#x672C;&#x6E90;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x5F88;&#x4E0D;&#x5E78;&#xFF0C;&#x60A8;&#x8BFB;&#x5230;&#x8FD9;&#x6BB5;&#x6587;&#x5B57;&#x7684;&#x9875;&#x9762;&#xFF0C;&#x662F;&#x53CD;&#x94FE;&#x63A5;&#x7684;&#x3002;&#x5728;&#x6B63;&#x6587;&#x91CC;&#xFF0C;&#x6211;&#x6CA1;&#x529E;&#x6CD5;&#x50CF;&#x5728;&#x522B;&#x7684;&#x7F51;&#x7AD9;&#x4E0A;&#x90A3;&#x6837;&#xFF0C;&#x8F93;&#x5165;&#x8FD9;&#x6837;&#x4E00;&#x53E5;&#x5F88;&#x81EA;&#x7136;&#x7684;&#x8BDD;&#xFF1A;&#x201C;&#x6709;&#x5173;PageRank&#x7B97;&#x6CD5;&#x548C;&#x641C;&#x7D22;&#x5F15;&#x64CE;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x5728;&#x3010;&#x8FD9;&#x91CC;&#x3011;&#x9605;&#x8BFB;&#x66F4;&#x591A;Google&#x521B;&#x7ACB;&#x65E9;&#x671F;&#x7684;&#x6545;&#x4E8B;&#x201D;&#x3002;&#x8FD9;&#x53E5;&#x8BDD;&#x672C;&#x5E94;&#x8BE5;&#x51FA;&#x73B0;&#x5728;&#x4E0A;&#x9762;&#x4E00;&#x6BB5;&#x7684;&#x672B;&#x5C3E;&#xFF0C;&#x4F5C;&#x4E3A;&#x521B;&#x4F5C;&#x8005;&#x800C;&#x8A00;&#xFF0C;&#x6211;&#x6D45;&#x77ED;&#x5730;&#x63CF;&#x8FF0;&#x4E86;&#x4E00;&#x4E2A;&#x6545;&#x4E8B;&#xFF0C;&#x4F46;&#x81EA;&#x89C9;&#x4E0D;&#x591F;&#x751F;&#x52A8;&#x548C;&#x5177;&#x4F53;&#xFF0C;&#x6211;&#x6709;&#x4E49;&#x52A1;&#x4E3A;&#x6211;&#x7684;&#x8BFB;&#x8005;&#x63D0;&#x4F9B;&#x66F4;&#x591A;&#x4ED6;&#x4EEC;&#x53EF;&#x80FD;&#x60F3;&#x8981;&#x8FDB;&#x4E00;&#x6B65;&#x4E86;&#x89E3;&#x7684;&#x4FE1;&#x606F;&#x3002;&#x4F46;&#x6211;&#x5728;&#x8FD9;&#x91CC;&#x505A;&#x4E0D;&#x5230;&#x3002;<br>&#x4F60;&#x4E5F;&#x8BB8;&#x6CE8;&#x610F;&#x5230;&#xFF0C;&#x8FD9;&#x4E2A;&#x9875;&#x9762;&#x7684;&#x5DE6;&#x4E0B;&#x89D2;&#x662F;&#x6709;&#x4E00;&#x4E2A;&#x201C;&#x9605;&#x8BFB;&#x539F;&#x6587;&#x201D;&#xFF08;&#x82F1;&#x6587;&#x663E;&#x793A;Read More&#xFF09;&#x7684;&#x94FE;&#x63A5;&#x7684;&#xFF0C;&#x4F60;&#x770B;&#xFF0C;&#x62B1;&#x6028;&#x4EC0;&#x4E48;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x628A;&#x8FD9;&#x4E2A;&#x94FE;&#x63A5;&#x653E;&#x5728;&#x90A3;&#x91CC;&#x561B;&#x3002;<br>&#x90A3;&#x6211;&#x4E0D;&#x7981;&#x7591;&#x60D1;&#xFF0C;&#x6211;&#x4EEC;&#x8BE5;&#x5982;&#x4F55;&#x7406;&#x89E3;&#x201C;&#x539F;&#x6587;&#x201D;&#x7684;&#x542B;&#x4E49;&#xFF1F;&#x5982;&#x679C;&#x8FD9;&#x4E2A;&#x94FE;&#x63A5;&#x679C;&#x771F;&#x662F;&#x5E94;&#x8FD9;&#x6837;&#x4F7F;&#x7528;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x6211;&#x4F5C;&#x4E3A;&#x521B;&#x4F5C;&#x8005;&#x5374;&#x65E0;&#x6743;&#x51B3;&#x5B9A;&#x8FD9;&#x4E2A;&#x201C;&#x9605;&#x8BFB;&#x539F;&#x6587;&#x201D;&#x56DB;&#x5B57;&#xFF1F;&#x6211;&#x80FD;&#x591F;&#x6539;&#x6210;&#x201C;Google&#x7684;&#x6545;&#x4E8B;&#x201D;&#xFF0C;&#x8FD9;&#x6837;&#x5C82;&#x4E0D;&#x662F;&#x66F4;&#x7B26;&#x5408;&#x94FE;&#x63A5;&#x7684;&#x76EE;&#x7684;&#xFF1F;<br>&#x4E0D;&#x4E0D;&#x4E0D;&#xFF0C;&#x4E0D;&#x662F;&#x8BA9;&#x4F60;&#x8FD9;&#x6837;&#x7528;&#x7684;&#xFF0C;&#x4F60;&#x586B;&#x5165;&#x7684;&#x7684;&#x90A3;&#x4E2A;&#x94FE;&#x63A5;&#x5C31;&#x5E94;&#x8BE5;&#x662F;&#x5B57;&#x9762;&#x610F;&#x4E49;&#x4E0A;&#x7684;&#x201C;&#x539F;&#x6587;&#x201D;&#x3002;<br>&#x90A3;&#x4E8B;&#x60C5;&#x53D8;&#x5F97;&#x66F4;&#x52A0;&#x540A;&#x8BE1;&#x4E86;&#x3002;&#x65E2;&#x7136;&#x8BFB;&#x8005;&#x5728;&#x8FD9;&#x91CC;&#x5DF2;&#x7136;&#x80FD;&#x591F;&#x628A;&#x6587;&#x7AE0;&#x8BFB;&#x5B8C;&#xFF0C;&#x54EA;&#x6765;&#x7684;&#x52A8;&#x673A;&#x53BB;&#x8BFB;&#x201C;&#x539F;&#x6587;&#x201D;&#xFF1F;&#x96BE;&#x9053;&#x8FD9;&#x4E2A;&#x201C;&#x539F;&#x6587;&#x201D;&#x8DDF;&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x770B;&#x5230;&#x7684;&#x6587;&#x7AE0;&#x6709;&#x4E0D;&#x4E00;&#x6837;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x8FD8;&#x662F;&#x8FD9;&#x662F;&#x4E00;&#x53E5;&#x6240;&#x8C13;&#x7684;&#x201C;&#x4FB5;&#x5220;&#x201D;&#x58F0;&#x660E;&#xFF0C;&#x4EE3;&#x8868;&#x6211;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x662F;&#x4ECE;&#x201C;&#x539F;&#x6587;&#x201D;&#x94FE;&#x63A5;&#x90A3;&#x91CC;&#x8F6C;&#x8F7D;&#x8FC7;&#x6765;&#x7684;&#xFF1F;&#x5982;&#x679C;&#x662F;&#x540E;&#x8005;&#xFF0C;&#x90A3;&#x771F;&#x662F;&#x4EE4;&#x4EBA;&#x66F4;&#x4E0D;&#x5F97;&#x89E3;&#xFF1A;&#x4E3A;&#x4EC0;&#x4E48;&#x4E0D;&#x76F4;&#x63A5;&#x5206;&#x4EAB;&#x8FD9;&#x4E2A;&#x201C;&#x539F;&#x6587;&#x201D;&#x94FE;&#x63A5;&#x5230;&#x5E73;&#x53F0;&#x91CC;&#xFF0C;&#x800C;&#x662F;&#x8981;&#x8F9B;&#x8F9B;&#x82E6;&#x82E6;&#x628A;&#x4EBA;&#x5BB6;&#x7684;&#x6587;&#x5B57;&#x590D;&#x5236;&#x7C98;&#x8D34;&#x8FC7;&#x6765;&#xFF0C;&#x518D;&#x94FE;&#x63A5;&#x56DE;&#x53BB;&#xFF1F;<br>&#x8BD5;&#x95EE;&#xFF0C;&#x6211;&#x4EEC;&#x662F;&#x5426;&#x5728;&#x6D4F;&#x89C8;&#x7F51;&#x9875;&#x65F6;&#xFF0C;&#x7ECF;&#x5E38;&#x770B;&#x5230;&#x6B63;&#x6587;&#x6CA1;&#x6709;&#x4E00;&#x5904;&#x94FE;&#x63A5;&#xFF0C;&#x5374;&#x5728;&#x6587;&#x7AE0;&#x672B;&#x5C3E;&#x6709;&#x4E00;&#x4E2A;&#x201C;&#x9605;&#x8BFB;&#x539F;&#x6587;&#x201D;&#x94FE;&#x63A5;&#xFF0C;&#x6307;&#x5411;&#x4E00;&#x4E2A;&#x516C;&#x4F17;&#x53F7;&#x5E73;&#x53F0;&#x7684;&#x6587;&#x7AE0;&#xFF1F;&#x5982;&#x679C;&#x8FD9;&#x6837;&#x7684;&#x666F;&#x8C61;&#x4EE4;&#x4F60;&#x611F;&#x5230;&#x6ED1;&#x7A3D;&#xFF0C;&#x4F46;&#x4E3A;&#x4EC0;&#x4E48;&#x53CD;&#x8FC7;&#x6765;&#x7684;&#x60C5;&#x666F;&#x5374;&#x88AB;&#x9ED8;&#x8BA4;&#x662F;&#x5408;&#x7406;&#x7684;&#xFF1F;<br>&#x201C;&#x9605;&#x8BFB;&#x539F;&#x6587;&#x201D;&#x94FE;&#x63A5;&#xFF0C;&#x662F;&#x4E00;&#x79CD;&#x66B4;&#x884C;&#xFF0C;&#x548C;&#x4E00;&#x5757;&#x4F24;&#x75A4;&#x3002;</p>
<p>&#x8BF7;&#x539F;&#x8C05;&#x6211;&#x7684;&#x8052;&#x566A;&#x3002;&#x6211;&#x53EA;&#x662F;&#x8BD5;&#x56FE;&#x6307;&#x51FA;&#xFF0C;&#x8FD9;&#x4E2A;&#x5E73;&#x53F0;&#x4E0D;&#x662F;&#x9F13;&#x52B1;&#x539F;&#x521B;&#x7684;&#xFF0C;&#x800C;&#x662F;&#x9F13;&#x52B1;&#x642C;&#x8FD0;&#x548C;&#x6284;&#x88AD;&#xFF0C;&#x5B83;&#x4E5F;&#x4E0D;&#x4EE5;&#x94FE;&#x63A5;&#x4E3A;&#x4EF7;&#x503C;&#xFF0C;&#x800C;&#x662F;&#x4E92;&#x8054;&#x7F51;&#x4E16;&#x754C;&#x7684;&#x4E00;&#x5904;&#x9ED1;&#x6D1E;&#xFF0C;&#x4EFB;&#x4F55;&#x88AB;&#x5B83;&#x541E;&#x566C;&#x8FDB;&#x7684;&#x6CE8;&#x610F;&#x529B;&#xFF0C;&#x90FD;&#x5F88;&#x96BE;&#x9003;&#x9038;&#x51FA;&#x6765;&#x4E86;&#xFF0C;&#x4F55;&#x51B5;&#x4ECE;&#x5176;&#x4E2D;&#x51FA;&#x53D1;&#x8005;&#x3002;&#x5B83;&#x4E0D;&#x662F;&#x5728;&#x505A;&#x5185;&#x5BB9;&#x7684;&#x751F;&#x610F;&#xFF0C;&#x800C;&#x662F;&#x5728;&#x505A;&#x6CE8;&#x610F;&#x529B;&#x7684;&#x751F;&#x610F;&#xFF0C;&#x800C;&#x6CE8;&#x610F;&#x529B;&#x8D4B;&#x6743;&#x4E86;&#x5E73;&#x53F0;&#xFF0C;&#x5E73;&#x53F0;&#x5219;&#x7B5B;&#x67E5;&#x4E86;&#x5185;&#x5BB9;&#xFF0C;&#x80C1;&#x8FEB;&#x4E86;&#x4F5C;&#x8005;&#x3002;<br>&#x8BF7;&#x89C2;&#x5BDF;&#x60A8;&#x8BFB;&#x5230;&#x7684;&#x5A92;&#x4F53;&#x6587;&#x7AE0;&#xFF0C;&#x5927;&#x90E8;&#x5206;&#x662F;&#x201C;&#x7F16;&#x8BD1;&#x201D;&#x548C;&#x201C;&#x8F6C;&#x8F7D;&#x201D;&#x7684;&#xFF0C;&#x800C;&#x4E14;&#x76F8;&#x5F53;&#x4E00;&#x90E8;&#x5206;&#x662F;&#x4E0D;&#x6DFB;&#x52A0;&#x201C;&#x9605;&#x8BFB;&#x539F;&#x6587;&#x201D;&#x94FE;&#x63A5;&#x7684;&#xFF0C;&#x751A;&#x81F3;&#x8FDE;&#x539F;&#x4F5C;&#x8005;&#x3001;&#x539F;&#x6587;&#x7AE0;&#x540D;&#x90FD;&#x4E0D;&#x63D0;&#x3002;&#x66F4;&#x52A0;&#x8FC7;&#x5206;&#x7684;&#xFF0C;&#x4EFB;&#x610F;&#x5728;&#x4F5C;&#x8005;&#x6587;&#x7AE0;&#x91CC;&#x6DFB;&#x52A0;&#x81EA;&#x5DF1;&#x7684;&#x5176;&#x4ED6;&#x6284;&#x88AD;&#x6587;&#x7AE0;&#x548C;&#x5E7F;&#x544A;&#xFF0C;&#x4E0D;&#x9075;&#x5B88;&#x771F;&#x6B63;&#x7684;&#x201C;&#x539F;&#x6587;&#x201D;&#x4E4B;&#x8F6C;&#x8F7D;&#x89C4;&#x8303;&#x3002;&#x6211;&#x65E0;&#x610F;&#x8FFD;&#x95EE;&#x5404;&#x516C;&#x4F17;&#x53F7;&#x91C7;&#x7F16;&#x4E4B;&#x8D23;&#xFF0C;&#x6211;&#x5BF9;&#x5E2E;&#x8BFB;&#x8005;&#x6253;&#x7834;&#x8BED;&#x8A00;&#x9694;&#x9602;&#x7684;&#x8BD1;&#x8005;&#x81F4;&#x4EE5;&#x656C;&#x610F;&#x3002;&#x4F46;&#x82E5;&#x5E73;&#x53F0;&#x4E0A;&#x5145;&#x65A5;&#x7740;&#x8FD9;&#x6837;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x800C;&#x5E73;&#x53F0;&#x89C4;&#x5219;&#x7684;&#x8BBE;&#x8BA1;&#x65E0;&#x7F6A;&#xFF0C;&#x90A3;&#x9519;&#x5728;&#x4F55;&#x5904;&#x5462;&#xFF1F;<br>&#x5982;&#x679C;&#x518D;&#x8FDB;&#x4E00;&#x6B65;&#xFF0C;&#x5BF9;&#x4E8E;&#x8FD9;&#x4E2A;&#x5E73;&#x53F0;&#x4E0A;&#x7684;&#x539F;&#x521B;&#x6587;&#x7AE0;&#xFF0C;&#x6309;&#x7167;Robot.txt&#x89C4;&#x5219;&#xFF08;&#x8FD9;&#x4E00;&#x6587;&#x4EF6;&#x662F;&#x722C;&#x866B;&#x9886;&#x57DF;&#x81EA;&#x5F8B;&#x7684;&#x89C4;&#x8303;&#xFF09;&#xFF0C;&#x8FD9;&#x4E9B;&#x6587;&#x7AE0;&#x662F;&#x4E0D;&#x80FD;&#x88AB;&#x4EFB;&#x4F55;&#x722C;&#x866B;Agent&#x722C;&#x53D6;&#x7684;&#xFF0C;&#x8FDE;&#x641C;&#x72D7;&#x7684;&#x72EC;&#x5BB6;&#x5FAE;&#x4FE1;&#x641C;&#x7D22;&#x722C;&#x866B;&#x90FD;&#x4E0D;&#x80FD;&#x3002;&#x4E8E;&#x662F;&#x5F53;&#x4F60;&#x8BD5;&#x56FE;&#x5728;archive.org&#xFF08;&#x4E00;&#x4E2A;&#x81F4;&#x529B;&#x4E8E;&#x4E3A;&#x6240;&#x6709;&#x7F51;&#x9875;&#x5185;&#x5BB9;&#x5EFA;&#x7ACB;&#x5B58;&#x6863;&#x7684;&#x516C;&#x76CA;&#x9879;&#x76EE;&#xFF09;&#x68C0;&#x7D22;&#x4EFB;&#x610F;&#x4E00;&#x7BC7;&#x516C;&#x4F17;&#x53F7;&#x6587;&#x7AE0;&#x65F6;&#xFF0C;&#x90FD;&#x662F;&#x4E00;&#x7247;&#x7A7A;&#x767D;&#xFF0C;&#x800C;&#x4E14;&#x5728;&#x5C06;&#x6765;&#x4E5F;&#x4F1A;&#x5982;&#x6B64;&#x3002;&#x5DE8;&#x91CF;&#x7684;&#x4E2D;&#x6587;&#x7F51;&#x9875;&#x5185;&#x5BB9;&#xFF0C;&#x5F88;&#x53EF;&#x80FD;&#x6210;&#x4E3A;&#x540E;&#x4EBA;&#x77E5;&#x8BC6;&#x7248;&#x56FE;&#x91CC;&#x7684;&#x4E00;&#x7247;&#x5DE8;&#x5927;&#x6B8B;&#x7F3A;&#xFF0C;&#x4ED6;&#x4EEC;&#x5C06;&#x5931;&#x53BB;&#x7406;&#x89E3;&#x6211;&#x4EEC;&#x5F53;&#x524D;&#x793E;&#x4F1A;&#x72B6;&#x6001;&#x7684;&#x91CD;&#x8981;&#x6750;&#x6599;&#xFF0C;&#x5386;&#x53F2;&#x5C06;&#x88AB;&#x4EFB;&#x610F;&#x8BB2;&#x8FF0;&#x3002;&#x8FD9;&#x6574;&#x4E2A;&#x5E73;&#x53F0;&#xFF0C;&#x662F;&#x4E00;&#x4E2A;&#x4E8B;&#x5B9E;&#x4E0A;&#x7684;&#x5C40;&#x57DF;&#x7F51;&#xFF0C;&#x5904;&#x5904;&#x7ACB;&#x6EE1;&#x9AD8;&#x5899;&#xFF0C;&#x5206;&#x5272;&#x548C;&#x56F4;&#x5835;&#x4E00;&#x5207;&#x5728;&#x8301;&#x58EE;&#x6210;&#x957F;&#x7740;&#x7684;&#x5FC3;&#x7075;&#x3002;</p>
<p>&#x6211;&#x4EB2;&#x7231;&#x7684;&#x8BFB;&#x8005;&#xFF0C;&#x4F60;&#x4EEC;&#x624D;&#x662F;&#x8FD9;&#x4E2A;&#x5E73;&#x53F0;&#x6700;&#x5177;&#x6709;&#x5F71;&#x54CD;&#x529B;&#x7684;&#x56E0;&#x7D20;&#x3002;&#x5E9E;&#x5927;&#x7684;&#x6570;&#x91CF;&#x3001;&#x9AD8;&#x6DA8;&#x7684;&#x70ED;&#x60C5;&#xFF0C;&#x5438;&#x5F15;&#x7740;&#x5177;&#x6709;&#x65E0;&#x8FB9;&#x521B;&#x9020;&#x529B;&#x548C;&#x60F3;&#x8C61;&#x529B;&#x7684;&#x4F5C;&#x8005;&#x4EEC;&#x3002;&#x4F46;&#x5728;&#x8FD9;&#x4E2A;&#x5E73;&#x53F0;&#x4E0A;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x4E92;&#x52A8;&#x65B9;&#x5F0F;&#x663E;&#x7136;&#x88AB;&#x50F5;&#x5316;&#x5730;&#x9650;&#x5236;&#x4E86;&#xFF1A;&#x8BC4;&#x8BBA;&#x65F6;&#x5FC5;&#x987B;&#x5173;&#x6CE8;&#x516C;&#x4F17;&#x53F7;&#x3001;&#x63D0;&#x4EA4;&#x7684;&#x8BC4;&#x8BBA;&#x9700;&#x8981;&#x88AB;&#x5BA1;&#x6838;&#x3001;&#x4E0D;&#x80FD;&#x5728;&#x5176;&#x4ED6;&#x8BFB;&#x8005;&#x7684;&#x8BC4;&#x8BBA;&#x4E0B;&#x7EE7;&#x7EED;&#x8BC4;&#x8BBA;&#xFF08;&#x53EA;&#x6709;&#x6295;&#x7968;&#x7684;&#x6743;&#x5229;&#xFF09;&#xFF0C;&#x4F60;&#xB7;&#x751A;&#x81F3;&#x4E0D;&#x80FD;&#x5728;&#x6B64;&#x7BC7;&#x6587;&#x7AE0;&#x5E95;&#x90E8;&#x6279;&#x8BC4;&#x6211;&#xFF0C;&#x56E0;&#x4E3A;&#x65B0;&#x6CE8;&#x518C;&#x516C;&#x4F17;&#x53F7;&#x7684;&#x7559;&#x8A00;&#x529F;&#x80FD;&#x88AB;&#x5173;&#x95ED;&#x4E86;&#x3002;&#x672C;&#x5E94;&#x4FC3;&#x6210;&#x516C;&#x5171;&#x8BA8;&#x8BBA;&#x7684;&#x7A7A;&#x95F4;&#xFF0C;&#x88AB;&#x538B;&#x7F29;&#x6210;&#x4E86;&#x201C;&#x597D;&#x770B;&#x201D;&#x201C;&#x70B9;&#x8D5E;&#x201D;&#x7B49;&#x7B80;&#x5355;&#x884C;&#x4E3A;&#xFF0C;&#x5B9B;&#x5982;&#x4E00;&#x573A;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x8BAE;&#x8BBA;&#x7684;&#x65E0;&#x58F0;&#x8868;&#x6F14;&#x3002;&#x5982;&#x679C;&#x4ED4;&#x7EC6;&#x5206;&#x6790;&#x8BFB;&#x8005;&#x4E0E;&#x4F5C;&#x8005;&#x95F4;&#x548C;&#x8BFB;&#x8005;&#x4E0E;&#x8BFB;&#x8005;&#x95F4;&#x8FD9;&#x4E24;&#x5BF9;&#x4E92;&#x52A8;&#x5173;&#x7CFB;&#xFF0C;&#x76F8;&#x6BD4;&#x5341;&#x5E74;&#x524D;&#x201C;&#x4EBA;&#x5404;&#x6709;&#x5FD7;&#x201D;&#x7684;&#x535A;&#x5BA2;&#x65F6;&#x4EE3;&#x548C;&#x8BBA;&#x575B;&#x3001;BBS&#x5174;&#x76DB;&#x4E4B;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x5230;&#x5E95;&#x662F;&#x5728;&#x8FDB;&#x6B65;&#x8FD8;&#x662F;&#x5728;&#x9000;&#x6B65;&#xFF1F;<br>&#x6211;&#x76F8;&#x4FE1;&#x4EBA;&#x4EBA;&#x6709;&#x81EA;&#x4E3B;&#x7684;&#x54C1;&#x5473;&#x3001;&#x72EC;&#x7ACB;&#x7684;&#x5224;&#x65AD;&#xFF0C;&#x5728;&#x6C9F;&#x901A;&#x3001;&#x8BA8;&#x8BBA;&#x548C;&#x7B5B;&#x9009;&#x4E2D;&#xFF0C;&#x7406;&#x89E3;&#x4F1A;&#x5EFA;&#x7ACB;&#xFF0C;&#x5982;&#x679C;&#x8DB3;&#x591F;&#x5E78;&#x8FD0;&#xFF0C;&#x5171;&#x8BC6;&#x4F1A;&#x8FBE;&#x6210;&#x3002;&#x6211;&#x4E5F;&#x8BA4;&#x4E3A;&#xFF0C;&#x8FD9;&#x4E9B;&#x5728;&#x8FD9;&#x4E2A;&#x5E73;&#x53F0;&#x66F4;&#x96BE;&#x5B9E;&#x73B0;&#x3002;<br>&#x56E0;&#x6B64;&#xFF0C;&#x6211;&#x4ECD;&#x7136;&#x575A;&#x6301;&#x6211;&#x5728;&#x516C;&#x4F17;&#x53F7;&#x88AB;&#x5173;&#x6CE8;&#x81EA;&#x52A8;&#x56DE;&#x590D;&#x91CC;&#x7684;&#x5EFA;&#x8BAE;&#xFF1A;&#x6211;&#x6073;&#x8BF7;&#x60A8;&#x53D6;&#x6D88;&#x5173;&#x6CE8;&#x6240;&#x6709;&#x53EF;&#x88AB;&#x66FF;&#x4EE3;&#x7684;&#x516C;&#x4F17;&#x53F7;&#xFF0C;&#x800C;&#x663E;&#x7136;&#x672C;&#x516C;&#x4F17;&#x53F7;&#x662F;&#x6700;&#x5BB9;&#x6613;&#x88AB;&#x53D6;&#x4EE3;&#x7684;&#x4E4B;&#x4E00;&#x2014;&#x2014;&#x6211;&#x672C;&#x4EBA;&#x901A;&#x8FC7;&#x5176;&#x4ED6;&#x65B9;&#x5F0F;&#x53D1;&#x5E03;&#x7684;&#x521B;&#x4F5C;&#x5185;&#x5BB9;&#x66F4;&#x5BB9;&#x6613;&#x627E;&#x5230;&#x3001;&#x66F4;&#x5168;&#x9762;&#x3001;&#x7EC4;&#x7EC7;&#x5F62;&#x5F0F;&#x66F4;&#x597D;&#x3002;&#x5173;&#x4E8E;&#x5982;&#x4F55;&#x53D6;&#x4EE3;&#xFF0C;&#x6211;&#x60F3;&#x60A8;&#x5DF2;&#x9605;&#x8BFB;&#x8FC7;&#x672C;&#x516C;&#x4F17;&#x53F7;&#x5173;&#x4E8E;RSS&#x8BA2;&#x9605;&#x7684;&#x6587;&#x7AE0;&#xFF08;&#x4F4D;&#x7F6E;&#xFF1A;&#x201C;&#x516C;&#x4F17;&#x53F7;&#x83DC;&#x5355;-&#x63A8;&#x8350;-RSS&#x201D;&#xFF09;&#xFF0C;&#x6211;&#x771F;&#x8BDA;&#x5730;&#x5E0C;&#x671B;&#x60A8;&#x80FD;&#x591F;&#x8003;&#x8651;&#x4E00;&#x4E0B;&#x3002;</p>
<p>&#x672C;&#x6587;&#x9075;&#x4ECE;<a href="(https://creativecommons.org/licenses/by-sa/4.0/deed.zh">&#x7F72;&#x540D;-&#x76F8;&#x540C;&#x65B9;&#x5F0F;&#x5171;&#x4EAB;4.0&#x56FD;&#x9645;&#x534F;&#x8BAE;(CC BY-SA 4.0)</a>)&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x5728;&#x9075;&#x5B88;&#x4EE5;&#x4E0B;&#x6761;&#x4EF6;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF1A;</p>
<ul>
<li>&#x7F72;&#x540D;</li>
<li>&#x60A8;&#x7684;&#x4F5C;&#x54C1;&#x540C;&#x6837;&#x9075;&#x4ECE;&#x7F72;&#x540D;-&#x76F8;&#x540C;&#x65B9;&#x5F0F;&#x5171;&#x4EAB;4.0&#x56FD;&#x9645;&#x534F;&#x8BAE;(CC BY-SA 4.0)<br>&#x60A8;&#x53EF;&#x4EE5;&#xFF1A;</li>
<li>&#x5728;&#x4EFB;&#x610F;&#x5A92;&#x4ECB;&#x590D;&#x5236;&#x3001;&#x5206;&#x53D1;&#x672C;&#x4F5C;&#x54C1;</li>
<li>&#x5728;&#x672C;&#x4F5C;&#x54C1;&#x57FA;&#x7840;&#x4E0A;&#x8FDB;&#x884C;&#x4FEE;&#x6539;&#x3001;&#x518D;&#x521B;&#x4F5C;&#xFF0C;&#x5E76;&#x4E14;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x5546;&#x4E1A;&#x76EE;&#x7684;<br>&#x6211;&#x518D;&#x52A0;&#x4E00;&#x53E5;&#xFF1A;&#x82E5;&#x516C;&#x4F17;&#x53F7;&#x5E73;&#x53F0;&#x5185;&#x5BB9;&#x534F;&#x8BAE;&#x4E0E;&#x672C;&#x6587;&#x58F0;&#x660E;&#x534F;&#x8BAE;&#x6709;&#x51B2;&#x7A81;&#xFF0C;&#x4EE5;&#x672C;&#x6587;&#x58F0;&#x660E;&#x534F;&#x8BAE;&#x4E3A;&#x51C6;&#x3002;&#x4F46;&#x6211;&#x5E76;&#x4E0D;&#x6E05;&#x695A;&#x8FD9;&#x53E5;&#x8BDD;&#x662F;&#x5426;&#x5728;&#x6CD5;&#x7406;&#x4E0A;&#x6709;&#x6548;&#xFF0C;&#x5C3D;&#x7BA1;&#x6309;&#x6211;&#x5F00;&#x901A;&#x516C;&#x4F17;&#x53F7;&#x5373;&#x9ED8;&#x8BA4;&#x7B7E;&#x8BA2;&#x7684;&#x534F;&#x8BAE;&#x6765;&#x770B;&#xFF0C;&#x6B64;&#x58F0;&#x660E;&#x4F3C;&#x4E4E;&#x4E3A;&#x5F92;&#x52B3;&#x3002;&#x6211;&#x5C06;&#x672C;&#x6587;&#x7684;&#x552F;&#x4E00;&#x201C;&#x9605;&#x8BFB;&#x539F;&#x6587;&#x201D;&#x94FE;&#x63A5;&#x5E84;&#x91CD;&#x5730;&#x732E;&#x7ED9;&#x8FD9;&#x4E00;&#x534F;&#x8BAE;&#xFF0C;&#x8BF7;&#x81EA;&#x884C;&#x67E5;&#x770B;&#x2014;&#x2014;&#x5982;&#x679C;&#x60A8;&#x611F;&#x5174;&#x8DA3;&#x4E14;&#x60F3;&#x4F53;&#x9A8C;&#x8FD9;&#x4EFD;&#x6ED1;&#x7A3D;&#x7684;&#x8BDD;&#x3002;</li>
</ul>

    
    </div>
    
    <div class="columns is-variable is-1 is-multiline is-mobile">
    
        <span class="column is-narrow"><a class="tag is-light article-tag" href="/tags/Drivative/">#Drivative</a></span>
    
        <span class="column is-narrow"><a class="tag is-light article-tag" href="/tags/Digital-Life/">#Digital Life</a></span>
    
        <span class="column is-narrow"><a class="tag is-light article-tag" href="/tags/Reading/">#Reading</a></span>
    
    </div>
    
    
    <div class="columns is-mobile is-multiline article-nav">
        <span class="column is-12-mobile is-half-desktop is-hidden-mobile article-nav-prev">
            
        </span>
        <span class="column is-12-mobile is-half-desktop  article-nav-next">
            
            <a href="/posts/5768c6d/">RSS：给你所爱的人以自由</a>
            
        </span>
    </div>
    
</article>




<div class="comments">
    <h3 class="title is-4">评论</h3>
    
<script>
    var disqus_config = function () {
        this.page.url = 'https://blog.ddlee.cc/posts/da5ae4d8/';
        this.page.identifier = 'posts/da5ae4d8/';
        
        this.language = 'zh';
        
    };
    (function() {
        var d = document, s = d.createElement('script');  
        s.src = '//' + 'ddlee96' + '.disqus.com/embed.js';
        s.setAttribute('data-timestamp', +new Date());
        (d.head || d.body).appendChild(s);
    })();
</script>

<div id="disqus_thread">
    
    <noscript>Please enable JavaScript to view the <a href="//disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
</div>
</div>

    </div>
</section>
    <footer class="footer">
    <div class="container">
        <div class="columns content">
            <div class="column is-narrow has-text-centered">
                &copy; 2020 ddlee&nbsp;
                Powered by <a href="http://hexo.io/" target="_blank">Hexo</a> & <a href="http://github.com/ppoffice/hexo-theme-minos">Minos</a>
            </div>
            <div class="column is-hidden-mobile"></div>

            
            <div class="column is-narrow">
                <div class="columns is-mobile is-multiline is-centered">
                
                    
                <a class="column is-narrow has-text-black" title="GitHub" href="https://github.com/ddlee-cn">
                    
                    <i class="fab fa-github"></i>
                    
                </a>
                
                    
                <a class="column is-narrow has-text-black" title="Telegram" href="https://t.me/ddleecn">
                    
                    <i class="fab fa-telegram-plane"></i>
                    
                </a>
                
                </div>
            </div>
            
            
        </div>
    </div>
</footer>
    <script src="//cdnjs.cloudflare.com/ajax/libs/jquery/3.3.1/jquery.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/moment.js/2.22.2/moment-with-locales.min.js"></script>

<!-- test if the browser is outdated -->
<div id="outdated">
    <h6>Your browser is out-of-date!</h6>
    <p>Update your browser to view this website correctly. <a id="btnUpdateBrowser" href="http://outdatedbrowser.com/">Update my browser now </a></p>
    <p class="last"><a href="#" id="btnCloseUpdateBrowser" title="Close">&times;</a></p>
</div>
<script src="//cdnjs.cloudflare.com/ajax/libs/outdated-browser/1.1.5/outdatedbrowser.min.js"></script>
<script>
    $(document).ready(function () {
        // plugin function, place inside DOM ready function
        outdatedBrowser({
            bgColor: '#f25648',
            color: '#ffffff',
            lowerThan: 'flex'
        })
    });
</script>

<script>
    window.FontAwesomeConfig = {
        searchPseudoElements: true
    }
    moment.locale("zh-CN");
</script>


    
    
<script src="https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.4/MathJax.js?config=TeX-MML-AM_CHTML"></script>
<script>
    MathJax.Hub.Config({
        "HTML-CSS": {
            matchFontHeight: false
        },
        SVG: {
            matchFontHeight: false
        },
        CommonHTML: {
            matchFontHeight: false
        },
        tex2jax: {
            inlineMath: [
                ['$','$'],
                ['\\(','\\)']
            ]
        }
    });
</script>

    
    
    
    
<script src="//cdnjs.cloudflare.com/ajax/libs/lightgallery/1.6.8/js/lightgallery-all.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/justifiedGallery/3.6.5/js/jquery.justifiedGallery.min.js"></script>
<script>
    (function ($) {
        $(document).ready(function () {
            if (typeof($.fn.lightGallery) === 'function') {
                $('.article.gallery').lightGallery({ selector: '.gallery-item' });
            }
            if (typeof($.fn.justifiedGallery) === 'function') {
                $('.justified-gallery').justifiedGallery();
            }
        });
    })(jQuery);
</script>

    
    
    <script src="https://cdnjs.cloudflare.com/ajax/libs/clipboard.js/2.0.0/clipboard.min.js"></script>
    <style>
        .hljs {
            position: relative;
        }

        .hljs .clipboard-btn {
            float: right;
            color: #9a9a9a;
            background: none;
            border: none;
            cursor: pointer;
        }

        .hljs .clipboard-btn:hover {
          color: #8a8a8a;
        }

        .hljs > .clipboard-btn {
            display: none;
            position: absolute;
            right: 4px;
            top: 4px;
        }

        .hljs:hover > .clipboard-btn {
            display: inline;
        }

        .hljs > figcaption > .clipboard-btn {
            margin-right: 4px;
        }
    </style>
    <script>
      $(document).ready(function () {
        $('figure.hljs').each(function(i, figure) {
          var codeId = 'code-' + i;
          var code = figure.querySelector('.code');
          var copyButton = $('<button>Copy <i class="far fa-clipboard"></i></button>');
          code.id = codeId;
          copyButton.addClass('clipboard-btn');
          copyButton.attr('data-clipboard-target-id', codeId);

          var figcaption = figure.querySelector('figcaption');

          if (figcaption) {
            figcaption.append(copyButton[0]);
          } else {
            figure.prepend(copyButton[0]);
          }
        })

        var clipboard = new ClipboardJS('.clipboard-btn', {
          target: function(trigger) {
            return document.getElementById(trigger.getAttribute('data-clipboard-target-id'));
          }
        });
        clipboard.on('success', function(e) {
          e.clearSelection();
        })
      })
    </script>

    
    

    


<script src="/js/script.js"></script>

    
    <div class="searchbox ins-search">
    <div class="searchbox-mask"></div>
    <div class="searchbox-container ins-search-container">
        <div class="searchbox-input-wrapper">
            <input type="text" class="searchbox-input ins-search-input" placeholder="站内搜索">
            <span class="searchbox-close ins-close ins-selectable"><i class="fa fa-times-circle"></i></span>
        </div>
        <div class="searchbox-result-wrapper ins-section-wrapper">
            <div class="ins-section-container"></div>
        </div>
    </div>
</div>
<script>
    (function (window) {
        var INSIGHT_CONFIG = {
            TRANSLATION: {
                POSTS: '文章',
                PAGES: '页面',
                CATEGORIES: '分类',
                TAGS: '标签',
                UNTITLED: '(无标题)',
            },
            CONTENT_URL: '/content.json',
        };
        window.INSIGHT_CONFIG = INSIGHT_CONFIG;
    })(window);
</script>
<script src="/js/insight.js"></script><!-- hexo-inject:begin --><!-- Begin: Injected MathJax -->
<script type="text/x-mathjax-config">
  MathJax.Hub.Config("");
</script>

<script type="text/x-mathjax-config">
  MathJax.Hub.Queue(function() {
    var all = MathJax.Hub.getAllJax(), i;
    for(i=0; i < all.length; i += 1) {
      all[i].SourceElement().parentNode.className += ' has-jax';
    }
  });
</script>

<script type="text/javascript" src="https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.1/MathJax.js?config=TeX-AMS-MML_HTMLorMML">
</script>
<!-- End: Injected MathJax -->
<!-- hexo-inject:end -->
    
</body>
</html>