<!DOCTYPE html>
<html class="has-navbar-fixed-top">
<head><meta name="generator" content="Hexo 3.9.0">
    <!-- hexo-inject:begin --><!-- hexo-inject:end --><meta charset="utf-8">
<title>在线文字创作不完全指南 - 萧爽楼</title>
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">

<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/outdated-browser/1.1.5/outdatedbrowser.min.css">




<meta name="description" content="我叫李家丞，现在在USTC念书。博客的内容主要包括个人的生活、读书感想，也包括数学、互联网、编程语言、人工智能等方面的学习侧记。">





    <meta name="description" content="&amp;#x8868;&amp;#x8FBE;&amp;#x548C;&amp;#x521B;&amp;#x4F5C;&amp;#x662F;&amp;#x81EA;&amp;#x6211;&amp;#x80FD;&amp;#x91CF;&amp;#x91CA;&amp;#x653E;&amp;#x7684;&amp;#x4E00;&amp;#x4E2A;&amp;#x7A97;&amp;#x53E3;&amp;#x3002;&amp;#x6CA1;&amp;#x6709;&amp;#x4E00;&amp;#x4E2A;&amp;#x4EBA;&amp;#x662F;&amp;#x8D2B;">
<meta name="keywords" content="Digital Life,Blog,Individual Development,Derivative,Writing">
<meta property="og:type" content="article">
<meta property="og:title" content="在线文字创作不完全指南">
<meta property="og:url" content="https://blog.ddlee.cc/posts/599cb823/index.html">
<meta property="og:site_name" content="萧爽楼">
<meta property="og:description" content="&amp;#x8868;&amp;#x8FBE;&amp;#x548C;&amp;#x521B;&amp;#x4F5C;&amp;#x662F;&amp;#x81EA;&amp;#x6211;&amp;#x80FD;&amp;#x91CF;&amp;#x91CA;&amp;#x653E;&amp;#x7684;&amp;#x4E00;&amp;#x4E2A;&amp;#x7A97;&amp;#x53E3;&amp;#x3002;&amp;#x6CA1;&amp;#x6709;&amp;#x4E00;&amp;#x4E2A;&amp;#x4EBA;&amp;#x662F;&amp;#x8D2B;">
<meta property="og:locale" content="zh-cn">
<meta property="og:updated_time" content="2020-05-16T04:12:20.292Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="在线文字创作不完全指南">
<meta name="twitter:description" content="&amp;#x8868;&amp;#x8FBE;&amp;#x548C;&amp;#x521B;&amp;#x4F5C;&amp;#x662F;&amp;#x81EA;&amp;#x6211;&amp;#x80FD;&amp;#x91CF;&amp;#x91CA;&amp;#x653E;&amp;#x7684;&amp;#x4E00;&amp;#x4E2A;&amp;#x7A97;&amp;#x53E3;&amp;#x3002;&amp;#x6CA1;&amp;#x6709;&amp;#x4E00;&amp;#x4E2A;&amp;#x4EBA;&amp;#x662F;&amp;#x8D2B;">





<link rel="icon" href="/favicon.png">


<link rel="stylesheet" href="//fonts.googleapis.com/css?family=Ovo|Source+Code+Pro">
<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/bulma/0.6.2/css/bulma.min.css">


<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/lightgallery/1.6.8/css/lightgallery.min.css">
<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/justifiedGallery/3.6.5/css/justifiedGallery.min.css">


<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/highlight.js/9.12.0/styles/atom-one-light.min.css">

<link rel="stylesheet" href="/css/style.css">

<script defer src="//use.fontawesome.com/releases/v5.0.8/js/all.js"></script><!-- hexo-inject:begin --><!-- hexo-inject:end -->


    
    
    
    
    
    
    
    
    
    

    


</head>
<body>
    
<!-- hexo-inject:begin --><!-- hexo-inject:end --><nav class="navbar is-transparent is-fixed-top navbar-main" role="navigation" aria-label="main navigation">
    <div class="container">
        <div class="navbar-brand">
            <a class="navbar-item navbar-logo" href="/">
                
                    
                    萧爽楼
                    
                
            </a>
            <div class="navbar-burger">
                <span></span>
                <span></span>
                <span></span>
            </div>
        </div>
        
        <div class="navbar-menu navbar-start">
            
            <a class="navbar-item " href="/archives">归档</a>
            
            <a class="navbar-item " href="/recommendation">推荐</a>
            
            <a class="navbar-item " href="/links">友链</a>
            
            <a class="navbar-item " href="/about">关于</a>
            
        </div>
        
        <div class="navbar-menu navbar-end">
            
            <a class="navbar-item search" title="搜索" href="javascript:;">
                <i class="fas fa-search"></i>
            </a>
            
            
            
            <a class="navbar-item" title="RSS" href="/atom.xml">
                
                RSS
                
            </a>
               
            <a class="navbar-item" title="ddlee.cc" href="https://ddlee.cc">
                
                ddlee.cc
                
            </a>
               
            
        </div>
    </div>
</nav>

    <section class="section">
    <div class="container">
    <article class="article content gallery" itemscope itemprop="blogPost">
    <h1 class="article-title is-size-3 is-size-4-mobile" itemprop="name">
        
            在线文字创作不完全指南
        
    </h1>
    <div class="article-meta columns is-variable is-1 is-multiline is-mobile is-size-7-mobile">
        <span class="column is-narrow">
            <time datetime="2018-10-18T13:42:48.000Z" itemprop="datePublished">10月 18 2018</time>
        </span>
        
        <span class="column is-narrow article-category">
            <i class="far fa-folder"></i>
            <a class="article-category-link" href="/categories/Individual-Development/">Individual Development</a>
        </span>
        
        
        <span class="column is-narrow">
            
            
            31 分钟 读完 (约 4622 字)
        </span>
        
    </div>
    <div class="article-entry is-size-6-mobile" itemprop="articleBody">
    
        <link rel="stylesheet" type="text/css" href="https://cdn.jsdelivr.net/hint.css/2.4.1/hint.min.css"><p>&#x672C;&#x6587;&#x529B;&#x56FE;&#x4E3A;&#x6709;&#x5728;&#x7EBF;&#x8868;&#x8FBE;&#x610F;&#x613F;&#x7684;&#x8BFB;&#x8005;&#x63D0;&#x4F9B;&#x4E00;&#x4EFD;&#x601D;&#x8003;&#x548C;&#x884C;&#x52A8;&#x6307;&#x5357;&#xFF0C;&#x66F4;&#x671F;&#x671B;&#x80FD;&#x591F;&#x5F15;&#x8D77;&#x5BF9;&#x201C;&#x7F51;&#x7EDC;&#x7A7A;&#x95F4;&#x4E2D;&#x7684;&#x8868;&#x8FBE;&#x201D;&#x8FD9;&#x4E00;&#x4E3B;&#x9898;&#x7684;&#x8BA8;&#x8BBA;&#x548C;&#x4EA4;&#x6D41;&#x3002;</p>
<h2 id="&#x6211;&#x6240;&#x6307;&#x7684;&#x8868;&#x8FBE;&#x548C;&#x521B;&#x4F5C;"><a href="#&#x6211;&#x6240;&#x6307;&#x7684;&#x8868;&#x8FBE;&#x548C;&#x521B;&#x4F5C;" class="headerlink" title="&#x6211;&#x6240;&#x6307;&#x7684;&#x8868;&#x8FBE;&#x548C;&#x521B;&#x4F5C;"></a>&#x6211;&#x6240;&#x6307;&#x7684;&#x8868;&#x8FBE;&#x548C;&#x521B;&#x4F5C;</h2><p>&#x5728;&#x672C;&#x6587;&#x4E2D;&#xFF0C;&#x8868;&#x8FBE;&#x548C;&#x521B;&#x4F5C;&#x662F;&#x76F8;&#x5F53;&#x72ED;&#x4E49;&#x7684;&#x3002;&#x6211;&#x6240;&#x6307;&#x7684;&#x4E00;&#x4E2A;&#x6838;&#x5FC3;&#x90E8;&#x5206;&#x5927;&#x6982;&#x53EF;&#x4EE5;&#x8868;&#x8FF0;&#x4E3A;&#x201C;&#x5B8C;&#x6574;&#x5730;&#x53D9;&#x8FF0;&#x81EA;&#x5DF1;&#x7684;&#x89C2;&#x70B9;&#x5E76;&#x8BF4;&#x660E;&#x7406;&#x7531;&#x201D;&#xFF0C;&#x4ECE;&#x8FD9;&#x4E2A;&#x6838;&#x5FC3;&#x51FA;&#x53D1;&#xFF0C;&#x53EF;&#x4EE5;&#x8F83;&#x4E3A;&#x5145;&#x5206;&#x5730;&#x8868;&#x8FBE;&#x81EA;&#x5DF1;&#x6240;&#x611F;&#x6240;&#x60F3;&#x7684;&#x4EE5;<strong>&#x6587;&#x5B57;</strong>&#x4E3A;&#x4E3B;&#x8981;&#x5A92;&#x4ECB;&#x7684;&#x4F53;&#x88C1;&#x90FD;&#x53EF;&#x4EE5;&#x5BB9;&#x7EB3;&#x8FDB;&#x6765;&#xFF0C;&#x6BD4;&#x5982;&#x6E38;&#x8BB0;&#x3001;&#x5C0F;&#x8BF4;&#x3001;&#x5F71;&#x8BC4;&#x7B49;&#x7B49;&#x3002;<br>&#x6211;&#x5728;&#x8FD9;&#x6837;&#x7684;&#x5B9A;&#x4E49;&#x91CC;&#xFF0C;&#x5F3A;&#x8C03;&#x7684;&#x90E8;&#x5206;&#x5728;&#x4E8E;&#x89C2;&#x70B9;&#x7684;<strong>&#x5B8C;&#x6574;&#x6027;</strong>&#x548C;<strong>&#x81EA;&#x4E3B;&#x6027;</strong>&#xFF0C;&#x671F;&#x671B;&#x6587;&#x7AE0;&#x80FD;&#x591F;&#x6709;&#x6BD4;&#x8F83;&#x4E25;&#x8C28;&#x800C;&#x6709;&#x8BA8;&#x8BBA;&#x7A7A;&#x95F4;&#x7684;&#x8BBA;&#x70B9;&#x3001;&#x81EA;&#x4E3B;&#x4E14;&#x5408;&#x903B;&#x8F91;&#x7684;&#x7406;&#x7531;&#x7B49;&#xFF0C;&#x901A;&#x5E38;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x6587;&#x7AE0;&#x4E0D;&#x4EC5;&#x662F;&#x4E00;&#x4E2A;&#x8868;&#x8FBE;&#x7A97;&#x53E3;&#xFF0C;&#x800C;&#x4E14;&#x662F;&#x601D;&#x8003;&#x4E0E;&#x6574;&#x7406;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x9700;&#x8981;&#x6295;&#x5165;&#x76F8;&#x5F53;&#x7684;&#x7CBE;&#x529B;&#x3002;</p>
<h2 id="&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x4F7F;&#x7528;&#x6587;&#x5B57;&#x8FDB;&#x884C;&#x8868;&#x8FBE;&#x548C;&#x521B;&#x4F5C;"><a href="#&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x4F7F;&#x7528;&#x6587;&#x5B57;&#x8FDB;&#x884C;&#x8868;&#x8FBE;&#x548C;&#x521B;&#x4F5C;" class="headerlink" title="&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x4F7F;&#x7528;&#x6587;&#x5B57;&#x8FDB;&#x884C;&#x8868;&#x8FBE;&#x548C;&#x521B;&#x4F5C;"></a>&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x4F7F;&#x7528;&#x6587;&#x5B57;&#x8FDB;&#x884C;&#x8868;&#x8FBE;&#x548C;&#x521B;&#x4F5C;</h2><h3 id="&#x201C;&#x8981;&#x8868;&#x8FBE;&#x548C;&#x521B;&#x4F5C;&#x201D;"><a href="#&#x201C;&#x8981;&#x8868;&#x8FBE;&#x548C;&#x521B;&#x4F5C;&#x201D;" class="headerlink" title="&#x201C;&#x8981;&#x8868;&#x8FBE;&#x548C;&#x521B;&#x4F5C;&#x201D;"></a>&#x201C;&#x8981;&#x8868;&#x8FBE;&#x548C;&#x521B;&#x4F5C;&#x201D;</h3><p>&#x6211;&#x4EEC;&#x6BCF;&#x4E2A;&#x4EBA;&#x90FD;&#x5F88;&#x7CBE;&#x5F69;&#xFF0C;&#x90FD;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x5224;&#x65AD;&#x529B;&#xFF0C;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x601D;&#x8DEF;&#x3002;&#x8868;&#x8FBE;&#x548C;&#x521B;&#x4F5C;&#x4E00;&#x65B9;&#x9762;&#x65B9;&#x4FBF;&#x4ED6;&#x4EBA;&#x66F4;&#x6DF1;&#x523B;&#x5730;&#x4E86;&#x89E3;&#x81EA;&#x5DF1;&#xFF0C;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#x4E5F;&#x80FD;&#x4F5C;&#x4E3A;&#x4EA4;&#x6362;&#x8BA4;&#x8BC6;&#x5230;&#x4ED6;&#x4EBA;&#x7684;&#x60F3;&#x6CD5;&#x548C;&#x601D;&#x8DEF;&#xFF0C;&#x5982;&#x679C;&#x80FD;&#x591F;&#x78B0;&#x649E;&#x6210;&#x706B;&#x82B1;&#xFF0C;&#x90A3;&#x771F;&#x662F;&#x4E00;&#x4EF6;&#x518D;&#x5E78;&#x8FD0;&#x4E0D;&#x8FC7;&#x7684;&#x4E8B;&#x60C5;&#x4E86;&#x3002;&#x5BF9;&#x81EA;&#x5DF1;&#x800C;&#x8A00;&#xFF0C;&#x8868;&#x8FBE;&#x548C;&#x521B;&#x4F5C;&#x5B9E;&#x9645;&#x4E0A;&#x662F;<strong>&#x5185;&#x5316;&#x81EA;&#x5DF1;&#x63A5;&#x6536;&#x5230;&#x4FE1;&#x606F;</strong>&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x800C;&#x4E14;&#x8FD9;&#x79CD;&#x5185;&#x5316;&#x8FDC;&#x6BD4;&#x8BB0;&#x5FC6;&#x7B49;&#x8981;&#x6DF1;&#x523B;&#x548C;&#x6301;&#x4E45;&#x3002;&#x5982;&#x679C;&#x518D;&#x73B0;&#x5B9E;&#x4E00;&#x70B9;&#xFF0C;&#x8868;&#x8FBE;&#x662F;&#x8F93;&#x51FA;&#x5F71;&#x54CD;&#x529B;&#x7684;&#x7B2C;&#x4E00;&#x6B65;&#xFF0C;&#x800C;&#x5F71;&#x54CD;&#x529B;&#xFF0C;&#x5219;&#x662F;&#x4E00;&#x9879;&#x8D44;&#x6E90;&#x3002;</p>
<h3 id="&#x201C;&#x4F7F;&#x7528;&#x6587;&#x5B57;&#x201D;"><a href="#&#x201C;&#x4F7F;&#x7528;&#x6587;&#x5B57;&#x201D;" class="headerlink" title="&#x201C;&#x4F7F;&#x7528;&#x6587;&#x5B57;&#x201D;"></a>&#x201C;&#x4F7F;&#x7528;&#x6587;&#x5B57;&#x201D;</h3><p>&#x5982;&#x679C;&#x6709;&#x80FD;&#x529B;&#xFF0C;&#x97F3;&#x4E50;&#x3001;&#x7ED8;&#x753B;&#x3001;&#x526A;&#x8F91;&#x7B49;&#x4E5F;&#x662F;&#x975E;&#x5E38;&#x68D2;&#x7684;&#x8868;&#x8FBE;&#x548C;&#x521B;&#x4F5C;&#x65B9;&#x5F0F;&#xFF0C;&#x4F46;&#x8FD9;&#x4E9B;&#x5F80;&#x5F80;&#x9700;&#x8981;&#x76F8;&#x5F53;&#x7684;&#x77E5;&#x8BC6;&#x548C;&#x80FD;&#x529B;&#x57FA;&#x7840;&#xFF0C;&#x5BF9;&#x4E8E;&#x5927;&#x90E8;&#x5206;&#x4EBA;&#x800C;&#x8A00;&#xFF0C;&#x4F7F;&#x7528;&#x6587;&#x5B57;&#x662F;&#x6700;&#x5BB9;&#x6613;&#x7684;&#x65B9;&#x5F0F;&#x3002;&#x6BD5;&#x7ADF;&#xFF0C;&#x6211;&#x4EEC;&#x90FD;&#x63A5;&#x53D7;&#x8FC7;&#x57FA;&#x672C;&#x7684;&#x9274;&#x8D4F;&#x548C;&#x5199;&#x4F5C;&#x953B;&#x70BC;&#xFF0C;&#x5C3D;&#x7BA1;&#x8FD9;&#x4E9B;&#x953B;&#x70BC;&#x7684;&#x7ED3;&#x679C;&#x662F;&#x8BA9;&#x5F88;&#x591A;&#x4EBA;&#x4E27;&#x5931;&#x9274;&#x8D4F;&#x548C;&#x5199;&#x4F5C;&#x7684;&#x80FD;&#x529B;&#x3002;<br>&#x66F4;&#x8FDB;&#x4E00;&#x6B65;&#x7684;&#x7406;&#x7531;&#x662F;&#xFF0C;&#x4F7F;&#x7528;&#x6587;&#x5B57;&#x8868;&#x8FBE;&#x53EF;&#x9009;&#x7528;&#x7684;&#x5DE5;&#x5177;&#x548C;&#x5E73;&#x53F0;&#x975E;&#x5E38;&#x591A;&#xFF08;&#x76F8;&#x6BD4;&#x5176;&#x4ED6;&#x65B9;&#x5F0F;&#xFF09;&#xFF0C;&#x6211;&#x5728;&#x4E0B;&#x9762;&#x7684;&#x201C;&#x5DE5;&#x5177;&#x4E0E;&#x884C;&#x52A8;&#x7BC7;&#x201D;&#x4F1A;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x6A2A;&#x5411;&#x7684;&#x6BD4;&#x8F83;&#x3002;</p>
<h3 id="&#x4EE5;&#x53CA;&#x4E00;&#x4E9B;&#x62C5;&#x5FE7;"><a href="#&#x4EE5;&#x53CA;&#x4E00;&#x4E9B;&#x62C5;&#x5FE7;" class="headerlink" title="&#x4EE5;&#x53CA;&#x4E00;&#x4E9B;&#x62C5;&#x5FE7;"></a>&#x4EE5;&#x53CA;&#x4E00;&#x4E9B;&#x62C5;&#x5FE7;</h3><p>&#x4F9D;&#x636E;&#x6211;&#x7684;&#x89C2;&#x5BDF;&#xFF0C;&#x9664;&#x4E86;&#x65E5;&#x5E38;&#x5DE5;&#x4F5C;&#x548C;&#x5B66;&#x4E60;&#x751F;&#x6D3B;&#x5916;&#xFF0C;&#x5927;&#x90E8;&#x5206;&#x4EBA;&#x7684;&#x8868;&#x8FBE;&#x6E20;&#x9053;&#x76F8;&#x5F53;&#x5355;&#x4E00;&#x548C;&#x5C40;&#x9650;&#xFF0C;&#x5E76;&#x4E14;&#x8DDF;&#x6211;&#x6240;&#x6307;&#x7684;&#x8868;&#x8FBE;&#x76F8;&#x53BB;&#x751A;&#x8FDC;&#x3002;&#x5FAE;&#x4FE1;&#x7FA4;&#x804A;&#x5929;&#x3001;&#x670B;&#x53CB;&#x5708;&#x8F6C;&#x53D1;/&#x8BC4;&#x8BBA;&#x3001;&#x5FAE;&#x535A;&#x53D1;&#x8A00;/&#x8BC4;&#x8BBA;&#x7B49;&#xFF0C;&#x5DF2;&#x7ECF;&#x5360;&#x636E;&#x4E86;&#x6211;&#x4EEC;&#x76F8;&#x5F53;&#x5927;&#x7684;&#x8868;&#x8FBE;&#x7CBE;&#x529B;&#x548C;&#x7A7A;&#x95F4;&#xFF0C;&#x800C;&#x8FD9;&#x4E9B;&#x6E20;&#x9053;&#x4E2D;&#x7684;&#x4FE1;&#x606F;&#x5F62;&#x5F0F;&#x5E38;&#x5E38;&#x4E0D;&#x80FD;&#x6EE1;&#x8DB3;&#x5B8C;&#x6574;&#x6027;&#x548C;&#x81EA;&#x4E3B;&#x6027;&#xFF1A;&#x7BC7;&#x5E45;&#x592A;&#x77ED;&#x4E14;&#x5B9E;&#x65F6;&#x6027;&#x8981;&#x6C42;&#x9AD8;&#xFF0C;&#x5F80;&#x5F80;<strong>&#x60C5;&#x7EEA;&#x5316;&#x548C;&#x672A;&#x7ECF;&#x4E25;&#x8083;&#x5BA1;&#x614E;&#x7684;&#x601D;&#x8003;</strong>&#x3002;<br>&#x800C;&#x4E14;&#xFF0C;&#x8868;&#x60C5;&#x7684;&#x6CDB;&#x6EE5;&#x4E5F;&#x5728;&#x4E00;&#x70B9;&#x4E00;&#x70B9;&#x4FB5;&#x8680;&#x6587;&#x5B57;&#x7684;&#x8868;&#x8FBE;&#x529F;&#x80FD;&#x3002;&#x201C;&#x6342;&#x8138;&#x54ED;&#x201D;&#x3001;&#x201C;&#x7B11;&#x54ED;&#x201D;&#x7B49;Emoji&#x88AB;&#x4E25;&#x91CD;&#x5730;&#x6EE5;&#x7528;&#xFF0C;&#x4EE5;&#x81F4;&#x8FBE;&#x5230;&#x4E86;&#x201C;&#x542B;&#x4E49;&#x8FC7;&#x8F7D;&#x201D;&#x7684;&#x7A0B;&#x5EA6;&#xFF0C;&#x65E9;&#x5DF2;&#x4E27;&#x5931;&#x5176;&#x539F;&#x672C;&#x7684;&#x8868;&#x60C5;&#x4F20;&#x8FBE;&#x610F;&#x4E49;&#x3002;&#x4EE5;&#x201C;&#x718A;&#x732B;&#x4EBA;&#x201D;&#x3001;&#x201C;&#x8611;&#x83C7;&#x5934;&#x201D;&#x4E3A;&#x4EE3;&#x8868;&#x7684;&#x56FE;&#x7247;&#x8868;&#x60C5;&#x751A;&#x81F3;&#x8D85;&#x51FA;&#x804A;&#x5929;&#x73AF;&#x5883;&#xFF0C;&#x51FA;&#x73B0;&#x5728;&#x5F88;&#x591A;&#x79D1;&#x666E;&#x3001;&#x89C2;&#x70B9;&#x7C7B;&#x7684;&#x7F51;&#x7EDC;&#x6587;&#x7AE0;&#x4E2D;&#xFF0C;&#x6BD4;&#x5982;&#x201C;&#x6211;&#x5F53;&#x65F6;&#x7684;&#x5FC3;&#x60C5;&#x662F;&#x8FD9;&#x6837;&#x7684;&#xFF1A;&#x3010;&#x8868;&#x60C5;&#x3011;&#x201D;&#x8FD9;&#x79CD;&#x8868;&#x8FBE;&#xFF0C;&#x5E38;&#x4F7F;&#x6211;&#x611F;&#x5230;&#x60B2;&#x54C0;&#x3002;<br>&#x8868;&#x60C5;&#x5374;&#x6709;&#x5176;&#x5F62;&#x8C61;&#x5316;&#x7684;&#x4F18;&#x52BF;&#xFF0C;&#x4F46;&#x6EE5;&#x7528;&#x5B9E;&#x4E0D;&#x53EF;&#x53D6;&#x3002;&#x8FC7;&#x5206;&#x5730;&#x63A5;&#x53D7;&#x548C;&#x4F7F;&#x7528;&#x8FD9;&#x4E9B;&#x8868;&#x60C5;&#x5B9E;&#x9645;&#x4E0A;&#x662F;<strong>&#x4F53;&#x9A8C;&#x4F20;&#x8FBE;&#x4EE3;&#x66FF;&#x4E86;&#x8BED;&#x8A00;&#x8868;&#x8FBE;</strong>&#xFF0C;&#x5F31;&#x5316;&#x4E86;&#x6211;&#x4EEC;&#x7684;&#x601D;&#x8003;&#x8FC7;&#x7A0B;&#x3002;&#x8FD9;&#x4E9B;&#x62C5;&#x5FE7;&#x53EF;&#x4EE5;&#x90E8;&#x5206;&#x89E3;&#x91CA;&#x6211;&#x81EA;&#x5DF1;&#x4ECE;&#x4E0D;&#x4F7F;&#x7528;&#x5FAE;&#x535A;&#x3001;&#x4E5F;&#x5F88;&#x5C11;&#x4F7F;&#x7528;&#x5FAE;&#x4FE1;&#x670B;&#x53CB;&#x5708;&#x3002;</p>
<h2 id="&#x601D;&#x8003;&#x4E0E;&#x89C4;&#x5212;&#x7BC7;"><a href="#&#x601D;&#x8003;&#x4E0E;&#x89C4;&#x5212;&#x7BC7;" class="headerlink" title="&#x601D;&#x8003;&#x4E0E;&#x89C4;&#x5212;&#x7BC7;"></a>&#x601D;&#x8003;&#x4E0E;&#x89C4;&#x5212;&#x7BC7;</h2><h3 id="&#x5185;&#x5BB9;"><a href="#&#x5185;&#x5BB9;" class="headerlink" title="&#x5185;&#x5BB9;"></a>&#x5185;&#x5BB9;</h3><p>&#x5185;&#x5BB9;&#x65B9;&#x9762;&#x5404;&#x6709;&#x5404;&#x7684;&#x9009;&#x62E9;&#xFF0C;&#x6211;&#x7684;&#x671F;&#x5F85;&#x662F;&#x81F3;&#x5C11;&#x81EA;&#x4E3B;&#xFF0C;&#x5373;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x601D;&#x8003;&#x8FC7;&#x7A0B;&#x3002;&#x5BF9;&#x67D0;&#x4E00;&#x4E8B;&#x4EF6;&#x7684;&#x8BC4;&#x8BBA;&#x3001;&#x5BF9;&#x67D0;&#x4E00;&#x6587;&#x7AE0;&#x89C2;&#x70B9;&#x7684;&#x53CD;&#x9A73;&#x3001;&#x6000;&#x5FF5;&#x67D0;&#x6BB5;&#x611F;&#x60C5;&#x7684;&#x5C0F;&#x8BF4;&#x3001;&#x8BB0;&#x5F55;&#x67D0;&#x6B21;&#x65C5;&#x884C;&#x7684;&#x6E38;&#x8BB0;&#x3001;&#x8FDB;&#x884C;&#x67D0;&#x6B21;&#x8D2D;&#x7269;&#x51B3;&#x7B56;&#x65F6;&#x7684;&#x601D;&#x8003;&#x3001;&#x5B66;&#x4E60;&#x67D0;&#x9879;&#x6280;&#x672F;&#x65F6;&#x7684;&#x7B14;&#x8BB0;&#x3001;&#x5F71;&#x8BC4;&#x4E66;&#x8BC4;&#x7B49;&#x7B49;&#xFF0C;&#x90FD;&#x53EF;&#x4EE5;&#x6210;&#x4E3A;&#x521B;&#x4F5C;&#x7684;&#x5185;&#x5BB9;&#x3002;&#x5343;&#x4E07;&#x4E0D;&#x8981;&#x62C5;&#x5FC3;&#x65E0;&#x4E8B;&#x53EF;&#x5199;&#x65E0;&#x8BDD;&#x53EF;&#x8BF4;&#xFF0C;<strong>&#x53EA;&#x8981;&#x6709;&#x751F;&#x6D3B;&#xFF0C;&#x5C31;&#x6709;&#x5185;&#x5BB9;</strong>&#x3002;</p>
<h3 id="&#x5B9A;&#x4F4D;"><a href="#&#x5B9A;&#x4F4D;" class="headerlink" title="&#x5B9A;&#x4F4D;"></a>&#x5B9A;&#x4F4D;</h3><p>&#x5B9A;&#x4F4D;&#x65B9;&#x9762;&#x53EF;&#x4EE5;&#x5C31;&#x81EA;&#x5DF1;&#x7684;&#x76EE;&#x7684;&#x800C;&#x5B9A;&#x3002;&#x82E5;&#x662F;&#x4EC5;&#x4F5C;&#x81EA;&#x6211;&#x7EAA;&#x5F55;&#xFF0C;&#x5219;&#x65E0;&#x6240;&#x8C13;&#x5B9A;&#x4F4D;&#x3002;&#x800C;&#x82E5;&#x671F;&#x5F85;&#x5C06;&#x81EA;&#x5DF1;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;IP&#x6765;&#x8FD0;&#x8425;&#xFF0C;&#x5219;&#x53EF;&#x5728;&#x5B9A;&#x4F4D;&#x7684;&#x4EBA;&#x7FA4;&#x65B9;&#x9762;&#x4ED4;&#x7EC6;&#x8C0B;&#x5212;&#x4E00;&#x756A;&#xFF0C;&#x63D0;&#x4F9B;&#x54EA;&#x4E9B;&#x88AB;&#x9700;&#x8981;&#x7684;&#x5185;&#x5BB9;&#x3001;&#x5982;&#x4F55;&#x8BF4;&#x670D;&#x3001;&#x9009;&#x62E9;&#x54EA;&#x4E9B;&#x5E73;&#x53F0;&#x6765;&#x5BA3;&#x4F20;&#x63A8;&#x5E7F;&#x7B49;&#xFF0C;&#x90FD;&#x662F;&#x503C;&#x5F97;&#x89C4;&#x5212;&#x7684;&#x95EE;&#x9898;&#x3002;&#x8FD9;&#x4E9B;&#x65B9;&#x9762;&#xFF0C;&#x5927;&#x90FD;&#x53EF;&#x4EE5;&#x5728;&#x6709;&#x66F4;&#x73B0;&#x5B9E;&#x9700;&#x6C42;&#x7684;&#x9886;&#x57DF;&#x5982;&#x516C;&#x4F17;&#x53F7;&#x8FD0;&#x8425;&#x627E;&#x5230;&#x501F;&#x9274;&#x3002;</p>
<h3 id="&#x7CBE;&#x529B;"><a href="#&#x7CBE;&#x529B;" class="headerlink" title="&#x7CBE;&#x529B;"></a>&#x7CBE;&#x529B;</h3><p>&#x81EA;&#x5DF1;&#x80FD;&#x5728;&#x8868;&#x8FBE;&#x548C;&#x521B;&#x4F5C;&#x65B9;&#x9762;&#x6295;&#x5165;&#x591A;&#x5C11;&#x7CBE;&#x529B;&#xFF0C;&#x4E5F;&#x662F;&#x503C;&#x5F97;&#x8BA4;&#x771F;&#x8003;&#x8651;&#x7684;&#x3002;&#x5728;&#x521D;&#x671F;&#x6295;&#x5165;&#x592A;&#x591A;&#x5F80;&#x5F80;&#x4F1A;&#x96BE;&#x4EE5;&#x575A;&#x6301;&#xFF0C;&#x8FD9;&#x9879;&#x4E8B;&#x60C5;&#x4E0D;&#x5E94;&#x88AB;&#x671F;&#x5F85;&#x4F1A;&#x6709;&#x50CF;&#x5176;&#x4ED6;&#x6295;&#x5165;&#x90A3;&#x6837;&#x6709;&#x73B0;&#x5B9E;&#x7684;&#x53CD;&#x9988;&#x548C;&#x56DE;&#x62A5;&#xFF0C;&#x800C;&#x6211;&#x4EEC;&#x5E38;&#x5E38;&#x8BF8;&#x4E8B;&#x7F20;&#x8EAB;&#xFF0C;&#x653E;&#x5F03;&#x662F;&#x4E00;&#x4E2A;&#x518D;&#x5BB9;&#x6613;&#x4E0D;&#x8FC7;&#x7684;&#x9009;&#x9879;&#x3002;&#x5728;&#x4E0B;&#x5B9A;&#x51B3;&#x5FC3;&#x505A;&#x51FA;&#x884C;&#x52A8;&#x524D;&#xFF0C;&#x6700;&#x597D;&#x5BF9;&#x81EA;&#x5DF1;&#x7684;&#x7CBE;&#x529B;&#x5206;&#x914D;&#x6709;&#x4E00;&#x4E2A;&#x771F;&#x5B9E;&#x7684;&#x4F30;&#x8BA1;&#x548C;&#x9884;&#x7B97;&#x4E0A;&#x7684;&#x89C4;&#x5212;&#xFF0C;&#x5982;&#x6BCF;&#x661F;&#x671F;&#x80FD;&#x591F;&#x62FF;&#x51FA;&#x51E0;&#x4E2A;&#x5C0F;&#x65F6;&#x3001;&#x80FD;&#x591F;&#x652F;&#x6491;&#x8D77;&#x7684;&#x66F4;&#x65B0;&#x9891;&#x6B21;&#x7B49;&#x3002;</p>
<h2 id="&#x5DE5;&#x5177;&#x4E0E;&#x884C;&#x52A8;&#x7BC7;"><a href="#&#x5DE5;&#x5177;&#x4E0E;&#x884C;&#x52A8;&#x7BC7;" class="headerlink" title="&#x5DE5;&#x5177;&#x4E0E;&#x884C;&#x52A8;&#x7BC7;"></a>&#x5DE5;&#x5177;&#x4E0E;&#x884C;&#x52A8;&#x7BC7;</h2><h3 id="&#x4EBA;&#x673A;&#x534F;&#x4F5C;&#x7684;&#x7EF4;&#x5EA6;"><a href="#&#x4EBA;&#x673A;&#x534F;&#x4F5C;&#x7684;&#x7EF4;&#x5EA6;" class="headerlink" title="&#x4EBA;&#x673A;&#x534F;&#x4F5C;&#x7684;&#x7EF4;&#x5EA6;"></a>&#x4EBA;&#x673A;&#x534F;&#x4F5C;&#x7684;&#x7EF4;&#x5EA6;</h3><p>&#x8FD9;&#x91CC;&#x201C;&#x673A;&#x201D;&#x7684;&#x542B;&#x4E49;&#x662F;&#x5E7F;&#x4E49;&#x7684;&#xFF0C;&#x6CDB;&#x6307;&#x6211;&#x4EEC;&#x6240;&#x501F;&#x7528;&#x7684;&#x5916;&#x90E8;&#x5DE5;&#x5177;&#x3002;&#x5982;&#x672C;&#x6587;&#x9898;&#x76EE;&#x6240;&#x793A;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x8BA8;&#x8BBA;&#x7684;&#x662F;&#x5728;&#x7EBF;&#x7684;&#x521B;&#x4F5C;&#xFF0C;&#x9009;&#x62E9;&#x5408;&#x9002;&#x7684;&#x5DE5;&#x5177;&#x548C;&#x5E73;&#x53F0;&#x662F;&#x5FC5;&#x8981;&#x7684;&#xFF0C;&#x6211;&#x5C06;&#x5217;&#x4E3E;&#x51FA;&#x6211;&#x6240;&#x89C2;&#x5BDF;&#x5230;&#x7684;&#x534F;&#x4F5C;&#x7684;&#x7EF4;&#x5EA6;&#xFF0C;&#x4EE5;&#x63D0;&#x4F9B;&#x6307;&#x5BFC;&#x6027;&#x7684;&#x601D;&#x8003;&#x5750;&#x6807;&#x3002;</p>
<h4 id="&#x7F16;&#x8F91;&#x63A5;&#x53E3;"><a href="#&#x7F16;&#x8F91;&#x63A5;&#x53E3;" class="headerlink" title="&#x7F16;&#x8F91;&#x63A5;&#x53E3;"></a>&#x7F16;&#x8F91;&#x63A5;&#x53E3;</h4><p>&#x7F16;&#x8F91;&#x63A5;&#x53E3;&#x662F;&#x6307;&#x6211;&#x4EEC;&#x7F16;&#x8F91;&#x6587;&#x5B57;&#x65F6;&#x9762;&#x5BF9;&#x7684;&#x63A5;&#x53E3;&#xFF0C;&#x8FD9;&#x4E00;&#x63A5;&#x53E3;&#x5E76;&#x4E0D;&#x56FA;&#x5B9A;&#xFF0C;&#x56E0;&#x4E3A;&#x5BF9;&#x4E8E;&#x53D1;&#x5E03;&#x6765;&#x8BF4;&#xFF0C;&#x4F60;&#x53EA;&#x9700;&#x8981;&#x4F20;&#x9012;&#x6587;&#x5B57;&#x548C;&#x56FE;&#x7247;&#x5373;&#x53EF;&#xFF0C;&#x6211;&#x4EEC;&#x5B8C;&#x5168;&#x6709;&#x5145;&#x5206;&#x7684;&#x7A7A;&#x95F4;&#x8131;&#x79BB;&#x6240;&#x7528;&#x53D1;&#x5E03;&#x6E20;&#x9053;&#x63D0;&#x4F9B;&#x7684;&#x7F16;&#x8F91;&#x5668;&#xFF0C;&#x800C;&#x9009;&#x7528;&#x4E13;&#x4E1A;&#x7684;&#x5199;&#x4F5C;&#x5DE5;&#x5177;&#x3001;&#x6587;&#x672C;&#x7F16;&#x8F91;&#x5668;&#x7B49;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5BF9;&#x4E8E;&#x5B9A;&#x5236;&#x6027;&#x8F83;&#x5DEE;&#x7684;&#x6E20;&#x9053;&#xFF0C;&#x4F7F;&#x7528;&#x5176;&#x63D0;&#x4F9B;&#x7684;&#x7F16;&#x8F91;&#x5668;&#x5374;&#x662F;&#x6700;&#x65B9;&#x4FBF;&#x7684;&#xFF0C;&#x4E0D;&#x5FC5;&#x62C5;&#x5FC3;&#x683C;&#x5F0F;&#x7B49;&#x95EE;&#x9898;&#x3002;&#x6BD4;&#x5982;&#xFF0C;QQ&#x7A7A;&#x95F4;&#x7F16;&#x8F91;&#x5668;&#x3001;&#x8BBA;&#x575B;&#x7684;&#x53D1;&#x5E16;&#x7F16;&#x8F91;&#x5668;&#x7B49;&#x7B49;&#x3002;&#x968F;&#x7740;&#x6240;&#x7528;&#x6E20;&#x9053;&#x7684;&#x5B9A;&#x5236;&#x6027;&#x63D0;&#x9AD8;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5728;&#x521B;&#x4F5C;&#x548C;&#x53D1;&#x5E03;&#x95F4;&#x6DFB;&#x52A0;&#x4E00;&#x5C42;<strong>&#x4F5C;&#x54C1;&#x72B6;&#x6001;&#x7684;&#x62BD;&#x8C61;</strong>&#xFF0C;&#x6B64;&#x65F6;&#xFF0C;Markdown&#x4FBF;&#x662F;&#x4E00;&#x4E2A;&#x4E0D;&#x9519;&#x7684;&#x9009;&#x62E9;&#xFF1A;&#x5B83;&#x5141;&#x8BB8;&#x4EE5;&#x8F7B;&#x91CF;&#x7684;&#x65B9;&#x5F0F;&#x6807;&#x8BB0;&#x6587;&#x5B57;&#x683C;&#x5F0F;&#xFF0C;&#x5E76;&#x88AB;&#x5927;&#x90E8;&#x5206;&#x5199;&#x4F5C;&#x5DE5;&#x5177;&#x548C;&#x53D1;&#x5E03;&#x6E20;&#x9053;&#x5F88;&#x5BB9;&#x6613;&#x5730;&#x652F;&#x6301;&#xFF0C;&#x4E14;&#x5728;&#x521B;&#x4F5C;&#x65B9;&#x9762;&#x76F8;&#x5BF9;&#x7EAF;&#x7CB9;&#x3002;</p>
<h4 id="&#x5B9A;&#x5236;&#x6027;"><a href="#&#x5B9A;&#x5236;&#x6027;" class="headerlink" title="&#x5B9A;&#x5236;&#x6027;"></a>&#x5B9A;&#x5236;&#x6027;</h4><p>&#x5B9A;&#x5236;&#x6027;&#x53EF;&#x4EE5;&#x7406;&#x89E3;&#x4E3A;&#x6211;&#x4EEC;&#x5BF9;&#x81EA;&#x5DF1;&#x4F5C;&#x54C1;&#x7684;&#x63A7;&#x5236;&#x6743;&#x3002;&#x521B;&#x4F5C;&#x4E4B;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x5BF9;&#x5185;&#x5BB9;&#x662F;&#x6709;&#x5B8C;&#x5168;&#x7684;&#x638C;&#x63A7;&#x7684;&#xFF0C;&#x4F46;&#x53D1;&#x5E03;&#x4E4B;&#x65F6;&#xFF0C;&#x5185;&#x5BB9;&#x7684;&#x683C;&#x5F0F;&#x3001;&#x5206;&#x53D1;&#x7684;&#x6E20;&#x9053;&#x7B49;&#xFF0C;&#x5374;&#x53D7;&#x5230;&#x6240;&#x7528;&#x5E73;&#x53F0;&#x7684;&#x9650;&#x5236;&#x3002;&#x672C;&#x6587;&#x6240;&#x6307;&#x7684;&#x201C;&#x5728;&#x7EBF;&#x521B;&#x4F5C;&#x201D;&#x901A;&#x5E38;&#x662F;&#x4EE5;&#x7F51;&#x9875;&#x7684;&#x5F62;&#x5F0F;&#x53D1;&#x5E03;&#x7684;&#xFF0C;&#x5BF9;&#x6BD4;&#x6765;&#x770B;&#xFF0C;QQ&#x7A7A;&#x95F4;&#x4EC5;&#x63D0;&#x4F9B;&#x6709;&#x9650;&#x7684;&#x5BCC;&#x6587;&#x672C;&#x5F62;&#x5F0F;&#x3001;&#x53D7;&#x63A7;&#x7684;&#x5A92;&#x4F53;&#x6765;&#x6E90;&#x548C;&#x5C01;&#x95ED;&#x7684;&#x4F20;&#x64AD;&#x8303;&#x56F4;&#xFF08;&#x65E0;&#x6CD5;&#x88AB;&#x641C;&#x7D22;&#x5F15;&#x64CE;&#x68C0;&#x7D22;&#xFF09;&#xFF0C;&#x800C;&#x81EA;&#x5EFA;&#x7F51;&#x7AD9;&#x5219;&#x53EF;&#x4EE5;&#x6709;&#x4E2A;&#x6027;&#x5316;&#x7684;&#x57DF;&#x540D;&#x548C;logo&#xFF0C;&#x53EF;&#x4EE5;&#x5B9A;&#x5236;&#x9875;&#x9762;&#x7684;&#x98CE;&#x683C;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5176;&#x4ED6;&#x624B;&#x6BB5;&#x6700;&#x5927;&#x5316;&#x4F20;&#x64AD;&#x8303;&#x56F4;&#x7B49;&#x7B49;&#x3002;</p>
<h4 id="&#x5206;&#x53D1;&#x6E20;&#x9053;"><a href="#&#x5206;&#x53D1;&#x6E20;&#x9053;" class="headerlink" title="&#x5206;&#x53D1;&#x6E20;&#x9053;"></a>&#x5206;&#x53D1;&#x6E20;&#x9053;</h4><p>&#x5206;&#x53D1;&#x6E20;&#x9053;&#x662F;&#x6307;&#x6211;&#x4EEC;&#x7684;&#x4F5C;&#x54C1;&#x4F20;&#x64AD;&#x7684;&#x9014;&#x5F84;&#x548C;&#x6240;&#x80FD;&#x4F20;&#x64AD;&#x7684;&#x8303;&#x56F4;&#xFF0C;&#x53EF;&#x4EE5;&#x8BA4;&#x4E3A;&#x662F;&#x5B9A;&#x5236;&#x6027;&#x7684;&#x4E00;&#x4E2A;&#x65B9;&#x9762;&#x3002;&#x5C11;&#x6570;&#x5E73;&#x53F0;&#x7684;&#x5185;&#x5BB9;&#x662F;&#x4E0D;&#x53EF;&#x4EE5;&#x88AB;&#x68C0;&#x7D22;&#x5230;&#x7684;&#xFF0C;&#x5982;QQ&#x7A7A;&#x95F4;&#xFF0C;&#x800C;&#x5927;&#x90E8;&#x5206;&#x7F51;&#x9875;&#x662F;&#x53EF;&#x4EE5;&#x88AB;&#x81EA;&#x7531;&#x8BBF;&#x95EE;&#x548C;&#x94FE;&#x63A5;&#x7684;&#x3002;&#x4F7F;&#x7528;&#x5E73;&#x53F0;&#x7684;&#x597D;&#x5904;&#x662F;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5E73;&#x53F0;&#x81EA;&#x52A8;&#x5E26;&#x6765;&#x6D41;&#x91CF;&#xFF0C;&#x9009;&#x62E9;&#x81EA;&#x5EFA;&#x7F51;&#x7AD9;&#x5219;&#x53EF;&#x80FD;&#x76F8;&#x5BF9;&#x4F9D;&#x8D56;&#x641C;&#x7D22;&#x5F15;&#x64CE;&#x6216;&#x662F;&#x81EA;&#x5DF1;&#x5728;&#x793E;&#x533A;&#x7B49;&#x7684;&#x5BA3;&#x4F20;&#x3002;</p>
<h3 id="&#x63A8;&#x8350;&#x4E0E;&#x6BD4;&#x8F83;"><a href="#&#x63A8;&#x8350;&#x4E0E;&#x6BD4;&#x8F83;" class="headerlink" title="&#x63A8;&#x8350;&#x4E0E;&#x6BD4;&#x8F83;"></a>&#x63A8;&#x8350;&#x4E0E;&#x6BD4;&#x8F83;</h3><p>&#x672C;&#x6587;&#x9898;&#x76EE;&#x4E2D;&#x7684;&#x201C;&#x4E0D;&#x5B8C;&#x5168;&#x201D;&#x6307;&#x8FD9;&#x4E00;&#x90E8;&#x5206;&#x3002;&#x5BF9;&#x4E8E;&#x5DE5;&#x5177;&#x548C;&#x5E73;&#x53F0;&#xFF0C;&#x6211;&#x4E5F;&#x53EA;&#x662F;&#x5C1D;&#x8BD5;&#x4E86;&#x5F88;&#x5C0F;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x4E0B;&#x9762;&#x4EC5;&#x4EC5;&#x5217;&#x4E3E;&#x51FA;&#x4E00;&#x4E9B;&#x4F8B;&#x5B50;&#x5E76;&#x6309;&#x4E0A;&#x9762;&#x7684;&#x7EF4;&#x5EA6;&#x8FDB;&#x884C;&#x8BC4;&#x8FF0;&#xFF0C;&#x4F9B;&#x8BFB;&#x8005;&#x9009;&#x62E9;&#xFF0C;&#x6392;&#x5E8F;&#x57FA;&#x672C;&#x6309;&#x7167;&#x5B9A;&#x5236;&#x6027;&#xFF08;&#x4F5C;&#x8005;&#x63A7;&#x5236;&#x6743;&#xFF09;&#x4F9D;&#x6B21;&#x63D0;&#x5347;&#x3002;</p>
<h4 id="&#x793E;&#x4EA4;&#x7F51;&#x7EDC;-Social-Network-QQ&#x7A7A;&#x95F4;-&#x5FAE;&#x4FE1;&#x516C;&#x4F17;&#x53F7;"><a href="#&#x793E;&#x4EA4;&#x7F51;&#x7EDC;-Social-Network-QQ&#x7A7A;&#x95F4;-&#x5FAE;&#x4FE1;&#x516C;&#x4F17;&#x53F7;" class="headerlink" title="&#x793E;&#x4EA4;&#x7F51;&#x7EDC; Social Network: QQ&#x7A7A;&#x95F4;/&#x5FAE;&#x4FE1;&#x516C;&#x4F17;&#x53F7;"></a>&#x793E;&#x4EA4;&#x7F51;&#x7EDC; Social Network: QQ&#x7A7A;&#x95F4;/&#x5FAE;&#x4FE1;&#x516C;&#x4F17;&#x53F7;</h4><ul>
<li>&#x7F16;&#x8F91;&#x63A5;&#x53E3;&#xFF1A;&#x4E13;&#x7528;&#x7F16;&#x8F91;&#x5668;</li>
<li>&#x5B9A;&#x5236;&#x6027;&#xFF1A;&#x5C11;&#x91CF;&#x683C;&#x5F0F;&#x6587;&#x672C;&#xFF0C;&#x6709;&#x9650;&#x7684;&#x4FE1;&#x7EB8;&#x6A21;&#x7248;</li>
<li>&#x5206;&#x53D1;&#x6E20;&#x9053;&#xFF1A;&#x53D7;&#x9650;&#xFF0C;&#x4F46;&#x4F1A;&#x5F97;&#x5230;&#x7A33;&#x5B9A;&#x7684;&#x63A8;&#x9001;</li>
</ul>
<p>&#x8FD9;&#x79CD;&#x5F62;&#x6001;&#x5B9A;&#x5236;&#x6027;&#x6700;&#x5DEE;&#xFF0C;&#x5374;&#x4E0D;&#x59A8;&#x4F5C;&#x4E3A;&#x8868;&#x8FBE;&#x548C;&#x521B;&#x4F5C;&#x7684;&#x8D77;&#x70B9;&#xFF08;QQ&#x7A7A;&#x95F4;&#x5E94;&#x8BE5;&#x5728;&#x4E8B;&#x5B9E;&#x4E0A;&#x662F;&#x4E0D;&#x5C11;90&#x540E;&#x7684;&#x8868;&#x8FBE;&#x8D77;&#x70B9;&#xFF09;&#x3002;&#x636E;&#x6211;&#x4E86;&#x89E3;&#xFF0C;&#x5FAE;&#x4FE1;&#x516C;&#x4F17;&#x53F7;&#x7684;&#x6587;&#x7AE0;&#x4EC5;&#x80FD;&#x901A;&#x8FC7;&#x641C;&#x72D7;&#x68C0;&#x7D22;&#x5F97;&#x5230;&#xFF0C;&#x4E14;&#x6240;&#x6709;&#x5916;&#x94FE;&#x53EA;&#x80FD;&#x901A;&#x8FC7;&#x201C;&#x9605;&#x8BFB;&#x539F;&#x6587;&#x201D;&#x5B9E;&#x73B0;&#xFF0C;&#x8FD9;&#x662F;&#x4EE4;&#x6211;&#x975E;&#x5E38;&#x538C;&#x6076;&#x7684;&#x5730;&#x65B9;&#x3002;&#x8981;&#x77E5;&#x9053;&#xFF0C;&#x8D85;&#x94FE;&#x63A5;&#x662F;WWW&#x5EFA;&#x7ACB;&#x7684;&#x4E00;&#x4E2A;&#x6838;&#x5FC3;&#xFF0C;&#x5373;&#x7F51;&#x9875;&#x662F;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x94FE;&#x63A5;&#x81EA;&#x7531;&#x8DF3;&#x8F6C;&#x7684;&#x3002;</p>
<h4 id="&#x8BBA;&#x575B;-Forum-&#x767E;&#x5EA6;&#x8D34;&#x5427;-&#x5A01;&#x950B;&#x8BBA;&#x575B;-&#x4EBA;&#x5927;&#x7ECF;&#x6D4E;&#x8BBA;&#x575B;"><a href="#&#x8BBA;&#x575B;-Forum-&#x767E;&#x5EA6;&#x8D34;&#x5427;-&#x5A01;&#x950B;&#x8BBA;&#x575B;-&#x4EBA;&#x5927;&#x7ECF;&#x6D4E;&#x8BBA;&#x575B;" class="headerlink" title="&#x8BBA;&#x575B; Forum: &#x767E;&#x5EA6;&#x8D34;&#x5427;/&#x5A01;&#x950B;&#x8BBA;&#x575B;/&#x4EBA;&#x5927;&#x7ECF;&#x6D4E;&#x8BBA;&#x575B;"></a>&#x8BBA;&#x575B; Forum: &#x767E;&#x5EA6;&#x8D34;&#x5427;/&#x5A01;&#x950B;&#x8BBA;&#x575B;/&#x4EBA;&#x5927;&#x7ECF;&#x6D4E;&#x8BBA;&#x575B;</h4><ul>
<li>&#x7F16;&#x8F91;&#x63A5;&#x53E3;&#xFF1A;&#x4E13;&#x7528;&#x7F16;&#x8F91;&#x5668;</li>
<li>&#x5B9A;&#x5236;&#x6027;&#xFF1A;&#x5C11;&#x91CF;&#x683C;&#x5F0F;&#x6587;&#x672C;&#xFF0C;&#x7EDF;&#x4E00;&#x9875;&#x9762;&#x98CE;&#x683C;</li>
<li>&#x5206;&#x53D1;&#x6E20;&#x9053;&#xFF1A;&#x53D7;&#x9650;&#xFF0C;&#x4F46;&#x81EA;&#x5E26;&#x8BBA;&#x575B;&#x6D41;&#x91CF;</li>
</ul>
<p>&#x8BBA;&#x575B;&#x7684;&#x8BFB;&#x8005;&#x5E38;&#x5E38;&#x6709;&#x5171;&#x540C;&#x611F;&#x5174;&#x8DA3;&#x7684;&#x8BDD;&#x9898;&#xFF0C;&#x5728;&#x8FD9;&#x4E9B;&#x573A;&#x5408;&#x8868;&#x8FBE;&#x89C2;&#x70B9;&#x5E38;&#x5E38;&#x4F1A;&#x88AB;&#x5BB9;&#x6613;&#x7406;&#x89E3;&#xFF0C;&#x4F46;&#x7531;&#x4E8E;&#x4E0D;&#x540C;&#x7684;&#x8BBA;&#x575B;&#x673A;&#x5236;&#x548C;&#x8BBA;&#x575B;&#x8BFB;&#x8005;&#xFF0C;&#x662F;&#x5426;&#x9002;&#x5408;&#x4E25;&#x8083;&#x521B;&#x4F5C;&#x8FD8;&#x662F;&#x8981;&#x5355;&#x72EC;&#x8BA8;&#x8BBA;&#x7684;&#x3002;&#x636E;&#x6211;&#x7684;&#x89C2;&#x5BDF;&#xFF0C;&#x8DDF;&#x5E16;&#x65B9;&#x5E38;&#x5E38;&#x4E0D;&#x4F1A;&#x5B8C;&#x6574;&#x81EA;&#x4E3B;&#x5730;&#x8868;&#x8FBE;&#x89C2;&#x70B9;&#xFF0C;&#x96BE;&#x4EE5;&#x5F62;&#x6210;&#x6709;&#x6548;&#x7684;&#x8BA8;&#x8BBA;&#xFF08;&#x56E0;&#x8BDD;&#x9898;&#x800C;&#x5F02;&#xFF0C;&#x82E5;&#x4E13;&#x4E1A;&#x6027;&#x975E;&#x5E38;&#x5F3A;&#xFF0C;&#x8FD8;&#x662F;&#x76F8;&#x5F53;&#x503C;&#x5F97;&#x8003;&#x8651;&#x7684;&#xFF09;&#x3002;</p>
<h4 id="&#x793E;&#x533A;&#x7F51;&#x7AD9;-Community-&#x77E5;&#x4E4E;-&#x8C46;&#x74E3;-Linkedin-Quora-&#x5C11;&#x6570;&#x6D3E;-&#x6398;&#x91D1;"><a href="#&#x793E;&#x533A;&#x7F51;&#x7AD9;-Community-&#x77E5;&#x4E4E;-&#x8C46;&#x74E3;-Linkedin-Quora-&#x5C11;&#x6570;&#x6D3E;-&#x6398;&#x91D1;" class="headerlink" title="&#x793E;&#x533A;&#x7F51;&#x7AD9; Community: &#x77E5;&#x4E4E;/&#x8C46;&#x74E3;/Linkedin/Quora/&#x5C11;&#x6570;&#x6D3E;/&#x6398;&#x91D1;"></a>&#x793E;&#x533A;&#x7F51;&#x7AD9; Community: &#x77E5;&#x4E4E;/&#x8C46;&#x74E3;/Linkedin/Quora/&#x5C11;&#x6570;&#x6D3E;/&#x6398;&#x91D1;</h4><ul>
<li>&#x7F16;&#x8F91;&#x63A5;&#x53E3;&#xFF1A;&#x4E13;&#x7528;&#x7F16;&#x8F91;&#x6216;&#x5BFC;&#x5165;&#x6587;&#x4EF6;</li>
<li>&#x5B9A;&#x5236;&#x6027;&#xFF1A;&#x5BCC;&#x6587;&#x672C;&#xFF0C;&#x7EDF;&#x4E00;&#x9875;&#x9762;&#x98CE;&#x683C;</li>
<li>&#x5206;&#x53D1;&#x6E20;&#x9053;&#xFF1A;&#x534A;&#x5F00;&#x653E;&#xFF0C;&#x81EA;&#x5E26;&#x8BDD;&#x9898;&#x6D41;&#x91CF;&#x548C;&#x63A8;&#x8350;&#xFF0C;&#x90E8;&#x5206;&#x53EF;&#x4EE5;&#x5F97;&#x5230;&#x7A33;&#x5B9A;&#x63A8;&#x9001;</li>
</ul>
<p>&#x77E5;&#x4E4E;/Quora&#x8FD9;&#x6837;&#x7684;&#x95EE;&#x7B54;&#x5E73;&#x53F0;&#x901A;&#x5E38;&#x6709;&#x8BDD;&#x9898;&#x673A;&#x5236;&#xFF0C;&#x5BB9;&#x6613;&#x5C06;&#x81EA;&#x5DF1;&#x7684;&#x4F5C;&#x54C1;&#x6295;&#x653E;&#x548C;&#x83B7;&#x5F97;&#x53CD;&#x9988;&#xFF0C;&#x4E14;&#x80FD;&#x88AB;&#x68C0;&#x7D22;&#xFF0C;&#x4F20;&#x64AD;&#x8303;&#x56F4;&#x76F8;&#x5BF9;&#x5E7F;&#xFF0C;&#x901A;&#x8FC7;&#x5173;&#x6CE8;&#x673A;&#x5236;&#x8FD8;&#x53EF;&#x4EE5;&#x83B7;&#x5F97;&#x76F8;&#x5BF9;&#x7A33;&#x5B9A;&#x7684;&#x6D41;&#x91CF;&#x3002;&#x5C11;&#x6570;&#x6D3E;&#x7B49;&#x4F5C;&#x4E3A;&#x5A92;&#x4F53;&#xFF0C;&#x4E5F;&#x63A5;&#x53D7;&#x76F8;&#x5173;&#x6295;&#x7A3F;&#xFF0C;&#x53EF;&#x4EE5;&#x900F;&#x8FC7;&#x5176;&#x5F71;&#x54CD;&#x529B;&#x4E3A;&#x81EA;&#x5DF1;&#x7684;&#x4F5C;&#x54C1;&#x5E26;&#x6765;&#x6D41;&#x91CF;&#x3002;&#x8FD9;&#x4E00;&#x7C7B;&#x578B;&#x662F;&#x6211;&#x6BD4;&#x8F83;&#x63A8;&#x8350;&#x53EF;&#x4F9B;&#x975E;&#x6280;&#x672F;&#x80CC;&#x666F;&#x7684;&#x5199;&#x4F5C;&#x8005;&#x9009;&#x62E9;&#x7684;&#x5E73;&#x53F0;&#x3002;</p>
<h4 id="&#x521B;&#x4F5C;&#x5E73;&#x53F0;-Publishing-Platform-&#x7B80;&#x4E66;-Lofter-&#x65B0;&#x6D6A;&#x535A;&#x5BA2;-&#x535A;&#x5BA2;&#x56ED;-CSDN-Medium-GitBook-LeanPub"><a href="#&#x521B;&#x4F5C;&#x5E73;&#x53F0;-Publishing-Platform-&#x7B80;&#x4E66;-Lofter-&#x65B0;&#x6D6A;&#x535A;&#x5BA2;-&#x535A;&#x5BA2;&#x56ED;-CSDN-Medium-GitBook-LeanPub" class="headerlink" title="&#x521B;&#x4F5C;&#x5E73;&#x53F0; Publishing Platform: &#x7B80;&#x4E66;/Lofter/&#x65B0;&#x6D6A;&#x535A;&#x5BA2;/&#x535A;&#x5BA2;&#x56ED;/CSDN/Medium/GitBook/LeanPub"></a>&#x521B;&#x4F5C;&#x5E73;&#x53F0; Publishing Platform: &#x7B80;&#x4E66;/Lofter/&#x65B0;&#x6D6A;&#x535A;&#x5BA2;/&#x535A;&#x5BA2;&#x56ED;/CSDN/Medium/GitBook/LeanPub</h4><ul>
<li>&#x7F16;&#x8F91;&#x63A5;&#x53E3;&#xFF1A;&#x4E13;&#x7528;&#x7F16;&#x8F91;&#x5668;&#x6216;&#x5BFC;&#x5165;&#x6587;&#x4EF6;</li>
<li>&#x5B9A;&#x5236;&#x6027;&#xFF1A;&#x5BCC;&#x6587;&#x672C;&#xFF0C;&#x6709;&#x9650;&#x7684;&#x4E3B;&#x9898;&#x98CE;&#x683C;</li>
<li>&#x5206;&#x53D1;&#x6E20;&#x9053;&#xFF1A;&#x5BB9;&#x6613;&#x88AB;&#x641C;&#x7D22;&#x5F15;&#x64CE;&#x7D22;&#x5F15;&#x5230;&#xFF0C;&#x81EA;&#x5E26;&#x7F51;&#x7AD9;&#x6D41;&#x91CF;&#x548C;&#x63A8;&#x8350;&#xFF0C;&#x90E8;&#x5206;&#x53EF;&#x4EE5;&#x5F97;&#x5230;&#x7A33;&#x5B9A;&#x63A8;&#x9001;</li>
</ul>
<p>&#x8FD9;&#x7C7B;&#x5E73;&#x53F0;&#x63D0;&#x4F9B;&#x8F83;&#x7EDF;&#x4E00;&#x7684;&#x9875;&#x9762;&#x98CE;&#x683C;&#x548C;&#x5185;&#x5BB9;&#x7BA1;&#x7406;&#x53D1;&#x5E03;&#x529F;&#x80FD;&#xFF0C;&#x90E8;&#x5206;&#x4E5F;&#x6709;&#x5173;&#x6CE8;&#x673A;&#x5236;&#x53EF;&#x5E26;&#x6765;&#x7A33;&#x5B9A;&#x6D41;&#x91CF;&#xFF0C;&#x662F;&#x6211;&#x6700;&#x63A8;&#x8350;&#x7684;&#x975E;&#x6280;&#x672F;&#x80CC;&#x666F;&#xFF08;&#x6216;&#x61D2;&#x4E8E;&#x6298;&#x817E;&#xFF09;&#x5199;&#x4F5C;&#x8005;&#x7684;&#x521B;&#x4F5C;&#x5E73;&#x53F0;&#x3002;&#x540E;&#x4E24;&#x8005;GitBook&#x548C;LeanPub&#x5219;&#x662F;&#x5F00;&#x6E90;&#x7684;&#x56FE;&#x4E66;&#x5728;&#x7EBF;&#x51FA;&#x7248;&#x670D;&#x52A1;&#x3002;</p>
<h4 id="&#x535A;&#x5BA2;&#x5E73;&#x53F0;-Blogging-Platform-WordPress-Ghost-Blogger"><a href="#&#x535A;&#x5BA2;&#x5E73;&#x53F0;-Blogging-Platform-WordPress-Ghost-Blogger" class="headerlink" title="&#x535A;&#x5BA2;&#x5E73;&#x53F0; Blogging Platform: WordPress/Ghost/Blogger"></a>&#x535A;&#x5BA2;&#x5E73;&#x53F0; Blogging Platform: WordPress/Ghost/Blogger</h4><ul>
<li>&#x7F16;&#x8F91;&#x63A5;&#x53E3;&#xFF1A;&#x4E13;&#x7528;&#x7F16;&#x8F91;&#x5668;&#x548C;&#x5199;&#x4F5C;&#x5DE5;&#x5177;&#x652F;&#x6301;</li>
<li>&#x5B9A;&#x5236;&#x6027;&#xFF1A;&#x5BCC;&#x6587;&#x672C;&#xFF08;+&#x7F51;&#x9875;&#x683C;&#x5F0F;&#xFF09;&#xFF0C;&#x4E30;&#x5BCC;&#x7684;&#x4E3B;&#x9898;&#x9009;&#x62E9;&#xFF0C;&#x81EA;&#x5B9A;&#x4E49;&#x98CE;&#x683C;&#x5B9A;&#x5236;&#xFF0C;&#x751A;&#x81F3;&#x652F;&#x6301;&#x81EA;&#x7F16;&#x7A0B;&#x5E8F;&#xFF0C;&#x90E8;&#x5206;&#x4E5F;&#x652F;&#x6301;&#x4E2A;&#x6027;&#x5316;&#x57DF;&#x540D;</li>
<li>&#x5206;&#x53D1;&#x6E20;&#x9053;&#xFF1A;&#x641C;&#x7D22;&#x5F15;&#x64CE;&#x548C;&#x90E8;&#x5206;&#x5E73;&#x53F0;&#x6D41;&#x91CF;</li>
</ul>
<p>&#x6B64;&#x7C7B;&#x5E73;&#x53F0;&#x901A;&#x5E38;&#x4EE5;&#x535A;&#x5BA2;&#x7A0B;&#x5E8F;&#x4E3A;&#x6838;&#x5FC3;&#xFF0C;&#x63D0;&#x4F9B;&#x7F16;&#x8F91;&#x3001;&#x53D1;&#x5E03;&#x548C;&#x6258;&#x7BA1;&#x7684;&#x4E00;&#x7AD9;&#x5F0F;&#x670D;&#x52A1;&#x3002;&#x63D0;&#x4F9B;&#x7684;&#x98CE;&#x683C;&#x9009;&#x62E9;&#x4E5F;&#x8F83;&#x4E3A;&#x591A;&#x6837;&#xFF0C;&#x4E14;&#x6709;&#x8F83;&#x4E3A;&#x4E30;&#x5BCC;&#x7684;&#x63D2;&#x4EF6;&#x6269;&#x5C55;&#xFF0C;&#x53EF;&#x4F9B;&#x8FDB;&#x9636;&#x5199;&#x4F5C;&#x8005;&#x9009;&#x62E9;&#xFF0C;&#x4E5F;&#x9002;&#x7528;&#x4E8E;&#x6709;&#x8F83;&#x9AD8;&#x5B9A;&#x5236;&#x9700;&#x6C42;&#x7684;&#x5199;&#x4F5C;&#x8005;&#xFF08;&#x6BD4;&#x5982;&#x5EFA;&#x7ACB;&#x4E2A;&#x4EBA;&#x4E3B;&#x9875;&#xFF09;&#x3002;&#x4E0D;&#x8FC7;&#x4E0D;&#x5C11;&#x7C7B;&#x4F3C;&#x670D;&#x52A1;&#xFF08;&#x6216;&#x5176;&#x9AD8;&#x9636;&#x529F;&#x80FD;&#xFF09;&#x662F;&#x4ED8;&#x8D39;&#x4F7F;&#x7528;&#x7684;&#x3002;</p>
<h4 id="&#x81EA;&#x5EFA;&#x535A;&#x5BA2;&#x7A0B;&#x5E8F;-&#x6258;&#x7BA1;&#x670D;&#x52A1;-Self-Hosted-Blog-Software-Hosting-WordPress-Joomla-Drupal"><a href="#&#x81EA;&#x5EFA;&#x535A;&#x5BA2;&#x7A0B;&#x5E8F;-&#x6258;&#x7BA1;&#x670D;&#x52A1;-Self-Hosted-Blog-Software-Hosting-WordPress-Joomla-Drupal" class="headerlink" title="&#x81EA;&#x5EFA;&#x535A;&#x5BA2;&#x7A0B;&#x5E8F;+&#x6258;&#x7BA1;&#x670D;&#x52A1; Self-Hosted Blog Software + Hosting: WordPress/Joomla!/Drupal"></a>&#x81EA;&#x5EFA;&#x535A;&#x5BA2;&#x7A0B;&#x5E8F;+&#x6258;&#x7BA1;&#x670D;&#x52A1; Self-Hosted Blog Software + Hosting: WordPress/Joomla!/Drupal</h4><ul>
<li>&#x7F16;&#x8F91;&#x63A5;&#x53E3;&#xFF1A;&#x4E13;&#x7528;&#x7F16;&#x8F91;&#x5668;&#x548C;&#x5199;&#x4F5C;&#x5DE5;&#x5177;&#x652F;&#x6301;</li>
<li>&#x5B9A;&#x5236;&#x6027;&#xFF1A;&#x5BCC;&#x6587;&#x672C;&#xFF08;+&#x7F51;&#x9875;&#x683C;&#x5F0F;&#xFF09;&#xFF0C;&#x4E30;&#x5BCC;&#x7684;&#x4E3B;&#x9898;&#x9009;&#x62E9;&#xFF08;&#x652F;&#x6301;&#x4E8C;&#x6B21;&#x5F00;&#x53D1;&#x548C;&#x4FEE;&#x6539;&#xFF09;&#xFF0C;&#x81EA;&#x5B9A;&#x4E49;&#x98CE;&#x683C;&#x5B9A;&#x5236;&#xFF0C;&#x4E2A;&#x6027;&#x5316;&#x57DF;&#x540D;&#x548C;&#x6258;&#x7BA1;&#x63A7;&#x5236;</li>
<li>&#x5206;&#x53D1;&#x6E20;&#x9053;&#xFF1A;&#x641C;&#x7D22;&#x5F15;&#x64CE;&#x3001;&#x81EA;&#x6211;&#x63A8;&#x5E7F;</li>
</ul>
<p>&#x8FD9;&#x79CD;&#x9009;&#x62E9;&#x901A;&#x5E38;&#x9700;&#x8981;&#x4E00;&#x5B9A;&#x7684;&#x6280;&#x672F;&#x5B66;&#x4E60;&#x8D1F;&#x62C5;&#xFF0C;&#x9700;&#x8981;&#x7B80;&#x8981;&#x4E86;&#x89E3;&#x7F51;&#x7AD9;&#x4F3A;&#x670D;&#x3001;&#x535A;&#x5BA2;&#x7A0B;&#x5E8F;&#x8FD0;&#x884C;&#x7684;&#x8FC7;&#x7A0B;&#x7B49;&#x77E5;&#x8BC6;&#x3002;&#x4EE5;&#x6700;&#x5E7F;&#x6CDB;&#x4F7F;&#x7528;&#x7684;WordPress&#x4E3A;&#x4F8B;&#xFF0C;&#x9700;&#x8981;&#x81EA;&#x5DF1;&#x914D;&#x7F6E;&#x540E;&#x7AEF;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x5E76;&#x5B66;&#x4F1A;&#x4F7F;&#x7528;&#x63A7;&#x5236;&#x9762;&#x677F;&#x6765;&#x642D;&#x5EFA;&#x535A;&#x5BA2;&#x7A0B;&#x5E8F;&#x6240;&#x9700;&#x7684;&#x8FD0;&#x884C;&#x73AF;&#x5883;&#xFF08;&#x5982;LAMP&#xFF09;&#x3002;&#x5982;&#x679C;&#x8981;&#x4F7F;&#x7528;&#x4E2A;&#x6027;&#x57DF;&#x540D;&#xFF0C;&#x5219;&#x8FD8;&#x8981;&#x914D;&#x7F6E;&#x89E3;&#x6790;&#x7B49;&#xFF1B;&#x5982;&#x679C;&#x6258;&#x7BA1;&#x670D;&#x52A1;&#x5728;&#x56FD;&#x5185;&#x6216;&#x662F;&#x57DF;&#x540D;&#x4E3A;.cn&#x7B49;&#x540E;&#x7F00;&#xFF0C;&#x5219;&#x8FD8;&#x4F1A;&#x88AB;&#x8981;&#x6C42;&#x5907;&#x6848;&#x3002;&#x5F53;&#x7136;&#x5B9A;&#x5236;&#x6027;&#x4E5F;&#x4F1A;&#x66F4;&#x9AD8;&#xFF0C;&#x9664;&#x535A;&#x5BA2;&#x5E73;&#x53F0;&#x6240;&#x63D0;&#x4F9B;&#x7684;&#x529F;&#x80FD;&#x5916;&#xFF0C;&#x751A;&#x81F3;&#x53EF;&#x4EE5;&#x5728;&#x5F00;&#x6E90;&#x535A;&#x5BA2;&#x7A0B;&#x5E8F;&#x57FA;&#x7840;&#x4E0A;&#x81EA;&#x5DF1;&#x6DFB;&#x52A0;&#x529F;&#x80FD;&#x3002;&#x8FD9;&#x79CD;&#x9009;&#x62E9;&#x53EF;&#x4EE5;&#x6210;&#x4E3A;&#x6709;&#x6298;&#x817E;&#x7CBE;&#x795E;&#x6216;&#x662F;&#x672A;&#x6765;&#x4F1A;&#x4ECE;&#x4E8B;&#x524D;&#x7AEF;&#x5F00;&#x53D1;&#x7684;&#x5199;&#x4F5C;&#x8005;&#x7684;&#x8D77;&#x70B9;&#x3002;</p>
<h4 id="&#x9759;&#x6001;&#x7F51;&#x9875;&#x751F;&#x6210;&#x5668;-&#x6258;&#x7BA1;&#x670D;&#x52A1;-Static-Page-Generators-Hosting-Jekyll-Hexo"><a href="#&#x9759;&#x6001;&#x7F51;&#x9875;&#x751F;&#x6210;&#x5668;-&#x6258;&#x7BA1;&#x670D;&#x52A1;-Static-Page-Generators-Hosting-Jekyll-Hexo" class="headerlink" title="&#x9759;&#x6001;&#x7F51;&#x9875;&#x751F;&#x6210;&#x5668;+&#x6258;&#x7BA1;&#x670D;&#x52A1; Static Page Generators + Hosting: Jekyll/Hexo"></a>&#x9759;&#x6001;&#x7F51;&#x9875;&#x751F;&#x6210;&#x5668;+&#x6258;&#x7BA1;&#x670D;&#x52A1; Static Page Generators + Hosting: Jekyll/Hexo</h4><ul>
<li>&#x7F16;&#x8F91;&#x63A5;&#x53E3;&#xFF1A;&#x6587;&#x672C;&#x7F16;&#x8F91;&#x5668;&#x53CA;&#x81EA;&#x7531;&#x9009;&#x62E9;&#x5199;&#x4F5C;&#x5DE5;&#x5177;&#xFF0C;&#x5EFA;&#x7ACB;&#x4F5C;&#x54C1;&#x5C42;&#x62BD;&#x8C61;</li>
<li>&#x5B9A;&#x5236;&#x6027;&#xFF1A;&#x51E0;&#x4E4E;&#x5B8C;&#x5168;&#x7684;&#x7F51;&#x9875;&#x63A7;&#x5236;&#xFF0C;&#x53EF;&#x5145;&#x5206;&#x5B9A;&#x5236;&#x7684;&#x4E3B;&#x9898;&#x53CA;&#x9875;&#x9762;&#x98CE;&#x683C;&#xFF0C;&#x4E2A;&#x6027;&#x57DF;&#x540D;&#x548C;&#x6258;&#x7BA1;&#x63A7;&#x5236;</li>
<li>&#x5206;&#x53D1;&#x6E20;&#x9053;&#xFF1A;&#x641C;&#x7D22;&#x5F15;&#x64CE;&#x3001;&#x81EA;&#x6211;&#x63A8;&#x5E7F;</li>
</ul>
<p>&#x8FD9;&#x7C7B;&#x9009;&#x62E9;&#x8DDF;&#x4E0A;&#x4E00;&#x7EC4;&#x5408;&#x7C7B;&#x4F3C;&#xFF0C;&#x53EA;&#x662F;&#x6240;&#x63D0;&#x4F9B;&#x7684;&#x9875;&#x9762;&#x5E76;&#x975E;&#x7531;&#x535A;&#x5BA2;&#x7A0B;&#x5E8F;&#x751F;&#x6210;&#xFF0C;&#x800C;&#x7531;&#x672C;&#x5730;&#x7A0B;&#x5E8F;&#x751F;&#x6210;&#x540E;&#x4E0A;&#x4F20;&#x81F3;&#x6258;&#x7BA1;&#x670D;&#x52A1;&#x3002;&#x540C;&#x6837;&#x4E5F;&#x9700;&#x8981;&#x90E8;&#x5206;&#x6280;&#x672F;&#x5B66;&#x4E60;&#x8D1F;&#x62C5;&#xFF0C;&#x4F46;&#x5BF9;&#x7F51;&#x9875;&#x51E0;&#x4E4E;&#x6709;&#x5168;&#x90E8;&#x7684;&#x63A7;&#x5236;&#xFF08;&#x4F60;&#x53EF;&#x4EE5;&#x5355;&#x72EC;&#x7528;HTML&#x505A;&#x4E00;&#x4E2A;&#x4E2A;&#x4EBA;&#x7F51;&#x9875;&#xFF09;&#x3002;Jekyll&#x548C;Hexo&#x90FD;&#x662F;&#x8FD9;&#x6837;&#x7684;&#x751F;&#x6210;&#x5F15;&#x64CE;&#xFF0C;&#x5B83;&#x4EEC;&#x5C06;&#x6211;&#x4EEC;&#x521B;&#x4F5C;&#x7684;Markdown&#x683C;&#x5F0F;&#x6587;&#x6863;&#x5904;&#x7406;&#x4E3A;HTML&#x7F51;&#x9875;&#xFF0C;&#x5E76;&#x901A;&#x8FC7;&#x63D2;&#x4EF6;&#x6216;&#x5176;&#x4ED6;&#x65B9;&#x5F0F;&#x4E0A;&#x4F20;&#x81F3;&#x6258;&#x7BA1;&#x670D;&#x52A1;&#xFF0C;&#x7528;&#x6237;&#x76F4;&#x63A5;&#x8BBF;&#x95EE;&#x7F51;&#x9875;&#xFF0C;&#x4E5F;&#x8F83;&#x535A;&#x5BA2;&#x7A0B;&#x5E8F;&#x5BF9;&#x4F3A;&#x670D;&#x670D;&#x52A1;&#x5668;&#x7684;&#x8981;&#x6C42;&#x66F4;&#x4F4E;&#x4E00;&#x70B9;&#x3002;&#x540C;&#x6837;&#x5730;&#xFF0C;&#x6211;&#x4EEC;&#x4E5F;&#x53EF;&#x4EE5;&#x5BF9;&#x4E3B;&#x9898;&#x6216;&#x63D2;&#x4EF6;&#x8FDB;&#x884C;&#x4E8C;&#x6B21;&#x5F00;&#x53D1;&#xFF0C;&#x4EE5;&#x6EE1;&#x8DB3;&#x81EA;&#x5DF1;&#x7684;&#x9700;&#x8981;&#x3002;&#x8FD9;&#x4E00;&#x9009;&#x62E9;&#x540C;&#x6837;&#x63A8;&#x8350;&#x7ED9;&#x6709;&#x6298;&#x817E;&#x7CBE;&#x795E;&#x6216;&#x662F;&#x672A;&#x6765;&#x4F1A;&#x4ECE;&#x4E8B;&#x524D;&#x7AEF;&#x5F00;&#x53D1;&#x7684;&#x5199;&#x4F5C;&#x8005;&#x3002;<br>&#x5305;&#x62EC;&#x6B64;&#x9879;&#x548C;&#x4E0A;&#x4E00;&#x9879;&#x5DF2;&#x53EF;&#x4EE5;&#x8BA4;&#x4E3A;&#x662F;&#x5177;&#x6709;&#x8DB3;&#x591F;&#x7075;&#x6D3B;&#x6027;&#x7684;&#x521B;&#x4F5C;&#x65B9;&#x5F0F; &#xFF0C;&#x4E5F;&#x662F;&#x7F51;&#x7EDC;&#x4E0A;&#x6559;&#x7A0B;&#x8D44;&#x6E90;&#x975E;&#x5E38;&#x4E30;&#x5BCC;&#x7684;&#x4E24;&#x9009;&#x9879;&#xFF0C;&#x66F4;&#x8FDB;&#x4E00;&#x6B65;&#x7684;&#x7F51;&#x7AD9;&#x5F00;&#x53D1;&#x7B49;&#x5C06;&#x8D85;&#x51FA;&#x672C;&#x6587;&#x7684;&#x8303;&#x7574;&#xFF08;&#x800C;&#x4E14;&#x6211;&#x4E5F;&#x5E76;&#x4E0D;&#x719F;&#x6089;&#xFF09;&#x3002;</p>
<h4 id="&#x7BA1;&#x7406;&#x578B;&#x6258;&#x7BA1;&#x670D;&#x52A1;&#x548C;&#x6E32;&#x67D3;&#x5F15;&#x64CE;-Managed-Hosting-and-Rendering-Service-GoDaddy-&#x4E03;&#x725B;CDN-GitHub-Pages-Netlify"><a href="#&#x7BA1;&#x7406;&#x578B;&#x6258;&#x7BA1;&#x670D;&#x52A1;&#x548C;&#x6E32;&#x67D3;&#x5F15;&#x64CE;-Managed-Hosting-and-Rendering-Service-GoDaddy-&#x4E03;&#x725B;CDN-GitHub-Pages-Netlify" class="headerlink" title="&#x7BA1;&#x7406;&#x578B;&#x6258;&#x7BA1;&#x670D;&#x52A1;&#x548C;&#x6E32;&#x67D3;&#x5F15;&#x64CE; Managed Hosting and Rendering Service: GoDaddy/&#x4E03;&#x725B;CDN/GitHub Pages/Netlify"></a>&#x7BA1;&#x7406;&#x578B;&#x6258;&#x7BA1;&#x670D;&#x52A1;&#x548C;&#x6E32;&#x67D3;&#x5F15;&#x64CE; Managed Hosting and Rendering Service: GoDaddy/&#x4E03;&#x725B;CDN/GitHub Pages/Netlify</h4><p>&#x8FD9;&#x91CC;&#x5355;&#x72EC;&#x8C08;&#x4E00;&#x4E0B;&#x6258;&#x7BA1;&#x670D;&#x52A1;&#xFF0C;&#x9002;&#x7528;&#x4E8E;&#x4E0A;&#x9762;&#x63D0;&#x5230;&#x7684;&#x540E;&#x4E24;&#x79CD;&#x9009;&#x62E9;&#x3002;&#x6211;&#x4EEC;&#x7684;&#x7F51;&#x9875;&#x9700;&#x8981;&#x6258;&#x7BA1;&#x5230;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#xFF0C;&#x4F46;&#x6839;&#x636E;&#x9700;&#x8981;&#x53EF;&#x4EE5;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x4F7F;&#x7528;&#x5C42;&#x7EA7;&#x3002;&#x7BA1;&#x7406;&#x578B;&#x6258;&#x7BA1;&#x670D;&#x52A1;&#x6216;&#x79F0;&#x201C;&#x5171;&#x4EAB;&#x4E3B;&#x673A;&#x201D;&#x662F;&#x63D0;&#x4F9B;&#x5546;&#x5EFA;&#x7ACB;&#x4E86;&#x4E00;&#x5C42;&#x7BA1;&#x7406;&#x62BD;&#x8C61;&#x540E;&#x63D0;&#x4F9B;&#x7ED9;&#x7528;&#x6237;&#x7684;&#xFF0C;&#x7528;&#x6237;&#x9762;&#x5BF9;&#x7684;&#x63A5;&#x53E3;&#x4E3A;&#x4E3B;&#x673A;&#x9762;&#x677F;&#xFF0C;&#x901A;&#x8FC7;&#x6B64;&#x9762;&#x677F;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x5EFA;&#x7ACB;&#x7F51;&#x7AD9;&#x3001;&#x5B89;&#x88C5;&#x535A;&#x5BA2;&#x7A0B;&#x5E8F;&#x7B49;&#x529F;&#x80FD;&#xFF0C;&#x80CC;&#x540E;&#x7684;&#x786C;&#x4EF6;&#x8D44;&#x6E90;&#x5219;&#x662F;&#x5171;&#x4EAB;&#x7684;&#xFF0C;&#x5982;GoDaddy&#x3002;&#x4E03;&#x725B;&#x4E91;CDN&#x548C;&#x5176;&#x4ED6;&#x4E91;&#x670D;&#x52A1;&#x5546;&#x63D0;&#x4F9B;&#x7684;&#x5BF9;&#x8C61;&#x5B58;&#x50A8;&#x529F;&#x80FD;&#xFF0C;&#x5219;&#x662F;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x90E8;&#x5206;&#x5728;&#x7EBF;&#x7684;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#xFF0C;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x5B58;&#x653E;&#x9759;&#x6001;&#x7F51;&#x9875;&#xFF08;&#x4E0D;&#x652F;&#x6301;&#x535A;&#x5BA2;&#x7A0B;&#x5E8F;&#xFF09;&#x3002;&#x800C;GitHub Pages&#x548C;Netlify&#x7B49;&#x5219;&#x63D0;&#x4F9B;&#x4E86;&#x5BF9;&#x4E8E;&#x67D0;&#x7C7B;&#x6A21;&#x7248;&#x5F15;&#x64CE;&#xFF08;&#x5373;&#x751F;&#x6210;&#x5668;&#xFF0C;&#x5982;Jekyll&#xFF09;&#x7684;&#x6E32;&#x67D3;&#x529F;&#x80FD;&#xFF0C;&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x5C06;&#x7F16;&#x8F91;&#x7684;Markdown&#x6587;&#x4EF6;&#x4E0A;&#x4F20;&#xFF0C;&#x7531;&#x670D;&#x52A1;&#x63D0;&#x4F9B;&#x5546;&#x6765;&#x6E32;&#x67D3;&#x4E3A;&#x5B9E;&#x9645;&#x770B;&#x5230;&#x7684;&#x7F51;&#x9875;&#xFF08;&#x5F53;&#x7136;&#x6B64;&#x65F6;&#x5B9A;&#x5236;&#x6027;&#x4FBF;&#x6709;&#x6240;&#x6536;&#x7F29;&#xFF09;&#x3002;&#x6258;&#x7BA1;&#x670D;&#x52A1;&#x4E2D;&#x81EA;&#x7531;&#x6027;&#x6700;&#x9AD8;&#x7684;&#x662F;&#x4E0B;&#x9762;&#x7684;&#x81EA;&#x7BA1;&#x7406;&#x6258;&#x7BA1;&#x670D;&#x52A1;&#xFF08;&#x6216;&#x79F0;VPS&#xFF0C;&#x865A;&#x62DF;&#x79C1;&#x4EBA;&#x4E3B;&#x673A;&#xFF09;&#x3002;</p>
<h4 id="&#x81EA;&#x7BA1;&#x7406;&#x6258;&#x7BA1;&#x670D;&#x52A1;-Unmanaged-Hosting-VPS-AWS-EC2-AliYun"><a href="#&#x81EA;&#x7BA1;&#x7406;&#x6258;&#x7BA1;&#x670D;&#x52A1;-Unmanaged-Hosting-VPS-AWS-EC2-AliYun" class="headerlink" title="&#x81EA;&#x7BA1;&#x7406;&#x6258;&#x7BA1;&#x670D;&#x52A1; Unmanaged Hosting(VPS): AWS EC2/AliYun"></a>&#x81EA;&#x7BA1;&#x7406;&#x6258;&#x7BA1;&#x670D;&#x52A1; Unmanaged Hosting(VPS): AWS EC2/AliYun</h4><p>&#x8FD9;&#x7C7B;&#x670D;&#x52A1;&#x76F4;&#x63A5;&#x63D0;&#x4F9B;&#x7ED9;&#x7528;&#x6237;&#x53EF;&#x4F9B;&#x8FDC;&#x7A0B;&#x767B;&#x5F55;&#x7684;&#x865A;&#x62DF;&#x4E3B;&#x673A;&#xFF08;&#x7269;&#x7406;&#x4E3B;&#x673A;&#x4E0A;&#x4E00;&#x5C42;&#x62BD;&#x8C61;&#xFF0C;&#x53EF;&#x7406;&#x89E3;&#x4E3A;&#x7CFB;&#x7EDF;&#x5185;&#x5B58;&#x548C;RAM&#x7684;&#x5173;&#x7CFB;&#xFF09;&#xFF0C;&#x5177;&#x6709;&#x8FDC;&#x4E0D;&#x6B62;&#x7F51;&#x9875;&#x4F3A;&#x670D;&#x7684;&#x64CD;&#x4F5C;&#x7A7A;&#x95F4;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5728;&#x5176;&#x4E0A;&#x81EA;&#x884C;&#x642D;&#x5EFA;&#x4F3A;&#x670D;&#x73AF;&#x5883;&#x548C;&#x535A;&#x5BA2;&#x7A0B;&#x5E8F;&#xFF08;&#x6216;&#x4E0A;&#x4F20;&#x9759;&#x6001;&#x7F51;&#x9875;&#xFF09;&#xFF0C;&#x5E76;&#x5BF9;&#x6574;&#x4E2A;&#x8FC7;&#x7A0B;&#x6709;&#x76F8;&#x5F53;&#x5145;&#x5206;&#x7684;&#x63A7;&#x5236;&#x6743;&#x3002;&#x4F7F;&#x7528;&#x56FD;&#x5185;&#x4E91;&#x670D;&#x52A1;&#x5546;&#x63D0;&#x4F9B;&#x7684;&#x4E3B;&#x673A;&#x65F6;&#xFF0C;&#x9700;&#x8981;&#x8003;&#x8651;&#x5907;&#x6848;&#x3002;</p>
<h4 id="&#x62FE;&#x9057;"><a href="#&#x62FE;&#x9057;" class="headerlink" title="&#x62FE;&#x9057;"></a>&#x62FE;&#x9057;</h4><p>&#x6211;&#x4E0A;&#x9762;&#x5217;&#x4E3E;&#x7684;&#x662F;&#x5F88;&#x5C0F;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x8FD8;&#x6709;&#x5F88;&#x591A;&#x6211;&#x672A;&#x66FE;&#x8BD5;&#x7528;&#x7684;&#x670D;&#x52A1;&#xFF0C;&#x5982;&#x5934;&#x6761;&#x53F7;&#x3001;&#x8C46;&#x74E3;&#x9605;&#x8BFB;&#x7B49;&#x5199;&#x4F5C;&#x8BA1;&#x5212;&#x3001;SquareSpace&#x7B49;&#x7F51;&#x7AD9;&#x642D;&#x5EFA;&#x5E73;&#x53F0;&#x7B49;&#xFF0C;&#x90FD;&#x6709;&#x5404;&#x81EA;&#x7684;&#x4EBA;&#x673A;&#x534F;&#x4F5C;&#x7EF4;&#x5EA6;&#x4E0A;&#x7684;&#x6743;&#x8861;&#x548C;&#x9009;&#x62E9;&#xFF0C;&#x5E0C;&#x671B;&#x8BFB;&#x8005;&#x80FD;&#x591F;&#x660E;&#x786E;&#x81EA;&#x5DF1;&#x7684;&#x9700;&#x6C42;&#x548C;&#x6240;&#x80FD;&#x4ED8;&#x51FA;&#x7684;&#x7CBE;&#x529B;&#xFF0C;&#x5BA1;&#x614E;&#x9009;&#x62E9;&#xFF0C;&#x4E5F;&#x5E0C;&#x671B;&#x5176;&#x4ED6;&#x5E73;&#x53F0;&#x7684;&#x521B;&#x4F5C;&#x8005;&#x5728;&#x8BC4;&#x8BBA;&#x4E2D;&#x8865;&#x5145;&#x672C;&#x6587;&#x672A;&#x53CA;&#x7684;&#x6E20;&#x9053;&#x5DE5;&#x5177;&#x7B49;&#x3002;</p>
<h2 id="&#x7ED3;&#x8BED;"><a href="#&#x7ED3;&#x8BED;" class="headerlink" title="&#x7ED3;&#x8BED;"></a>&#x7ED3;&#x8BED;</h2><p>&#x5728;&#x6211;&#x770B;&#x6765;&#xFF0C;&#x8868;&#x8FBE;&#x548C;&#x521B;&#x4F5C;&#x662F;&#x81EA;&#x6211;&#x80FD;&#x91CF;&#x91CA;&#x653E;&#x7684;&#x4E00;&#x4E2A;&#x7A97;&#x53E3;&#x3002;&#x6CA1;&#x6709;&#x4E00;&#x4E2A;&#x4EBA;&#x662F;&#x8D2B;&#x4E4F;&#x7684;&#xFF0C;&#x4E5F;&#x6CA1;&#x6709;&#x4E00;&#x4E2A;&#x4EBA;&#x6CE8;&#x5B9A;&#x6C89;&#x9ED8;&#x3002;&#x5E0C;&#x671B;&#x672C;&#x6587;&#x7ED9;&#x8BFB;&#x8005;&#x63D0;&#x4F9B;&#x89C4;&#x5212;&#x4E0A;&#x548C;&#x884C;&#x52A8;&#x4E0A;&#x7684;&#x53C2;&#x8003;&#xFF0C;&#x6B22;&#x8FCE;&#x5927;&#x5BB6;&#x8BC4;&#x8BBA;&#x4EA4;&#x6D41;&#x3002;</p>

    
    </div>
    
    <div class="columns is-variable is-1 is-multiline is-mobile">
    
        <span class="column is-narrow"><a class="tag is-light article-tag" href="/tags/Digital-Life/">#Digital Life</a></span>
    
        <span class="column is-narrow"><a class="tag is-light article-tag" href="/tags/Blog/">#Blog</a></span>
    
        <span class="column is-narrow"><a class="tag is-light article-tag" href="/tags/Individual-Development/">#Individual Development</a></span>
    
        <span class="column is-narrow"><a class="tag is-light article-tag" href="/tags/Derivative/">#Derivative</a></span>
    
        <span class="column is-narrow"><a class="tag is-light article-tag" href="/tags/Writing/">#Writing</a></span>
    
    </div>
    
    
    <div class="columns is-mobile is-multiline article-nav">
        <span class="column is-12-mobile is-half-desktop  article-nav-prev">
            
            <a href="/posts/8c36a959/">博客改版与优化</a>
            
        </span>
        <span class="column is-12-mobile is-half-desktop  article-nav-next">
            
            <a href="/posts/5076f62f/">我的数字内容管理实践</a>
            
        </span>
    </div>
    
</article>




    </div>
</section>
    <footer class="footer">
    <div class="container">
        <div class="columns content">
            <div class="column is-narrow has-text-centered">
                &copy; 2020 ddlee&nbsp;
                Powered by <a href="http://hexo.io/" target="_blank">Hexo</a> & <a href="http://github.com/ppoffice/hexo-theme-minos">Minos</a>
            </div>
            <div class="column is-hidden-mobile"></div>

            
            <div class="column is-narrow">
                <div class="columns is-mobile is-multiline is-centered">
                
                    
                <a class="column is-narrow has-text-black" title="GitHub" href="https://github.com/ddlee-cn">
                    
                    <i class="fab fa-github"></i>
                    
                </a>
                
                    
                <a class="column is-narrow has-text-black" title="Telegram" href="https://t.me/ddleecn">
                    
                    <i class="fab fa-telegram-plane"></i>
                    
                </a>
                
                </div>
            </div>
            
            
        </div>
    </div>
</footer>
    <script src="//cdnjs.cloudflare.com/ajax/libs/jquery/3.3.1/jquery.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/moment.js/2.22.2/moment-with-locales.min.js"></script>

<!-- test if the browser is outdated -->
<div id="outdated">
    <h6>Your browser is out-of-date!</h6>
    <p>Update your browser to view this website correctly. <a id="btnUpdateBrowser" href="http://outdatedbrowser.com/">Update my browser now </a></p>
    <p class="last"><a href="#" id="btnCloseUpdateBrowser" title="Close">&times;</a></p>
</div>
<script src="//cdnjs.cloudflare.com/ajax/libs/outdated-browser/1.1.5/outdatedbrowser.min.js"></script>
<script>
    $(document).ready(function () {
        // plugin function, place inside DOM ready function
        outdatedBrowser({
            bgColor: '#f25648',
            color: '#ffffff',
            lowerThan: 'flex'
        })
    });
</script>

<script>
    window.FontAwesomeConfig = {
        searchPseudoElements: true
    }
    moment.locale("zh-CN");
</script>


    
    
<script src="https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.4/MathJax.js?config=TeX-MML-AM_CHTML"></script>
<script>
    MathJax.Hub.Config({
        "HTML-CSS": {
            matchFontHeight: false
        },
        SVG: {
            matchFontHeight: false
        },
        CommonHTML: {
            matchFontHeight: false
        },
        tex2jax: {
            inlineMath: [
                ['$','$'],
                ['\\(','\\)']
            ]
        }
    });
</script>

    
    
    
    
<script src="//cdnjs.cloudflare.com/ajax/libs/lightgallery/1.6.8/js/lightgallery-all.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/justifiedGallery/3.6.5/js/jquery.justifiedGallery.min.js"></script>
<script>
    (function ($) {
        $(document).ready(function () {
            if (typeof($.fn.lightGallery) === 'function') {
                $('.article.gallery').lightGallery({ selector: '.gallery-item' });
            }
            if (typeof($.fn.justifiedGallery) === 'function') {
                $('.justified-gallery').justifiedGallery();
            }
        });
    })(jQuery);
</script>

    
    
    <script src="https://cdnjs.cloudflare.com/ajax/libs/clipboard.js/2.0.0/clipboard.min.js"></script>
    <style>
        .hljs {
            position: relative;
        }

        .hljs .clipboard-btn {
            float: right;
            color: #9a9a9a;
            background: none;
            border: none;
            cursor: pointer;
        }

        .hljs .clipboard-btn:hover {
          color: #8a8a8a;
        }

        .hljs > .clipboard-btn {
            display: none;
            position: absolute;
            right: 4px;
            top: 4px;
        }

        .hljs:hover > .clipboard-btn {
            display: inline;
        }

        .hljs > figcaption > .clipboard-btn {
            margin-right: 4px;
        }
    </style>
    <script>
      $(document).ready(function () {
        $('figure.hljs').each(function(i, figure) {
          var codeId = 'code-' + i;
          var code = figure.querySelector('.code');
          var copyButton = $('<button>Copy <i class="far fa-clipboard"></i></button>');
          code.id = codeId;
          copyButton.addClass('clipboard-btn');
          copyButton.attr('data-clipboard-target-id', codeId);

          var figcaption = figure.querySelector('figcaption');

          if (figcaption) {
            figcaption.append(copyButton[0]);
          } else {
            figure.prepend(copyButton[0]);
          }
        })

        var clipboard = new ClipboardJS('.clipboard-btn', {
          target: function(trigger) {
            return document.getElementById(trigger.getAttribute('data-clipboard-target-id'));
          }
        });
        clipboard.on('success', function(e) {
          e.clearSelection();
        })
      })
    </script>

    
    

    


<script src="/js/script.js"></script>

    
    <div class="searchbox ins-search">
    <div class="searchbox-mask"></div>
    <div class="searchbox-container ins-search-container">
        <div class="searchbox-input-wrapper">
            <input type="text" class="searchbox-input ins-search-input" placeholder="站内搜索">
            <span class="searchbox-close ins-close ins-selectable"><i class="fa fa-times-circle"></i></span>
        </div>
        <div class="searchbox-result-wrapper ins-section-wrapper">
            <div class="ins-section-container"></div>
        </div>
    </div>
</div>
<script>
    (function (window) {
        var INSIGHT_CONFIG = {
            TRANSLATION: {
                POSTS: '文章',
                PAGES: '页面',
                CATEGORIES: '分类',
                TAGS: '标签',
                UNTITLED: '(无标题)',
            },
            CONTENT_URL: '/content.json',
        };
        window.INSIGHT_CONFIG = INSIGHT_CONFIG;
    })(window);
</script>
<script src="/js/insight.js"></script><!-- hexo-inject:begin --><!-- Begin: Injected MathJax -->
<script type="text/x-mathjax-config">
  MathJax.Hub.Config("");
</script>

<script type="text/x-mathjax-config">
  MathJax.Hub.Queue(function() {
    var all = MathJax.Hub.getAllJax(), i;
    for(i=0; i < all.length; i += 1) {
      all[i].SourceElement().parentNode.className += ' has-jax';
    }
  });
</script>

<script type="text/javascript" src="https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.1/MathJax.js?config=TeX-AMS-MML_HTMLorMML">
</script>
<!-- End: Injected MathJax -->
<!-- hexo-inject:end -->
    
</body>
</html>