<!DOCTYPE html>
<html class="has-navbar-fixed-top">
<head><meta name="generator" content="Hexo 3.9.0">
    <!-- hexo-inject:begin --><!-- hexo-inject:end --><meta charset="utf-8">
<title>我的信息方法论：原则与实践 - 萧爽楼</title>
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">

<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/outdated-browser/1.1.5/outdatedbrowser.min.css">




<meta name="description" content="我叫李家丞，现在在USTC念书。博客的内容主要包括个人的生活、读书感想，也包括数学、互联网、编程语言、人工智能等方面的学习侧记。">





    <meta name="description" content="&amp;#x6587;&amp;#x5B57;&amp;#x662F;&amp;#x4F20;&amp;#x8FBE;&amp;#x4FE1;&amp;#x606F;&amp;#x7684;&amp;#x6700;&amp;#x597D;&amp;#x8F7D;&amp;#x4F53;&amp;#xFF0C;&amp;#x6211;&amp;#x4EEC;&amp;#x9700;&amp;#x8981;&amp;#x89E3;&amp;#x6784;&amp;#x5305;&amp;#x88C5;&amp;#x4FE1;&amp;#x606F;&amp;#x7684;&amp;#x903B;">
<meta name="keywords" content="Digital Life,Reading,Individual Development,Derivative">
<meta property="og:type" content="article">
<meta property="og:title" content="我的信息方法论：原则与实践">
<meta property="og:url" content="https://blog.ddlee.cc/posts/3a6233e2/index.html">
<meta property="og:site_name" content="萧爽楼">
<meta property="og:description" content="&amp;#x6587;&amp;#x5B57;&amp;#x662F;&amp;#x4F20;&amp;#x8FBE;&amp;#x4FE1;&amp;#x606F;&amp;#x7684;&amp;#x6700;&amp;#x597D;&amp;#x8F7D;&amp;#x4F53;&amp;#xFF0C;&amp;#x6211;&amp;#x4EEC;&amp;#x9700;&amp;#x8981;&amp;#x89E3;&amp;#x6784;&amp;#x5305;&amp;#x88C5;&amp;#x4FE1;&amp;#x606F;&amp;#x7684;&amp;#x903B;">
<meta property="og:locale" content="zh-cn">
<meta property="og:updated_time" content="2020-05-16T04:12:20.292Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="我的信息方法论：原则与实践">
<meta name="twitter:description" content="&amp;#x6587;&amp;#x5B57;&amp;#x662F;&amp;#x4F20;&amp;#x8FBE;&amp;#x4FE1;&amp;#x606F;&amp;#x7684;&amp;#x6700;&amp;#x597D;&amp;#x8F7D;&amp;#x4F53;&amp;#xFF0C;&amp;#x6211;&amp;#x4EEC;&amp;#x9700;&amp;#x8981;&amp;#x89E3;&amp;#x6784;&amp;#x5305;&amp;#x88C5;&amp;#x4FE1;&amp;#x606F;&amp;#x7684;&amp;#x903B;">





<link rel="icon" href="/favicon.png">


<link rel="stylesheet" href="//fonts.googleapis.com/css?family=Ovo|Source+Code+Pro">
<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/bulma/0.6.2/css/bulma.min.css">


<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/lightgallery/1.6.8/css/lightgallery.min.css">
<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/justifiedGallery/3.6.5/css/justifiedGallery.min.css">


<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/highlight.js/9.12.0/styles/atom-one-light.min.css">

<link rel="stylesheet" href="/css/style.css">

<script defer src="//use.fontawesome.com/releases/v5.0.8/js/all.js"></script><!-- hexo-inject:begin --><!-- hexo-inject:end -->


    
    
    
    
    
    
    
    
    
    

    


</head>
<body>
    
<!-- hexo-inject:begin --><!-- hexo-inject:end --><nav class="navbar is-transparent is-fixed-top navbar-main" role="navigation" aria-label="main navigation">
    <div class="container">
        <div class="navbar-brand">
            <a class="navbar-item navbar-logo" href="/">
                
                    
                    萧爽楼
                    
                
            </a>
            <div class="navbar-burger">
                <span></span>
                <span></span>
                <span></span>
            </div>
        </div>
        
        <div class="navbar-menu navbar-start">
            
            <a class="navbar-item " href="/archives">归档</a>
            
            <a class="navbar-item " href="/gallery">图库</a>
            
            <a class="navbar-item " href="/recommendation">推荐</a>
            
            <a class="navbar-item " href="/links">友链</a>
            
            <a class="navbar-item " href="/about">关于</a>
            
        </div>
        
        <div class="navbar-menu navbar-end">
            
            <a class="navbar-item search" title="搜索" href="javascript:;">
                <i class="fas fa-search"></i>
            </a>
            
            
            
            <a class="navbar-item" title="RSS" href="/atom.xml">
                
                RSS
                
            </a>
               
            <a class="navbar-item" title="ddlee.cc" href="https://ddlee.cc">
                
                ddlee.cc
                
            </a>
               
            
        </div>
    </div>
</nav>

    <section class="section">
    <div class="container">
    <article class="article content gallery" itemscope itemprop="blogPost">
    <h1 class="article-title is-size-3 is-size-4-mobile" itemprop="name">
        
            我的信息方法论：原则与实践
        
    </h1>
    <div class="article-meta columns is-variable is-1 is-multiline is-mobile is-size-7-mobile">
        <span class="column is-narrow">
            <time datetime="2018-07-01T17:53:48.000Z" itemprop="datePublished">7月 2 2018</time>
        </span>
        
        <span class="column is-narrow article-category">
            <i class="far fa-folder"></i>
            <a class="article-category-link" href="/categories/Individual-Development/">Individual Development</a>
        </span>
        
        
        <span class="column is-narrow">
            
            
            29 分钟 读完 (约 4323 字)
        </span>
        
    </div>
    <div class="article-entry is-size-6-mobile" itemprop="articleBody">
    
        <link rel="stylesheet" type="text/css" href="https://cdn.jsdelivr.net/hint.css/2.4.1/hint.min.css"><h2 id="&#x5F15;&#x8A00;"><a href="#&#x5F15;&#x8A00;" class="headerlink" title="&#x5F15;&#x8A00;"></a>&#x5F15;&#x8A00;</h2><p>&#x5F88;&#x591A;&#x4EBA;&#x90FD;&#x8C08;&#xFF0C;&#x6211;&#x4EEC;&#x5904;&#x4E8E;&#x4E00;&#x4E2A;&#x4FE1;&#x606F;&#x8FC7;&#x8F7D;&#x7684;&#x72B6;&#x6001;&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x4EE3;&#x552F;&#x4E00;&#x7A00;&#x7F3A;&#x7684;&#x8D44;&#x6E90;&#x4FBF;&#x662F;&#x6211;&#x4EEC;&#x7684;&#x6CE8;&#x610F;&#x529B;&#x3002;&#x4F5C;&#x4E3A;&#x4E2A;&#x4EBA;&#x800C;&#x8A00;&#xFF0C;&#x5982;&#x4F55;&#x5728;&#x6570;&#x5B57;&#x65F6;&#x4EE3;&#x66F4;&#x5065;&#x58EE;&#x548C;&#x81EA;&#x4FE1;&#x5730;&#x751F;&#x6D3B;&#xFF1F;&#x6211;&#x5C06;&#x5728;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x91CC;&#x8BD5;&#x56FE;&#x68B3;&#x7406;&#x81EA;&#x5DF1;&#x5728;&#x4FE1;&#x606F;&#x7684;&#x83B7;&#x53D6;&#x548C;&#x5904;&#x7406;&#x65B9;&#x9762;&#x7684;&#x6001;&#x5EA6;&#x548C;&#x601D;&#x8003;&#xFF0C;&#x4EE5;&#x539F;&#x5219;&#x548C;&#x5B9E;&#x8DF5;&#x5206;&#x522B;&#x53D9;&#x8FF0;&#x51FA;&#x6765;&#x3002;</p>
<h2 id="&#x539F;&#x5219;"><a href="#&#x539F;&#x5219;" class="headerlink" title="&#x539F;&#x5219;"></a>&#x539F;&#x5219;</h2><h3 id="&#x6A21;&#x578B;"><a href="#&#x6A21;&#x578B;" class="headerlink" title="&#x6A21;&#x578B;"></a>&#x6A21;&#x578B;</h3><p><strong>&#x4FE1;&#x606F;+&#x4FE1;&#x606F;&#x6240;&#x4F9D;&#x6258;&#x7684;&#x5F62;&#x5F0F;&#x2014;&gt;&#x6E20;&#x9053;&#x2014;&gt;&#x63A5;&#x6536;&#x8005;&#x2014;&gt;&#x5BF9;&#x63A5;&#x6536;&#x8005;&#x4EA7;&#x751F;&#x5F71;&#x54CD;</strong></p>
<p>&#x4E0A;&#x9762;&#x7684;&#x903B;&#x8F91;&#x7C97;&#x7EBF;&#x6761;&#x5730;&#x63CF;&#x7ED8;&#x4E86;&#x6211;&#x6240;&#x7406;&#x89E3;&#x7684;&#x4FE1;&#x606F;&#x4EF7;&#x503C;Pipeline&#xFF0C;&#x5176;&#x4E2D;&#x6709;&#x4E09;&#x4E2A;&#x5173;&#x952E;&#x70B9;&#xFF1A;</p>
<ol>
<li><p><strong>&#x4FE1;&#x606F;&#x4E0D;&#x4EC5;&#x5305;&#x62EC;&#x5185;&#x5BB9;&#xFF0C;&#x8FD8;&#x5305;&#x62EC;&#x6765;&#x6E90;&#x3002;</strong>&#x5C31;&#x6211;&#x5BF9;&#x81EA;&#x5DF1;&#x7684;&#x601D;&#x7EF4;&#x65B9;&#x5F0F;&#x7684;&#x89C2;&#x5BDF;&#x6765;&#x770B;&#xFF0C;&#x6211;&#x6709;&#x9AD8;&#x5EA6;&#x4F9D;&#x8D56;&#x5148;&#x9A8C;&#x7684;&#x4E60;&#x60EF;&#x3002;&#x5728;&#x5BF9;&#x4E00;&#x6761;&#x4FE1;&#x606F;&#x7684;&#x5185;&#x5BB9;&#x505A;&#x51FA;&#x5904;&#x7406;&#x65F6;&#xFF0C;&#x4EE5;&#x6765;&#x6E90;&#x4E3A;&#x4EE3;&#x8868;&#x7684;&#x8F85;&#x52A9;&#x4FE1;&#x606F;&#x5C31;&#x81F3;&#x5173;&#x91CD;&#x8981;&#xFF0C;&#x5B83;&#x4EEC;&#x662F;&#x6211;&#x5728;&#x5BF9;&#x5185;&#x5BB9;&#x505A;&#x51FA;&#x5224;&#x65AD;&#x4E4B;&#x524D;&#x7684;&#x4F18;&#x5148;&#x5904;&#x7406;&#x7684;&#x5BF9;&#x8C61;&#x3002;&#x6211;&#x4EEC;&#x5BF9;&#x4FE1;&#x606F;&#x7684;&#x8981;&#x6C42;&#x5E94;&#x8BE5;&#x662F;&#x4E25;&#x82DB;&#x7684;&#xFF1A;&#x6211;&#x4EEC;&#x8FDC;&#x4E0D;&#x5E94;&#x6B62;&#x4E8E;&#x8BFB;&#x51FA;&#x6784;&#x6210;&#x8BED;&#x4E49;&#x7684;&#x90E8;&#x5206;&#xFF0C;&#x5BF9;&#x8FD9;&#x90E8;&#x5206;&#x8BED;&#x4E49;&#x6765;&#x6E90;&#x7684;&#x8003;&#x5BDF;&#xFF0C;&#x652F;&#x6491;&#x5176;&#x8BED;&#x4E49;&#x6210;&#x7ACB;&#x7684;&#x5176;&#x4ED6;&#x4FE1;&#x606F;&#x7B49;&#x7B49;&#xFF0C;&#x90FD;&#x662F;&#x5FC5;&#x987B;&#x8981;&#x8BA4;&#x771F;&#x5904;&#x7406;&#x7684;&#x90E8;&#x5206;&#x3002;&#x4E3E;&#x4F8B;&#x6765;&#x8BB2;&#xFF0C;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x63D0;&#x4F9B;&#x4E0B;&#x8F7D;&#x6587;&#x4EF6;&#x7684;&#x8FDE;&#x63A5;&#x65C1;&#x90FD;&#x5E94;&#x8BE5;&#x9644;&#x52A0;&#x5176;&#x67D0;&#x79CD;&#x7F16;&#x7801;&#xFF08;&#x5982;MD5)&#xFF0C;&#x6765;&#x65B9;&#x4FBF;&#x9A8C;&#x8BC1;&#x8FD9;&#x4E00;&#x6587;&#x4EF6;&#x7684;&#x6765;&#x6E90;&#x3002;</p>
</li>
<li><p><strong>&#x6240;&#x4F7F;&#x7528;&#x7684;&#x5DE5;&#x5177;&#x5E94;&#x8BE5;&#x8F85;&#x52A9;&#x6211;&#x9009;&#x62E9;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x66FF;&#x6211;&#x9009;&#x62E9;&#x3002;</strong>&#x8FD9;&#x91CC;&#x201C;&#x8F85;&#x52A9;&#x201D;&#x7684;&#x8FB9;&#x754C;&#x6709;&#x5FC5;&#x8981;&#x4F5C;&#x8FDB;&#x4E00;&#x6B65;&#x7684;&#x89E3;&#x91CA;&#xFF0C;&#x4E00;&#x822C;&#x6765;&#x8BB2;&#xFF0C;&#x6211;&#x4EC5;&#x4EC5;&#x8981;&#x6C42;&#x5DE5;&#x5177;&#x5E2E;&#x6211;&#x63D0;&#x4F9B;&#x7B5B;&#x9009;&#x4FE1;&#x606F;&#x7684;&#x754C;&#x9762;&#xFF0C;&#x4F46;&#x6211;&#x4E5F;&#x5BF9;&#x76F8;&#x5BF9;&#x51C6;&#x786E;&#x7684;&#x90E8;&#x5206;&#x4E2A;&#x6027;&#x5316;&#x63A8;&#x8350;&#x5F15;&#x64CE;&#x4FDD;&#x6301;&#x5BB9;&#x5FCD;&#x3002;&#x6211;&#x62B5;&#x5236;&#x201C;&#x70ED;&#x95E8;&#x201D;&#x5F0F;&#x7684;&#x5927;&#x4F17;&#x5316;&#x63A8;&#x8350;&#x3002;&#x4ECE;&#x8FD9;&#x4E00;&#x70B9;&#x4E0A;&#x8BB2;&#xFF0C;&#x6211;&#x5BF9;&#x5DE5;&#x5177;&#x63D0;&#x4F9B;&#x7684;&#x63A5;&#x53E3;&#x6C34;&#x5E73;&#x4FDD;&#x6301;&#x9AD8;&#x5EA6;&#x7684;&#x654F;&#x611F;&#xFF0C;&#x6211;&#x5E38;&#x5E38;&#x4F1A;&#x6CE8;&#x610F;&#x67D0;&#x9879;&#x5DE5;&#x5177;&#x548C;&#x670D;&#x52A1;&#x66FF;&#x6211;&#x505A;&#x51FA;&#x4E86;&#x54EA;&#x4E9B;&#x9009;&#x62E9;&#x3002;</p>
</li>
<li><p><strong>&#x4FE1;&#x606F;&#x5728;&#x88AB;&#x5E94;&#x7528;&#x4E4B;&#x540E;&#x624D;&#x4EA7;&#x751F;&#x4EF7;&#x503C;&#x3002;</strong>&#x8FD9;&#x91CC;&#x7684;&#x201C;&#x4EF7;&#x503C;&#x201D;&#x662F;&#x6307;&#x9488;&#x5BF9;&#x4E2A;&#x4EBA;&#x7684;&#x53D1;&#x5C55;&#x6765;&#x8BB2;&#xFF0C;&#x800C;&#x975E;&#x901A;&#x8FC7;&#x5012;&#x5356;&#x4FE1;&#x606F;&#x7B49;&#x83B7;&#x5F97;&#x7684;&#x7ECF;&#x6D4E;&#x5229;&#x76CA;&#x3002;&#x4FE1;&#x606F;&#x901A;&#x8FC7;&#x4E2A;&#x4EBA;&#x7684;&#x9A8C;&#x8BC1;&#x3001;&#x5904;&#x7406;&#x3001;&#x5E94;&#x7528;&#x540E;&#xFF0C;&#x6784;&#x6210;&#x4E2A;&#x4EBA;&#x89C2;&#x5FF5;&#x6216;&#x77E5;&#x8BC6;&#x4F53;&#x7CFB;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x5E76;&#x5728;&#x4E4B;&#x540E;&#x4E2A;&#x4EBA;&#x7684;&#x5DE5;&#x4F5C;&#x3001;&#x51B3;&#x7B56;&#x7B49;&#x6D3B;&#x52A8;&#x4E2D;&#x8D77;&#x5230;&#x5E2E;&#x52A9;&#x4F5C;&#x7528;&#xFF0C;&#x8FD9;&#x662F;&#x6211;&#x5BF9;&#x4FE1;&#x606F;&#x5BF9;&#x4E2A;&#x4EBA;&#x4EA7;&#x751F;&#x4EF7;&#x503C;&#x7684;&#x57FA;&#x672C;&#x903B;&#x8F91;&#x3002;&#x5728;&#x65E0;&#x6CD5;&#x5C06;&#x4FE1;&#x606F;&#x53CA;&#x65F6;&#x5E94;&#x7528;&#x65F6;&#xFF0C;&#x8BA9;&#x4FE1;&#x606F;&#x53C2;&#x4E0E;&#x81EA;&#x5DF1;&#x7684;&#x601D;&#x7EF4;&#x6D3B;&#x52A8;&#x5982;&#x5199;&#x4F5C;&#xFF0C;&#x662F;&#x6700;&#x6709;&#x6548;&#x7684;&#x5904;&#x7406;&#x65B9;&#x5F0F;&#x3002;</p>
</li>
</ol>
<h3 id="&#x201C;&#x5305;&#x88C5;&#x201D;&#xFF1A;&#x7B5B;&#x9009;&#x4FE1;&#x606F;&#x7684;&#x4F9D;&#x636E;"><a href="#&#x201C;&#x5305;&#x88C5;&#x201D;&#xFF1A;&#x7B5B;&#x9009;&#x4FE1;&#x606F;&#x7684;&#x4F9D;&#x636E;" class="headerlink" title="&#x201C;&#x5305;&#x88C5;&#x201D;&#xFF1A;&#x7B5B;&#x9009;&#x4FE1;&#x606F;&#x7684;&#x4F9D;&#x636E;"></a>&#x201C;&#x5305;&#x88C5;&#x201D;&#xFF1A;&#x7B5B;&#x9009;&#x4FE1;&#x606F;&#x7684;&#x4F9D;&#x636E;</h3><p>&#x5305;&#x88C5;&#x8FD9;&#x4E2A;&#x8BCD;&#x5176;&#x5B9E;&#x6709;&#x4E9B;&#x7B3C;&#x7EDF;&#x3002;&#x6211;&#x6240;&#x6307;&#x662F;&#x4FE1;&#x606F;&#x5728;&#x88AB;&#x7406;&#x89E3;&#x4E3A;&#x5B9E;&#x9645;&#x8BED;&#x4E49;&#x524D;&#x88AB;&#x9644;&#x52A0;&#x7684;&#x90E8;&#x5206;&#xFF0C;&#x4E5F;&#x662F;&#x6211;&#x4EEC;&#x7684;&#x8BED;&#x8A00;&#x7CFB;&#x7EDF;&#x6240;&#x89E3;&#x6784;&#x7684;&#x90E8;&#x5206;&#x3002;&#x66F4;&#x5177;&#x4F53;&#x5730;&#xFF0C;&#x8FD9;&#x5219;&#x4FE1;&#x606F;&#x6240;&#x4F7F;&#x7528;&#x7684;&#x8868;&#x8FBE;&#x65B9;&#x5F0F;&#x3001;&#x8BED;&#x6C14;&#x60C5;&#x611F;&#x3001;&#x8BBA;&#x8BC1;&#x65B9;&#x5F0F;&#x4E0E;&#x903B;&#x8F91;&#x94FE;&#x6761;&#x7B49;&#x7B49;&#x3002;&#x89E3;&#x6784;&#x8FD9;&#x4E9B;&#x5305;&#x88C5;&#x662F;&#x6211;&#x4EEC;&#x7684;&#x8BED;&#x8A00;&#x7CFB;&#x7EDF;&#x81EA;&#x52A8;&#x5B8C;&#x6210;&#x7684;&#xFF0C;&#x800C;&#x5B83;&#x4EEC;&#x5BF9;&#x7CBE;&#x51C6;&#x7406;&#x89E3;&#x4FE1;&#x606F;&#x6240;&#x8868;&#x8FBE;&#x7684;&#x8BED;&#x4E49;&#x53C8;&#x76F8;&#x5F53;&#x91CD;&#x8981;&#xFF0C;&#x751A;&#x81F3;&#x4F1A;&#x5F71;&#x54CD;&#x6211;&#x4EEC;&#x5BF9;&#x5B9E;&#x9645;&#x8BED;&#x4E49;&#x7684;&#x5224;&#x65AD;&#x3002;&#x8FDC;&#x5982;&#x53E4;&#x8BD7;&#x6587;&#x7684;&#x4FEE;&#x8F9E;&#x3001;&#x8FD1;&#x5982;&#x4FE1;&#x606F;&#x4F20;&#x9012;&#x4EBA;&#x7684;&#x8868;&#x60C5;&#x7B49;&#xFF0C;&#x90FD;&#x5728;&#x5F71;&#x54CD;&#x7740;&#x6211;&#x4EEC;&#x7406;&#x89E3;&#x4FE1;&#x606F;&#x7684;&#x8FC7;&#x7A0B;&#x3002;</p>
<p>&#x56E0;&#x800C;&#xFF0C;&#x5BF9;&#x4FE1;&#x606F;&#x201C;&#x5305;&#x88C5;&#x201D;&#x7684;&#x5224;&#x65AD;&#x662F;&#x7B5B;&#x9009;&#x4FE1;&#x606F;&#x7684;&#x5173;&#x952E;&#x4E4B;&#x4E00;&#x3002;&#x5C31;&#x6211;&#x4E2A;&#x4EBA;&#x800C;&#x8A00;&#xFF0C;&#x60C5;&#x7EEA;&#x5316;&#x3001;&#x4FEE;&#x8F9E;/&#x4FEE;&#x9970;&#x8BED;&#x6EE5;&#x7528;&#x3001;&#x5224;&#x65AD;&#x591A;&#x4E8E;&#x8BBA;&#x8BC1;&#x7B49;&#x73B0;&#x8C61;&#x5E38;&#x5E38;&#x662F;&#x6211;&#x4E3B;&#x52A8;&#x5C4F;&#x853D;&#x5F88;&#x591A;&#x4FE1;&#x606F;&#x53CA;&#x5176;&#x6765;&#x6E90;&#x7684;&#x4F9D;&#x636E;&#xFF0C;&#x800C;&#x4E0D;&#x5E78;&#x7684;&#x662F;&#xFF0C;&#x5C31;&#x6211;&#x7684;&#x89C2;&#x5BDF;&#xFF0C;&#x5927;&#x90E8;&#x5206;&#x4FE1;&#x606F;&#x90FD;&#x5B58;&#x5728;&#x8FD9;&#x4E9B;&#x5F0A;&#x75C5;&#x3002;</p>
<h3 id="&#x5A92;&#x4ECB;&#xFF1A;&#x4FE1;&#x606F;&#x8FD8;&#x662F;&#x4F53;&#x9A8C;"><a href="#&#x5A92;&#x4ECB;&#xFF1A;&#x4FE1;&#x606F;&#x8FD8;&#x662F;&#x4F53;&#x9A8C;" class="headerlink" title="&#x5A92;&#x4ECB;&#xFF1A;&#x4FE1;&#x606F;&#x8FD8;&#x662F;&#x4F53;&#x9A8C;"></a>&#x5A92;&#x4ECB;&#xFF1A;&#x4FE1;&#x606F;&#x8FD8;&#x662F;&#x4F53;&#x9A8C;</h3><p>&#x9A6C;&#x514B;&#x5362;&#x6C49;&#x6709;&#x4E2A;&#x8457;&#x540D;&#x7684;&#x8BBA;&#x65AD;&#xFF1A;&#x5A92;&#x4ECB;&#x5373;&#x4FE1;&#x606F;&#x3002;&#x4FE1;&#x606F;&#x672C;&#x8EAB;&#x4F9D;&#x6258;&#x5A92;&#x4ECB;&#x5B58;&#x5728;&#x548C;&#x4F20;&#x64AD;&#xFF0C;&#x800C;&#x5B83;&#x672C;&#x8EAB;&#x4E5F;&#x88AB;&#x5A92;&#x4ECB;&#x6240;&#x5851;&#x9020;&#x548C;&#x7B5B;&#x9009;&#x7740;&#x3002;</p>
<p>&#x7EB5;&#x89C2;&#x6211;&#x4EEC;&#x7684;&#x6587;&#x660E;&#x53F2;&#xFF0C;&#x8BED;&#x8A00;&#x7684;&#x4EA7;&#x751F;&#x65E0;&#x7591;&#x662F;&#x63A8;&#x52A8;&#x4EBA;&#x7C7B;&#x6587;&#x660E;&#x8FDB;&#x5165;&#x9AD8;&#x901F;&#x53D1;&#x5C55;&#x7684;&#x5173;&#x952E;&#x4E8B;&#x4EF6;&#xFF0C;&#x518D;&#x81F3;&#xFF0C;&#x5370;&#x5237;&#x672F;&#x7684;&#x53D1;&#x660E;&#x548C;&#x63A8;&#x5E7F;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x7684;&#x6587;&#x660E;&#x4FE1;&#x606F;&#x627E;&#x5230;&#x4E86;DNA&#x4E4B;&#x5916;&#x66F4;&#x52A0;&#x5EC9;&#x4EF7;&#x548C;&#x65B9;&#x4FBF;&#x7684;&#x4F20;&#x627F;&#x65B9;&#x5F0F;&#x3002;&#x4ECE;&#x8FDB;&#x5316;&#x7684;&#x89D2;&#x5EA6;&#x770B;&#xFF0C;&#x6587;&#x5B57;&#xFF0C;&#x662F;&#x6700;&#x53E4;&#x8001;&#x4E5F;&#x662F;&#x6211;&#x4EEC;&#x7684;&#x8BED;&#x8A00;&#x7CFB;&#x7EDF;&#x6700;&#x5148;&#x9002;&#x5E94;&#x7684;&#x5A92;&#x4ECB;&#x5F62;&#x5F0F;&#x3002;</p>
<p>&#x6211;&#x66FE;&#x5728;&#x81EA;&#x5DF1;&#x7684;&#x8427;&#x723D;&#x697C;&#x535A;&#x5BA2;&#x7684;<a href="https://blog.ddlee.cn/About/ver-2016.html" target="_blank" rel="noopener">&#x5173;&#x4E8E;&#x9875;&#x9762;</a>&#x8FD9;&#x6837;&#x8D5E;&#x7F8E;&#x6587;&#x5B57;&#xFF1A;</p>
<blockquote>
<p>&#x6587;&#x5B57;&#x592A;&#x6A21;&#x7CCA;&#x4E86;&#xFF0C;&#x4E0D;&#x8DB3;&#x4EE5;&#x8BA9;&#x4F60;&#x8BB0;&#x8D77;&#x5168;&#x90E8;&#x7684;&#x7EC6;&#x8282;&#xFF0C;&#x4F60;&#x53EA;&#x597D;&#x4EB2;&#x81EA;&#x8D70;&#x56DE;&#x53BB;&#xFF0C;&#x56DE;&#x5230;&#x9752;&#x8471;&#x7684;&#x5C81;&#x6708;&#xFF0C;&#x50CF;&#x770B;&#x6545;&#x4E8B;&#x91CC;&#x7684;&#x4EBA;&#x7269;&#x90A3;&#x6837;&#x770B;&#x770B;&#x90A3;&#x65F6;&#x7684;&#x81EA;&#x5DF1;&#xFF1B;</p>
<p>&#x6587;&#x5B57;&#x53C8;&#x592A;&#x51C6;&#x786E;&#x4E86;&#xFF0C;&#x8FD9;&#x4E9B;&#x964C;&#x751F;&#x53C8;&#x719F;&#x6089;&#x7684;&#x5B57;&#x773C;&#xFF0C;&#x8FD9;&#x4E9B;&#x4EB2;&#x5207;&#x53C8;&#x65E9;&#x5DF2;&#x5FD8;&#x5374;&#x7684;&#x53E5;&#x5B50;&#xFF0C;&#x5C31;&#x50CF;&#x5F53;&#x5E74;&#x7684;&#x81EA;&#x5DF1;&#x628A;&#x6545;&#x4E8B;&#x4EB2;&#x53E3;&#x54FC;&#x5531;&#x7ED9;&#x4F60;&#x542C;&#xFF0C;&#x6B64;&#x65F6;&#x6B64;&#x523B;&#xFF0C;&#x6070;&#x5982;&#x5F7C;&#x65F6;&#x5F7C;&#x523B;&#x3002;</p>
<p>&#x6587;&#x5B57;&#x8106;&#x5F31;&#xFF0C;&#x5374;&#x53C8;&#x529B;&#x91CF;&#x65E0;&#x7A77;&#x3002;</p>
</blockquote>
<p>&#x7528;&#x6587;&#x5B57;&#x8868;&#x8FBE;&#x548C;&#x7406;&#x89E3;&#x6587;&#x5B57;&#x7684;&#x8FC7;&#x7A0B;&#x662F;&#x8981;&#x6C42;&#x5927;&#x8111;&#x7684;&#x8BED;&#x8A00;&#x7CFB;&#x7EDF;&#x5145;&#x5206;&#x53C2;&#x4E0E;&#x7684;&#xFF0C;&#x800C;&#x8FD9;&#x4E5F;&#x662F;&#x5851;&#x9020;&#x6211;&#x4EEC;&#x81EA;&#x5DF1;&#x601D;&#x8003;&#x65B9;&#x5F0F;&#x548C;&#x601D;&#x7EF4;&#x4E60;&#x60EF;&#x7684;&#x91CD;&#x8981;&#x65F6;&#x523B;&#x3002;&#x76F8;&#x6BD4;&#x540E;&#x9762;&#x8981;&#x8C08;&#x5230;&#x7684;&#x5A92;&#x4ECB;&#xFF0C;&#x6587;&#x5B57;&#x662F;&#x6700;&#x201C;&#x7D2F;&#x201D;&#x7684;&#xFF0C;&#x4F46;&#x5374;&#x662F;&#x6700;&#x6709;&#x8D28;&#x91CF;&#x7684;&#x3002;</p>
<p>&#x8FD1;&#x4EE3;&#x4EE5;&#x6765;&#xFF0C;&#x591A;&#x5A92;&#x4F53;&#x6280;&#x672F;&#x7684;&#x53D1;&#x5C55;&#x8BA9;&#x6211;&#x4EEC;&#x6709;&#x673A;&#x4F1A;&#x901A;&#x8FC7;&#x66F4;&#x8D34;&#x8FD1;&#x611F;&#x5B98;&#x7684;&#x65B9;&#x5F0F;&#x7406;&#x89E3;&#x548C;&#x4F20;&#x8FBE;&#x4FE1;&#x606F;&#x3002;&#x4F46;&#x9700;&#x8981;&#x5F15;&#x8D77;&#x6CE8;&#x610F;&#x7684;&#x5730;&#x65B9;&#x662F;&#xFF0C;&#x4FE1;&#x606F;&#x7684;&#x5185;&#x6DB5;&#x88AB;&#x6269;&#x5C55;&#x4E86;&#xFF1A;&#x5B83;&#x6709;&#x65F6;&#x9000;&#x5316;&#x6210;&#x4E86;&#x5E76;&#x4E0D;&#x9700;&#x8981;&#x8BED;&#x8A00;&#x7CFB;&#x7EDF;&#x53C2;&#x4E0E;&#x7684;&#x7EAF;&#x7CB9;&#x7684;&#x4F53;&#x9A8C;&#x3002;</p>
<p>&#x4ECE;&#x8FFD;&#x6C42;&#x7279;&#x6548;&#x548C;&#x89C6;&#x89C9;&#x9707;&#x64BC;&#x6548;&#x679C;&#x7684;&#x597D;&#x83B1;&#x575E;&#x7535;&#x5F71;&#x548C;&#x77ED;&#x5C0F;&#x3001;&#x9AD8;&#x91CD;&#x590D;&#x7684;&#x89C6;&#x9891;&#x6D41;&#xFF0C;&#x8FD9;&#x4E9B;&#x5A92;&#x4ECB;&#x5728;&#x4E8B;&#x5B9E;&#x4E0A;&#x5265;&#x79BB;&#x4E86;&#x4FE1;&#x606F;&#x672C;&#x8EAB;&#xFF0C;&#x5B83;&#x4EEC;&#x4EC5;&#x4EC5;&#x5728;&#x4F20;&#x8FBE;&#x4E00;&#x79CD;&#x53EF;&#x4EE5;&#x8BA9;&#x4F60;&#x8F7B;&#x6613;&#x89E6;&#x8FBE;&#x7684;&#x4F53;&#x9A8C;&#x3002;&#x5728;&#x6211;&#x770B;&#x6765;&#xFF0C;&#x6709;&#x8FD9;&#x4E9B;&#x7279;&#x5F81;&#x7684;&#x5A92;&#x4ECB;&#x5E94;&#x5F53;&#x5F15;&#x8D77;&#x8B66;&#x60D5;&#xFF0C;&#x5B83;&#x4EEC;&#x5E76;&#x4E0D;&#x662F;&#x5728;&#x4F20;&#x9012;&#x548C;&#x8BB0;&#x8F7D;&#x4FE1;&#x606F;&#xFF0C;&#x90A3;&#x4E9B;&#x53EA;&#x662F;&#x4F53;&#x9A8C;&#x800C;&#x5DF2;&#x3002;</p>
<p><strong>&#x4E60;&#x60EF;&#x63A5;&#x6536;&#x548C;&#x5904;&#x7406;&#x4F53;&#x9A8C;&#x800C;&#x975E;&#x4FE1;&#x606F;&#x4F1A;&#x9020;&#x6210;&#x61D2;&#x60F0;&#xFF0C;&#x4E5F;&#x4F1A;&#x8BA9;&#x6211;&#x4EEC;&#x4E0D;&#x81EA;&#x89C9;&#x5730;&#x7B80;&#x5316;&#x539F;&#x672C;&#x9700;&#x8981;&#x590D;&#x6742;&#x8868;&#x8FBE;&#x548C;&#x7CBE;&#x786E;&#x8868;&#x8FF0;&#x7684;&#x60C5;&#x611F;&#x548C;&#x8BED;&#x4E49;&#x3002;</strong></p>
<p>&#x4E3E;&#x4F8B;&#x6765;&#x8BF4;&#xFF0C;&#x6211;&#x51E0;&#x4E4E;&#x4E0D;&#x7528;EMOJI&#x4E4B;&#x5916;&#x7684;&#x4EFB;&#x4F55;&#x8868;&#x60C5;&#x56FE;&#x7247;&#xFF0C;&#x6211;&#x4F1A;&#x5C3D;&#x529B;&#x7528;&#x8BED;&#x8A00;&#x6587;&#x5B57;&#x6765;&#x8FDB;&#x884C;&#x8868;&#x8FBE;&#x3002;&#x5728;&#x771F;&#x6B63;&#x8981;&#x63CF;&#x8FF0;&#x81EA;&#x5DF1;&#x7684;&#x611F;&#x53D7;&#x65F6;&#xFF0C;&#x5982;&#x679C;&#x7B2C;&#x4E00;&#x65F6;&#x95F4;&#x60F3;&#x5230;&#x7684;&#x662F;&#x718A;&#x732B;&#x4EBA;&#x7684;&#x90C1;&#x95F7;&#x8138;&#xFF0C;&#x5BF9;&#x6211;&#x662F;&#x83AB;&#x5927;&#x7684;&#x60B2;&#x54C0;&#x3002;&#x9057;&#x61BE;&#x7684;&#x662F;&#xFF0C;&#x8FD9;&#x4E9B;&#x8868;&#x60C5;&#x6B63;&#x8695;&#x98DF;&#x7740;&#x6211;&#x4EEC;&#x7684;&#x804A;&#x5929;&#x751A;&#x81F3;&#x9605;&#x8BFB;&#x73AF;&#x5883;&#xFF0C;&#x5B83;&#x4EEC;&#x6240;&#x4F20;&#x8FBE;&#x7684;&#x4F53;&#x9A8C;&#x6B63;&#x66FF;&#x4EE3;&#x7740;&#x672C;&#x5E94;&#x7531;&#x8BED;&#x8A00;&#x53D1;&#x6325;&#x7684;&#x4FE1;&#x606F;&#x8868;&#x8FBE;&#x529F;&#x80FD;&#x3002;</p>
<p>&#x66F4;&#x4EE4;&#x4EBA;&#x75DB;&#x5FC3;&#x7684;&#x662F;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x6559;&#x80B2;&#x7CFB;&#x7EDF;&#x5E76;&#x6CA1;&#x6709;&#x5728;&#x8BED;&#x8A00;&#x7684;&#x8868;&#x8FBE;&#x80FD;&#x529B;&#x65B9;&#x9762;&#x7ED9;&#x4E88;&#x5B66;&#x751F;&#x5065;&#x5EB7;&#x7684;&#x6307;&#x5BFC;&#xFF0C;&#x800C;&#x4E14;&#x5C31;&#x4ECA;&#x5E74;&#x7684;&#x9AD8;&#x8003;&#x4F5C;&#x6587;&#x9898;&#x76EE;&#x770B;&#xFF0C;&#x4F5C;&#x6587;&#x7ADF;&#x7136;&#x88AB;&#x8FEB;&#x8FD8;&#x8981;&#x627F;&#x62C5;&#x4E00;&#x90E8;&#x5206;&#x653F;&#x6CBB;&#x6559;&#x5316;&#x7684;&#x529F;&#x80FD;&#x3002;</p>
<h3 id="&#x4F5C;&#x4E3A;&#x63A5;&#x6536;&#x8005;&#x7684;&#x4EA4;&#x4E92;&#xFF0C;&#x6E20;&#x9053;&#x4E4B;&#x89D2;&#x8272;"><a href="#&#x4F5C;&#x4E3A;&#x63A5;&#x6536;&#x8005;&#x7684;&#x4EA4;&#x4E92;&#xFF0C;&#x6E20;&#x9053;&#x4E4B;&#x89D2;&#x8272;" class="headerlink" title="&#x4F5C;&#x4E3A;&#x63A5;&#x6536;&#x8005;&#x7684;&#x4EA4;&#x4E92;&#xFF0C;&#x6E20;&#x9053;&#x4E4B;&#x89D2;&#x8272;"></a>&#x4F5C;&#x4E3A;&#x63A5;&#x6536;&#x8005;&#x7684;&#x4EA4;&#x4E92;&#xFF0C;&#x6E20;&#x9053;&#x4E4B;&#x89D2;&#x8272;</h3><p>&#x5728;&#x4FE1;&#x606F;&#x7684;&#x521B;&#x9020;&#x8005;&#x548C;&#x63A5;&#x53D7;&#x8005;&#x4E4B;&#x95F4;&#xFF0C;&#x4FE1;&#x606F;&#x672C;&#x6765;&#x662F;&#x4E00;&#x6B21;&#x6027;&#x7684;&#x4F20;&#x9012;&#x3002;&#x5468;&#x671F;&#x6027;&#x7684;&#x53D1;&#x9001;&#x548C;&#x63A5;&#x53D7;&#xFF0C;&#x5219;&#x6784;&#x6210;&#x4E86;&#x4FE1;&#x606F;&#x5206;&#x53D1;&#x7684;&#x6700;&#x539F;&#x59CB;&#x6A21;&#x5F0F;&#xFF1A;&#x8BA2;&#x9605;&#x3002;</p>
<p>&#x5BF9;&#x63A5;&#x53D7;&#x8005;&#x800C;&#x8A00;&#xFF0C;&#x8BA2;&#x9605;&#x662F;&#x5176;&#x628A;&#x63A7;&#x7684;&#x4E3B;&#x52A8;&#x9009;&#x62E9;&#x3002;&#x62A5;&#x7EB8;&#x3001;&#x6742;&#x5FD7;&#x662F;&#x8BA2;&#x9605;&#x6A21;&#x5F0F;&#x8F83;&#x65E9;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x5728;&#x8FD9;&#x4E9B;&#x5A92;&#x4ECB;&#x4E0B;&#xFF0C;&#x4FE1;&#x606F;&#x7684;&#x521B;&#x9020;&#x8005;&#xFF08;&#x62A5;&#x793E;&#xFF09;&#x81EA;&#x5DF1;&#x63A7;&#x5236;&#x5206;&#x53D1;&#x7684;&#x6E20;&#x9053;&#xFF0C;&#x521B;&#x9020;&#x8005;&#x548C;&#x63A5;&#x6536;&#x8005;&#x4E4B;&#x95F4;&#x5F62;&#x6210;&#x7B80;&#x5355;&#x7684;&#x4E8C;&#x5143;&#x56FE;&#x5173;&#x7CFB;&#x3002;</p>
<p>&#x800C;&#x5F53;&#x4F20;&#x64AD;&#x548C;&#x63A5;&#x53D7;&#x7684;&#x9700;&#x6C42;&#x9010;&#x6E10;&#x6269;&#x5927;&#x65F6;&#xFF0C;&#x4E8C;&#x5143;&#x56FE;&#x6A21;&#x578B;&#x7EF4;&#x6301;&#x8FD9;&#x6837;&#x5E9E;&#x5927;&#x548C;&#x89C4;&#x6A21;&#x5316;&#x7684;&#x5206;&#x53D1;&#x4EFB;&#x52A1;&#x7684;&#x5F0A;&#x7AEF;&#x5C31;&#x663E;&#x73B0;&#x51FA;&#x6765;&#x3002;&#x8FD9;&#x65F6;&#xFF0C;&#x6E20;&#x9053;&#xFF0C;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x72EC;&#x7ACB;&#x7684;&#x4FE1;&#x606F;&#x4F20;&#x9012;&#x8282;&#x70B9;&#xFF0C;&#x5F00;&#x59CB;&#x5728;&#x4FE1;&#x606F;&#x7684;&#x4EA7;&#x751F;&#x548C;&#x63A5;&#x6536;&#x4E24;&#x7AEF;&#x8D77;&#x5230;&#x6807;&#x51C6;&#x5316;&#x548C;&#x6574;&#x5408;&#x7684;&#x4F5C;&#x7528;&#x3002;&#x8FD9;&#x4E00;&#x70B9;&#xFF0C;&#x6620;&#x5C04;&#x5230;&#x5546;&#x54C1;&#x5E02;&#x573A;&#x4E0A;&#xFF0C;&#x5C31;&#x662F;&#x8D85;&#x5E02;&#x7684;&#x4EA7;&#x751F;&#xFF1A;&#x987E;&#x5BA2;&#x65E0;&#x9700;&#x53BB;&#x4E0D;&#x540C;&#x54C1;&#x7C7B;&#x7684;&#x5546;&#x5E97;&#x5206;&#x522B;&#x8D2D;&#x4E70;&#x5546;&#x54C1;&#xFF0C;&#x800C;&#x662F;&#x4E0E;&#x4F5C;&#x4E3A;&#x4E2D;&#x95F4;&#x5546;&#x7684;&#x8D85;&#x5E02;&#x4EA4;&#x4E92;&#x3002;</p>
<p>&#x5728;&#x4E92;&#x8054;&#x7F51;&#x9886;&#x57DF;&#xFF0C;&#x641C;&#x7D22;&#x5F15;&#x64CE;&#x9010;&#x6E10;&#x4EE3;&#x66FF;&#x95E8;&#x6237;&#x7F51;&#x7AD9;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x6210;&#x4E3A;&#x4E92;&#x8054;&#x7F51;&#x8FD9;&#x4E00;&#x5A92;&#x4ECB;&#x6240;&#x627F;&#x8F7D;&#x548C;&#x4F20;&#x64AD;&#x4FE1;&#x606F;&#x7684;&#x6574;&#x5408;&#x8005;&#xFF0C;&#x800C;&#x5728;&#x6574;&#x5408;&#x8FC7;&#x7A0B;&#x4E2D;&#x52A0;&#x5165;&#x6709;&#x76EE;&#x7684;&#x7684;&#x4FE1;&#x606F;&#x2014;&#x2014;&#x5E7F;&#x544A;&#xFF0C;&#x5C31;&#x5F62;&#x6210;&#x4E86;&#x641C;&#x7D22;&#x5F15;&#x64CE;&#x516C;&#x53F8;&#x7684;&#x5546;&#x4E1A;&#x6A21;&#x578B;&#x3002;</p>
<p>&#x968F;&#x7740;&#x6E20;&#x9053;&#x4F5C;&#x4E3A;&#x6574;&#x5408;&#x8005;&#x89D2;&#x8272;&#x7684;&#x52A0;&#x5165;&#xFF0C;&#x5BF9;&#x4FE1;&#x606F;&#x7684;&#x63A5;&#x6536;&#x8005;&#x6765;&#x8BF4;&#xFF0C;&#x63A8;&#x8350;&#x6210;&#x4E3A;&#x4E86;&#x4E00;&#x79CD;&#x65B0;&#x7684;&#x4FE1;&#x606F;&#x5206;&#x53D1;&#x6A21;&#x5F0F;&#xFF0C;&#x4E0E;&#x8BA2;&#x9605;&#x7684;&#x4E8C;&#x5143;&#x5316;&#x9009;&#x62E9;&#x76F8;&#x6BD4;&#xFF0C;&#x63A8;&#x8350;&#x63D0;&#x4F9B;&#x4E86;&#x66F4;&#x591A;&#x7684;&#x7075;&#x6D3B;&#x6027;&#xFF0C;&#x4E5F;&#x4F7F;&#x5F97;&#x4EA4;&#x4E92;&#x8FC7;&#x7A0B;&#x80FD;&#x591F;&#x53CD;&#x590D;&#x8FDB;&#x884C;&#x3002;</p>
<p>&#x7136;&#x800C;&#xFF0C;&#x63A8;&#x8350;&#x5728;&#x67D0;&#x79CD;&#x7A0B;&#x5EA6;&#x4E0A;&#x662F;&#x6E20;&#x9053;&#x7684;&#x593A;&#x6743;&#xFF1A;&#x4F5C;&#x4E3A;&#x63A5;&#x6536;&#x8005;&#xFF0C;&#x6211;&#x4EEC;&#x8BA9;&#x6E21;&#x4E86;&#x4E00;&#x90E8;&#x5206;&#x81EA;&#x7531;&#x9009;&#x62E9;&#x7684;&#x6743;&#x5229;&#x548C;&#x673A;&#x4F1A;&#xFF1B;&#x4F5C;&#x4E3A;&#x521B;&#x9020;&#x8005;&#xFF0C;&#x6211;&#x4EEC;&#x63A5;&#x53D7;&#x4E86;&#x6765;&#x81EA;&#x6E20;&#x9053;&#x7684;&#x7B5B;&#x9009;&#xFF1B;&#x5BF9;&#x4E8E;&#x4E24;&#x65B9;&#x6765;&#x8BF4;&#xFF0C;&#x90FD;&#x4F1A;&#x4E0D;&#x53EF;&#x907F;&#x514D;&#x5730;&#x53D7;&#x5230;&#x6E20;&#x9053;&#x7684;&#x631F;&#x6301;&#x3002;</p>
<p>&#x8BA4;&#x8BC6;&#x5230;&#x8FD9;&#x4E00;&#x70B9;&#x5728;&#x4FE1;&#x606F;&#x6536;&#x96C6;&#x6E20;&#x9053;&#x7684;&#x9009;&#x62E9;&#x4E0A;&#x81F3;&#x5173;&#x91CD;&#x8981;&#xFF0C;&#x6211;&#x9700;&#x8981;&#x8BA4;&#x6E05;&#x6E20;&#x9053;&#x4EE3;&#x8868;&#x6211;&#x4F5C;&#x51FA;&#x4E86;&#x54EA;&#x4E9B;&#x9009;&#x62E9;&#x548C;&#x5224;&#x65AD;&#x3002;</p>
<h3 id="&#x6211;&#x4E3A;&#x4EC0;&#x4E48;&#x9009;&#x62E9;RSS"><a href="#&#x6211;&#x4E3A;&#x4EC0;&#x4E48;&#x9009;&#x62E9;RSS" class="headerlink" title="&#x6211;&#x4E3A;&#x4EC0;&#x4E48;&#x9009;&#x62E9;RSS"></a>&#x6211;&#x4E3A;&#x4EC0;&#x4E48;&#x9009;&#x62E9;RSS</h3><p>&#x6211;&#x6700;&#x63A8;&#x5D07;&#x7684;&#x4E00;&#x9879;&#x6280;&#x672F;&#xFF08;&#x66F4;&#x591A;&#x7684;&#x5E94;&#x8BE5;&#x662F;&#x4E00;&#x4EFD;&#x534F;&#x8BAE;&#xFF09;&#x662F;RSS&#xFF0C;&#x5168;&#x79F0;Rich Site Summary&#x3002;</p>
<p>RSS&#x53EF;&#x4EE5;&#x7406;&#x89E3;&#x4E3A;&#x4FE1;&#x606F;&#x4EA7;&#x51FA;&#x8005;&#x548C;&#x63A5;&#x6536;&#x8005;&#x4E4B;&#x95F4;&#x7EA6;&#x5B9A;&#x7684;&#x4E00;&#x4EFD;&#x516C;&#x7EA6;&#xFF0C;&#x5B83;&#x662F;&#x9075;&#x5FAA;&#x539F;&#x59CB;&#x7684;&#x8BA2;&#x9605;&#x6A21;&#x5F0F;&#xFF1A;&#x7531;&#x4EA7;&#x751F;&#x8005;&#x4E3A;&#x65B0;&#x5185;&#x5BB9;&#x63D0;&#x4F9B;&#x4E00;&#x4EFD;&#x6807;&#x51C6;&#x5316;&#x7684;&#x6458;&#x8981;&#xFF0C;&#x800C;&#x63A5;&#x6536;&#x8005;&#x5219;&#x4F7F;&#x7528;&#x901A;&#x7528;&#x7684;&#x4EE3;&#x7406;&#x7A0B;&#x5E8F;&#x5B9A;&#x671F;&#x68C0;&#x67E5;&#x548C;&#x6293;&#x53D6;&#x8FD9;&#x4EFD;&#x6458;&#x8981;&#x3002;RSS&#x4EE5;&#x4E0D;&#x89E6;&#x53CA;&#x4FE1;&#x606F;&#x672C;&#x8EAB;&#x7684;&#x65B9;&#x5F0F;&#x6807;&#x51C6;&#x5316;&#x4E86;&#x4EA7;&#x751F;&#x8005;&#x548C;&#x63A5;&#x6536;&#x8005;&#x4E4B;&#x95F4;&#x7684;&#x4EA4;&#x4E92;&#xFF0C;&#x5E76;&#x4FDD;&#x7559;&#x4E86;&#x5404;&#x81EA;&#x539F;&#x672C;&#x7684;&#x6743;&#x5229;&#x3002;</p>
<p>&#x7528;&#x4E00;&#x4E2A;&#x4E0D;&#x592A;&#x6070;&#x5F53;&#x7684;&#x6BD4;&#x55BB;&#x6765;&#x8BF4;&#xFF0C;&#x5927;&#x90E8;&#x5206;&#x6E20;&#x9053;&#x50CF;&#x4E2A;&#x5E02;&#x573A;&#xFF0C;&#x5230;&#x5904;&#x5145;&#x6EE1;&#x4E86;&#x53EB;&#x5356;&#x7684;&#x5546;&#x8D29;&#xFF0C;&#x5B83;&#x8BA9;&#x4F60;&#x4F53;&#x4F1A;&#x5230;&#x9009;&#x62E9;&#x7684;&#x4E30;&#x5BCC;&#x4E4B;&#x65F6;&#xFF0C;&#x7CBE;&#x529B;&#x4E5F;&#x88AB;&#x773C;&#x82B1;&#x7F2D;&#x4E71;&#x7684;&#x5E7F;&#x544A;&#x5206;&#x6563;&#xFF0C;&#x800C;RSS&#x5219;&#x50CF;&#x662F;&#x4E00;&#x4EFD;&#x9080;&#x8BF7;&#x4F60;&#x5230;&#x67D0;&#x4E2A;&#x5E76;&#x4E0D;&#x76F8;&#x8BC6;&#x7684;&#x4EBA;&#x5BB6;&#x4E2D;&#xFF08;&#x535A;&#x5BA2;&#xFF09;&#x505A;&#x5BA2;&#x7684;&#x4FE1;&#x51FD;&#xFF1A;&#x5466;&#x5466;&#x9E7F;&#x9E23;&#xFF0C;&#x98DF;&#x91CE;&#x4E4B;&#x82F9;&#x3002;&#x6211;&#x6709;&#x5609;&#x5BBE;&#xFF0C;&#x9F13;&#x745F;&#x5439;&#x7B19;&#x3002;</p>
<h3 id="&#x4E5F;&#x8C08;&#x793E;&#x4EA4;&#x5E73;&#x53F0;"><a href="#&#x4E5F;&#x8C08;&#x793E;&#x4EA4;&#x5E73;&#x53F0;" class="headerlink" title="&#x4E5F;&#x8C08;&#x793E;&#x4EA4;&#x5E73;&#x53F0;"></a>&#x4E5F;&#x8C08;&#x793E;&#x4EA4;&#x5E73;&#x53F0;</h3><p>&#x5BF9;&#x6211;&#x6765;&#x8BF4;&#xFF0C;&#x793E;&#x4EA4;&#x5E73;&#x53F0;&#x5E76;&#x4E0D;&#x6210;&#x4E3A;&#x4FE1;&#x606F;&#x7684;&#x6765;&#x6E90;&#xFF0C;&#x81F3;&#x5C11;&#x6211;&#x4E0D;&#x671F;&#x5F85;&#x5B83;&#x80FD;&#x591F;&#x53D1;&#x6325;&#x591A;&#x5C11;&#x4F5C;&#x4E3A;&#x4FE1;&#x606F;&#x6765;&#x6E90;&#x7684;&#x4F5C;&#x7528;&#x3002;&#x5982;&#x6211;&#x5728;&#x4FE1;&#x606F;&#x7684;&#x5305;&#x88C5;&#x4E00;&#x8282;&#x4E2D;&#x6240;&#x8C08;&#xFF0C;&#x5FAE;&#x535A;&#x548C;&#x5FAE;&#x4FE1;&#x670B;&#x53CB;&#x5708;&#x8FD9;&#x79CD;&#x77ED;&#x4FE1;&#x606F;&#x6D41;&#x662F;&#x76F8;&#x5F53;&#x5DEE;&#x7684;&#x4FE1;&#x606F;&#x7EC4;&#x7EC7;&#x5F62;&#x5F0F;&#xFF0C;&#x5B83;&#x5728;&#x5F88;&#x591A;&#x60C5;&#x51B5;&#x4E0B;&#x4E0D;&#x80FD;&#x5B8C;&#x6574;&#x5730;&#x4F20;&#x8FBE;&#x4E00;&#x4E2A;&#x53EF;&#x4EE5;&#x81EA;&#x8BC1;&#x7684;&#x89C2;&#x70B9;&#x6216;&#x662F;&#x5BA2;&#x89C2;&#x63CF;&#x8FF0;&#x4E00;&#x9879;&#x4E8B;&#x5B9E;&#x3002;&#x6211;&#x4ECE;&#x6765;&#x4E0D;&#x4F1A;&#x628A;&#x5B83;&#x4EEC;&#x5F53;&#x4F5C;&#x662F;&#x4FE1;&#x606F;&#x7684;&#x6765;&#x6E90;&#xFF0C;&#x5B83;&#x4EEC;&#x4EC5;&#x53EF;&#x4F5C;&#x4E3A;&#x4E00;&#x9879;&#x7D22;&#x5F15;&#xFF0C;&#x5411;&#x6211;&#x8868;&#x660E;&#x67D0;&#x4EF6;&#x4E8B;&#x60C5;&#x53EF;&#x80FD;&#x503C;&#x5F97;&#x5173;&#x6CE8;&#x3002;</p>
<p>&#x5728;&#x8FD9;&#x4E00;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x597D;&#x53CB;&#x4E5F;&#x4F5C;&#x4E3A;&#x4FE1;&#x606F;&#x7684;&#x7B5B;&#x9009;&#x7740;&#x548C;&#x5206;&#x53D1;&#x8005;&#xFF0C;&#x4ED6;&#x4EEC;&#x6240;&#x63D0;&#x4F9B;&#x7684;&#x610F;&#x89C1;&#x5219;&#x53EF;&#x5728;&#x76F8;&#x5F53;&#x7A0B;&#x5EA6;&#x4E0A;&#x4E3A;&#x4FE1;&#x606F;&#x63D0;&#x4F9B;&#x662F;&#x5426;&#x503C;&#x5F97;&#x8FDB;&#x4E00;&#x6B65;&#x5BA1;&#x9605;&#x7684;&#x6839;&#x636E;&#x3002;&#x5927;&#x90E8;&#x5206;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x793E;&#x4EA4;&#x5E73;&#x53F0;&#x53EA;&#x4F1A;&#x53D1;&#x6325;&#x5176;&#x6C9F;&#x901A;&#x548C;&#x901A;&#x8BAF;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x6211;&#x4E0D;&#x4F1A;&#x5728;&#x4E0A;&#x9762;&#x82B1;&#x8D39;&#x66F4;&#x591A;&#x65F6;&#x95F4;&#x3002;</p>
<h2 id="&#x5B9E;&#x8DF5;"><a href="#&#x5B9E;&#x8DF5;" class="headerlink" title="&#x5B9E;&#x8DF5;"></a>&#x5B9E;&#x8DF5;</h2><p>&#x6211;&#x6240;&#x7406;&#x89E3;&#x7684;&#x4FE1;&#x606F;&#x5904;&#x7406;&#x5B9E;&#x8DF5;&#x7684;&#x6846;&#x67B6;&#xFF0C;&#x6709;&#x4E09;&#x4E2A;&#x5173;&#x952E;&#x7684;&#x7EF4;&#x5EA6;&#xFF1A;&#x4FE1;&#x606F;&#x7C7B;&#x578B;&#x3001;&#x65F6;&#x95F4;&#x8D28;&#x91CF;&#x548C;&#x5904;&#x7406;&#x72B6;&#x6001;&#x3002;&#x4E8E;&#x662F;&#xFF0C;&#x4FE1;&#x606F;&#x5904;&#x7406;&#x7684;&#x95EE;&#x9898;&#x53EF;&#x4EE5;&#x8868;&#x8FF0;&#x4E3A;&#xFF1A;<strong>&#x5982;&#x4F55;&#x4EE5;&#x5408;&#x7406;&#x7684;&#x65F6;&#x95F4;&#x548C;&#x7CBE;&#x529B;&#x6295;&#x5165;&#xFF0C;&#x4F7F;&#x4E0D;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x4FE1;&#x606F;&#x8FBE;&#x5230;&#x9002;&#x5408;&#x7684;&#x5904;&#x7406;&#x72B6;&#x6001;&#xFF1F;</strong></p>
<h3 id="&#x4FE1;&#x606F;&#x7C7B;&#x578B;&#xFF1A;&#x8D28;&#x91CF;&#x6709;&#x51E0;&#x4F55;&#xFF1F;"><a href="#&#x4FE1;&#x606F;&#x7C7B;&#x578B;&#xFF1A;&#x8D28;&#x91CF;&#x6709;&#x51E0;&#x4F55;&#xFF1F;" class="headerlink" title="&#x4FE1;&#x606F;&#x7C7B;&#x578B;&#xFF1A;&#x8D28;&#x91CF;&#x6709;&#x51E0;&#x4F55;&#xFF1F;"></a>&#x4FE1;&#x606F;&#x7C7B;&#x578B;&#xFF1A;&#x8D28;&#x91CF;&#x6709;&#x51E0;&#x4F55;&#xFF1F;</h3><p>&#x6309;&#x7167;&#x4FE1;&#x606F;&#x5BC6;&#x5EA6;&#x548C;&#x5904;&#x7406;&#x96BE;&#x5EA6;&#x7B49;&#xFF0C;&#x6211;&#x5C06;&#x4FE1;&#x606F;&#x5206;&#x4E3A;&#x5B66;&#x4E60;&#x6750;&#x6599;&#x3001;&#x89C2;&#x70B9;&#x8BC4;&#x8BBA;&#x3001;&#x79D1;&#x666E;&#x77E5;&#x8BC6;&#x3001;&#x8D44;&#x8BAF;&#x548C;&#x566A;&#x97F3;&#x3002;&#x8FD9;&#x4E9B;&#x7C7B;&#x578B;&#x95F4;&#x7684;&#x8FB9;&#x754C;&#xFF0C;&#x5404;&#x4EBA;&#x81EA;&#x6709;&#x5404;&#x81EA;&#x7684;&#x5C3A;&#x5EA6;&#x548C;&#x504F;&#x597D;&#xFF0C;&#x91CD;&#x8981;&#x7684;&#x662F;&#x7ED9;&#x4FE1;&#x606F;&#x5206;&#x7C7B;&#x7684;&#x610F;&#x8BC6;&#xFF1A;<strong>&#x5E76;&#x4E0D;&#x662F;&#x6240;&#x6709;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x90FD;&#x503C;&#x5F97;&#x4F60;&#x7684;&#x7B49;&#x4EF7;&#x5173;&#x6CE8;</strong>&#x3002;</p>
<h4 id="&#x5B66;&#x4E60;&#x6750;&#x6599;"><a href="#&#x5B66;&#x4E60;&#x6750;&#x6599;" class="headerlink" title="&#x5B66;&#x4E60;&#x6750;&#x6599;"></a>&#x5B66;&#x4E60;&#x6750;&#x6599;</h4><p>&#x5BF9;&#x5B66;&#x751F;&#x800C;&#x8A00;&#xFF0C;&#x5B66;&#x4E60;&#x6750;&#x6599;&#x7684;&#x4E00;&#x4E2A;&#x660E;&#x663E;&#x4F8B;&#x5B50;&#x5C31;&#x662F;&#x6559;&#x79D1;&#x4E66;&#x3002;&#x66F4;&#x4E3A;&#x6DF1;&#x5165;&#x4E00;&#x70B9;&#xFF0C;&#x5B9A;&#x4E49;&#x5B66;&#x4E60;&#x6750;&#x6599;&#x7684;&#x5E94;&#x662F;&#x5176;&#x4EE3;&#x8868;&#x7684;&#x6743;&#x5A01;&#x6027;&#x548C;&#x590D;&#x6742;&#x6027;&#x3002;&#x6743;&#x5A01;&#x6027;&#x610F;&#x6307;&#x5176;&#x53EF;&#x9760;&#x7A0B;&#x5EA6;&#xFF0C;&#x79D1;&#x5B66;&#x7406;&#x8BBA;&#x3001;&#x5B9E;&#x9A8C;&#x4E8B;&#x5B9E;&#x7B49;&#x5747;&#x5728;&#x6B64;&#x5217;&#xFF0C;&#x4E5F;&#x53EF;&#x5EF6;&#x4F38;&#x81F3;&#x9886;&#x57DF;&#x7ECF;&#x5178;&#x7684;&#x8BBA;&#x6587;&#x3001;&#x4E13;&#x8457;&#x3001;&#x62A5;&#x544A;&#x7B49;&#x3002;&#x800C;&#x4ECE;&#x590D;&#x6742;&#x6027;&#x6765;&#x8BB2;&#xFF0C;&#x5219;&#x662F;&#x6211;&#x4EEC;&#x5224;&#x5B9A;&#x8FD9;&#x4E00;&#x6750;&#x6599;&#x7684;&#x4EF7;&#x503C;&#x548C;&#x5185;&#x5316;&#x8FD9;&#x4E00;&#x6750;&#x6599;&#x6240;&#x542B;&#x4FE1;&#x606F;&#x6240;&#x9700;&#x8981;&#x4ED8;&#x51FA;&#x7684;&#x7CBE;&#x529B;&#x591A;&#x5C11;&#xFF0C;&#x5982;&#x67D0;&#x4E00;&#x524D;&#x6CBF;&#x7684;&#x79D1;&#x7814;&#x5DE5;&#x4F5C;&#x3001;&#x67D0;&#x4E00;&#x95E8;&#x8BED;&#x8A00;&#x3001;&#x67D0;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#x5E93;&#x3001;MOOCs&#x7B49;&#x3002;</p>
<p>&#x5BF9;&#x5B66;&#x4E60;&#x6750;&#x6599;&#x7684;&#x5904;&#x7406;&#x8FD8;&#x5E94;&#x5305;&#x62EC;&#x5176;&#x6536;&#x96C6;&#x8FC7;&#x7A0B;&#xFF0C;&#x6211;&#x4EEC;&#x5E38;&#x9700;&#x8981;&#x9488;&#x5BF9;&#x67D0;&#x4E00;&#x4E3B;&#x9898;&#x5EFA;&#x7ACB;&#x6750;&#x6599;&#x5E93;&#xFF0C;&#x8FD9;&#x4E00;&#x8FC7;&#x7A0B;&#x4E5F;&#x9700;&#x8981;&#x76F8;&#x5F53;&#x7684;&#x5224;&#x65AD;&#x529B;&#x548C;&#x7CBE;&#x529B;&#x6295;&#x5165;&#x3002;</p>
<h4 id="&#x89C2;&#x70B9;&#x8BC4;&#x8BBA;"><a href="#&#x89C2;&#x70B9;&#x8BC4;&#x8BBA;" class="headerlink" title="&#x89C2;&#x70B9;&#x8BC4;&#x8BBA;"></a>&#x89C2;&#x70B9;&#x8BC4;&#x8BBA;</h4><p>&#x8FD9;&#x4E00;&#x7C7B;&#x578B;&#x53EF;&#x88AB;&#x8BA4;&#x4E3A;&#x662F;&#x201C;&#x4E8C;&#x6B21;&#x77E5;&#x8BC6;&#x201C;&#xFF08;&#x4E43;&#x81F3;N&#x6B21;&#xFF0C;&#x53C8;&#x6216;&#x8BB8;&#x4E00;&#x6B21;&#x77E5;&#x8BC6;&#x5E76;&#x4E0D;&#x5B58;&#x5728;&#xFF09;&#xFF0C;&#x901A;&#x5E38;&#x662F;&#x67D0;&#x4EBA;&#x5BF9;&#x67D0;&#x4E00;&#x4E8B;&#x7269;&#x7684;&#x8BA4;&#x8BC6;&#x548C;&#x89C2;&#x70B9;&#xFF0C;&#x903B;&#x8F91;&#x6027;&#x548C;&#x4E8B;&#x5B9E;&#x6027;&#x517C;&#x5177;&#x3002;&#x5BF9;&#x8FD9;&#x7C7B;&#x4FE1;&#x606F;&#xFF0C;&#x6BD4;&#x8F83;&#x91CD;&#x8981;&#x7684;&#x662F;&#x5224;&#x65AD;&#x5176;&#x80FD;&#x5426;&#x201D;&#x81EA;&#x5706;&#x5176;&#x8BF4;&#x201C;&#x3002;&#x5373;&#x8BBA;&#x8BC1;&#x7684;&#x65B9;&#x5F0F;&#x662F;&#x5426;&#x5408;&#x4E4E;&#x903B;&#x8F91;&#x3002;&#x6BD4;&#x8F83;&#x5BB9;&#x6613;&#x9677;&#x5165;&#x7684;&#x9677;&#x9631;&#x662F;&#x4ECE;&#x4E8B;&#x5B9E;&#x548C;&#x7ED3;&#x8BBA;&#x51FA;&#x53D1;&#x53BB;&#x5224;&#x65AD;&#x4FE1;&#x606F;&#xFF08;&#x5373;&#x4EE5;&#x81EA;&#x5DF1;&#x9884;&#x5B9A;&#x7684;&#x6001;&#x5EA6;&#x548C;&#x5224;&#x65AD;&#x6765;&#x8BC4;&#x5B9A;&#x6587;&#x7AE0;&#x8D28;&#x91CF;&#xFF09;&#x3002;</p>
<h4 id="&#x79D1;&#x666E;&#x77E5;&#x8BC6;"><a href="#&#x79D1;&#x666E;&#x77E5;&#x8BC6;" class="headerlink" title="&#x79D1;&#x666E;&#x77E5;&#x8BC6;"></a>&#x79D1;&#x666E;&#x77E5;&#x8BC6;</h4><p>&#x79D1;&#x666E;&#x77E5;&#x8BC6;&#x662F;&#x5B66;&#x4E60;&#x6750;&#x6599;&#x7684;&#x6613;&#x7406;&#x89E3;&#x7248;&#x672C;&#xFF0C;&#x53EF;&#x4F9B;&#x5FEB;&#x901F;&#x3001;&#x6D45;&#x5C42;&#x5730;&#x4E86;&#x89E3;&#x67D0;&#x4E00;&#x8F83;&#x4E3A;&#x4E13;&#x4E1A;&#x7684;&#x6982;&#x5FF5;&#x548C;&#x4E8B;&#x7269;&#x3002;</p>
<h4 id="&#x8D44;&#x8BAF;&#x548C;&#x566A;&#x97F3;"><a href="#&#x8D44;&#x8BAF;&#x548C;&#x566A;&#x97F3;" class="headerlink" title="&#x8D44;&#x8BAF;&#x548C;&#x566A;&#x97F3;"></a>&#x8D44;&#x8BAF;&#x548C;&#x566A;&#x97F3;</h4><p>&#x8FD9;&#x4E00;&#x7C7B;&#x578B;&#x4FE1;&#x606F;&#x5E94;&#x5F53;&#x8BF4;&#x5360;&#x636E;&#x4E86;&#x6211;&#x4EEC;&#x5E73;&#x5E38;&#x6240;&#x63A5;&#x6536;&#x4FE1;&#x606F;&#x7684;&#x7EDD;&#x5927;&#x591A;&#x6570;&#x3002;&#x5B83;&#x4EEC;&#x5E38;&#x5E38;&#x6BD4;&#x8F83;&#x788E;&#x7247;&#xFF0C;&#x53EF;&#x8BA8;&#x8BBA;&#x548C;&#x6316;&#x6398;&#x7684;&#x7A7A;&#x95F4;&#x5F88;&#x5C0F;&#x6216;&#x662F;&#x4EF7;&#x503C;&#x4E0D;&#x5927;&#xFF0C;&#x751A;&#x81F3;&#x8DDF;&#x81EA;&#x5DF1;&#x6BEB;&#x4E0D;&#x76F8;&#x5173;&#x3002;</p>
<h3 id="&#x65F6;&#x95F4;&#x8D28;&#x91CF;&#xFF1A;&#x7CBE;&#x529B;&#x6709;&#x591A;&#x5C11;&#xFF1F;"><a href="#&#x65F6;&#x95F4;&#x8D28;&#x91CF;&#xFF1A;&#x7CBE;&#x529B;&#x6709;&#x591A;&#x5C11;&#xFF1F;" class="headerlink" title="&#x65F6;&#x95F4;&#x8D28;&#x91CF;&#xFF1A;&#x7CBE;&#x529B;&#x6709;&#x591A;&#x5C11;&#xFF1F;"></a>&#x65F6;&#x95F4;&#x8D28;&#x91CF;&#xFF1A;&#x7CBE;&#x529B;&#x6709;&#x591A;&#x5C11;&#xFF1F;</h3><p>&#x4F5C;&#x4E3A;&#x4FE1;&#x606F;&#x5904;&#x7406;&#x7684;&#x4E3B;&#x4F53;&#xFF0C;&#x81EA;&#x5DF1;&#x7684;&#x7CBE;&#x795E;&#x72B6;&#x6001;&#x548C;&#x53EF;&#x652F;&#x914D;&#x65F6;&#x95F4;&#x5FC5;&#x5B9A;&#x662F;&#x4E00;&#x4E2A;&#x5173;&#x952E;&#x7684;&#x56E0;&#x7D20;&#x3002;&#x6709;&#x4E86;&#x5BF9;&#x4FE1;&#x606F;&#x5206;&#x7C7B;&#x7684;&#x610F;&#x8BC6;&#x540E;&#xFF0C;&#x65F6;&#x95F4;&#x548C;&#x7CBE;&#x529B;&#x7684;&#x5B89;&#x6392;&#x4E5F;&#x5C31;&#x4E0D;&#x8A00;&#x81EA;&#x660E;&#xFF1A;&#x7528;&#x7CBE;&#x529B;&#x5145;&#x6C9B;&#x3001;&#x8F83;&#x957F;&#x7684;&#x65F6;&#x95F4;&#x6BB5;&#x53BB;&#x5904;&#x7406;&#x9AD8;&#x8D28;&#x91CF;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x5982;&#x5B66;&#x4E60;&#x6750;&#x6599;&#x548C;&#x89C2;&#x70B9;&#x8BC4;&#x8BBA;&#x7B49;&#xFF1B;&#x800C;&#x788E;&#x7247;&#x5316;&#x7684;&#x65F6;&#x95F4;&#x7528;&#x4E8E;&#x6D4F;&#x89C8;&#x79D1;&#x666E;&#x77E5;&#x8BC6;&#x548C;&#x8FC7;&#x6EE4;&#x8D44;&#x8BAF;&#x3002;</p>
<p>&#x518D;&#x6DF1;&#x5165;&#x5730;&#xFF0C;&#x5BF9;&#x81EA;&#x5DF1;&#x7684;&#x65F6;&#x95F4;&#x548C;&#x7CBE;&#x529B;&#x7BA1;&#x7406;&#x8981;&#x6709;&#x8282;&#x594F;&#x611F;&#xFF0C;&#x5373;&#x4E5F;&#x6709;&#x5206;&#x7C7B;&#x610F;&#x8BC6;&#xFF1A;<strong>&#x5E76;&#x4E0D;&#x662F;&#x6BCF;&#x4E00;&#x5206;&#x949F;&#x90FD;&#x6709;&#x540C;&#x6837;&#x7684;&#x8D28;&#x91CF;</strong>&#x3002;</p>
<h3 id="&#x5904;&#x7406;&#x72B6;&#x6001;&#xFF1A;&#x5185;&#x5316;&#x4E3A;&#x81EA;&#x5DF1;&#x7684;&#x4E00;&#x90E8;&#x5206;"><a href="#&#x5904;&#x7406;&#x72B6;&#x6001;&#xFF1A;&#x5185;&#x5316;&#x4E3A;&#x81EA;&#x5DF1;&#x7684;&#x4E00;&#x90E8;&#x5206;" class="headerlink" title="&#x5904;&#x7406;&#x72B6;&#x6001;&#xFF1A;&#x5185;&#x5316;&#x4E3A;&#x81EA;&#x5DF1;&#x7684;&#x4E00;&#x90E8;&#x5206;"></a>&#x5904;&#x7406;&#x72B6;&#x6001;&#xFF1A;&#x5185;&#x5316;&#x4E3A;&#x81EA;&#x5DF1;&#x7684;&#x4E00;&#x90E8;&#x5206;</h3><p>&#x5982;&#x6211;&#x5728;&#x539F;&#x5219;&#x7BC7;&#x6240;&#x8FF0;&#xFF0C;&#x4FE1;&#x606F;&#x5904;&#x7406;&#x7684;&#x76EE;&#x7684;&#x662F;&#x5185;&#x5316;&#x4E3A;&#x81EA;&#x5DF1;&#x7684;&#x77E5;&#x8BC6;&#x3001;&#x89C2;&#x70B9;&#x3001;&#x6280;&#x80FD;&#x7B49;&#xFF0C;&#x4EE5;&#x4FBF;&#x5728;&#x65E5;&#x540E;&#x7684;&#x51B3;&#x7B56;&#x4E2D;&#x63D0;&#x4F9B;&#x5E2E;&#x52A9;&#x3002;&#x4FE1;&#x606F;&#x88AB;&#x5185;&#x5316;&#x624D;&#x4EA7;&#x751F;&#x4EF7;&#x503C;&#x3002;</p>
<p>&#x90A3;&#x4E48;&#xFF0C;&#x5982;&#x4F55;&#x5185;&#x5316;&#x4FE1;&#x606F;&#xFF1F;&#x6211;&#x8BA4;&#x4E3A;&#x6700;&#x6709;&#x6548;&#x7684;&#x65B9;&#x5F0F;&#x662F;&#x8868;&#x8FBE;&#x3002;</p>
<p>&#x8868;&#x8FBE;&#x53EF;&#x4EE5;&#x662F;&#x67D0;&#x4E00;&#x4E3B;&#x9898;&#x7684;&#x6587;&#x732E;&#x7EFC;&#x8FF0;&#x3001;&#x603B;&#x7ED3;&#x62A5;&#x544A;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x662F;&#x5BF9;&#x67D0;&#x4E00;&#x89C2;&#x70B9;&#x7684;&#x603B;&#x7ED3;&#x5F0F;&#x8BC4;&#x8BBA;&#x6216;&#x53CD;&#x9A73;&#xFF0C;&#x8FD8;&#x53EF;&#x4EE5;&#x662F;&#x4E0D;&#x7ECF;&#x610F;&#x7684;&#x4E00;&#x6B21;&#x81EA;&#x8A00;&#x81EA;&#x8BED;&#x3002;</p>
<p><strong>&#x8868;&#x8FBE;&#x7684;&#x5B9E;&#x8D28;&#x662F;&#xFF0C;&#x7528;&#x81EA;&#x5DF1;&#x7684;&#x8BDD;&#x8BB2;&#x51FA;&#x6765;&#x3002;</strong></p>
<p>&#x66F4;&#x7CBE;&#x7EC6;&#x4E00;&#x70B9;&#xFF0C;&#x5BF9;&#x4E8E;&#x5B66;&#x4E60;&#x6750;&#x6599;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x7EC3;&#x4E60;&#x6027;&#x7684;&#x5B9E;&#x8DF5;&#x6765;&#x5E94;&#x7528;&#x77E5;&#x8BC6;&#xFF1B;&#x5BF9;&#x89C2;&#x70B9;&#x8BC4;&#x8BBA;&#xFF0C;&#x5E94;&#x603B;&#x7ED3;&#x5176;&#x903B;&#x8F91;&#x3001;&#x6307;&#x51FA;&#x8584;&#x5F31;&#x5904;&#xFF1B;&#x5BF9;&#x79D1;&#x666E;&#x77E5;&#x8BC6;&#x3001;&#x8D44;&#x8BAF;&#x548C;&#x566A;&#x97F3;&#x7B49;&#xFF0C;&#x6982;&#x62EC;&#x3001;&#x8F6C;&#x8FF0;&#x7B49;&#x90FD;&#x662F;&#x4E00;&#x79CD;&#x8868;&#x8FBE;&#x3002;</p>
<p>&#x8868;&#x8FBE;&#x7684;&#x5173;&#x952E;&#x662F;&#x5B8C;&#x6210;&#x4ECE;&#x63A5;&#x6536;&#x8005;&#x5230;&#x4F20;&#x64AD;&#x8005;&#x7684;&#x89D2;&#x8272;&#x8F6C;&#x6362;&#xFF1A;&#x5199;&#x4F5C;&#x3001;&#x8DDF;&#x670B;&#x53CB;&#x4EA4;&#x6D41;&#x90FD;&#x662F;&#x5F88;&#x597D;&#x7684;&#x65B9;&#x5F0F;&#x3002;&#x53E6;&#x4E00;&#x4E2A;&#x53EF;&#x64CD;&#x4F5C;&#x7684;&#x4E3E;&#x52A8;&#x662F;&#xFF1A;&#x653E;&#x4E0B;&#x624B;&#x5934;&#x7684;&#x6587;&#x7AE0;&#xFF0C;&#x76EE;&#x5149;&#x6295;&#x5411;&#x522B;&#x5904;&#xFF0C;&#x56DE;&#x60F3;&#x548C;&#x68B3;&#x7406;&#x6587;&#x7AE0;&#x7684;&#x903B;&#x8F91;&#x548C;&#x8981;&#x70B9;&#xFF0C;&#x5E76;&#x9ED8;&#x5FF5;&#x51FA;&#x6765;&#x3002;&#x603B;&#x4E4B;&#xFF0C;<strong>&#x4E0D;&#x8981;&#x8BA9;&#x81EA;&#x5DF1;&#x603B;&#x662F;&#x4FDD;&#x6301;&#x5728;&#x4FE1;&#x606F;&#x7684;&#x7EC8;&#x70B9;&#xFF0C;&#x52AA;&#x529B;&#x6210;&#x4E3A;&#x4E00;&#x4E2A;&#x8D77;&#x70B9;</strong>&#x3002;</p>
<p>&#x5185;&#x5316;&#x4E3A;&#x81EA;&#x5DF1;&#x7684;&#x4E1C;&#x897F;&#x662F;&#x4FE1;&#x606F;&#x5904;&#x7406;&#x7684;&#x6700;&#x7EC8;&#x72B6;&#x6001;&#xFF0C;&#x4F46;&#x4E5F;&#x53EF;&#x6709;&#x4E2D;&#x95F4;&#x5F62;&#x6001;&#x4F5C;&#x4E3A;&#x4E2D;&#x8F6C;&#xFF1A;</p>
<ul>
<li><p>&#x7A0D;&#x540E;&#x518D;&#x8BFB;&#xFF1A;&#x7B49;&#x5F85;&#x9AD8;&#x8D28;&#x91CF;&#x7684;&#x65F6;&#x95F4;&#x96C6;&#x4E2D;&#x5904;&#x7406;</p>
</li>
<li><p>&#x6536;&#x85CF;&#xFF1A;&#x6536;&#x96C6;&#x76F8;&#x5173;&#x7684;&#x6750;&#x6599;&#x8FDB;&#x884C;&#x4EA4;&#x53C9;&#x9605;&#x8BFB;&#xFF0C;&#x6216;&#x662F;&#x7B49;&#x5F85;&#x67E5;&#x9605;</p>
</li>
</ul>
<h2 id="&#x603B;&#x7ED3;"><a href="#&#x603B;&#x7ED3;" class="headerlink" title="&#x603B;&#x7ED3;"></a>&#x603B;&#x7ED3;</h2><p>&#x4FE1;&#x606F;&#xFF0C;&#x4FE8;&#x7136;&#x5DF2;&#x7ECF;&#x6210;&#x4E3A;&#x5F53;&#x4EE3;&#x793E;&#x4F1A;&#x7684;&#x4E00;&#x4E2A;&#x57FA;&#x672C;&#x8981;&#x7D20;&#xFF0C;&#x8DDF;&#x5B83;&#x76F8;&#x5904;&#x3001;&#x4F7F;&#x7528;&#x5B83;&#x3001;&#x5185;&#x5316;&#x5B83;&#x3001;&#x521B;&#x9020;&#x5B83;&#xFF0C;&#x662F;&#x6211;&#x4EEC;&#x4F5C;&#x4E3A;&#x6570;&#x5B57;&#x65F6;&#x4EE3;&#x79FB;&#x6C11;&#x7684;&#x7EC8;&#x751F;&#x8BDD;&#x9898;&#x3002;</p>
<p>&#x6700;&#x540E;&#xFF0C;&#x6211;&#x5728;<a href="https://blog.ddlee.cn/recommendation/" target="_blank" rel="noopener">&#x63A8;&#x8350;</a>&#x9875;&#x9762;&#x63D0;&#x4F9B;&#x4E86;&#x6211;&#x6240;&#x4F7F;&#x7528;&#x7684;&#x5DE5;&#x5177;&#x548C;&#x4FE1;&#x606F;&#x6765;&#x6E90;&#xFF0C;&#x4F9B;&#x53C2;&#x8003;&#x3002;</p>

    
    </div>
    
    <div class="columns is-variable is-1 is-multiline is-mobile">
    
        <span class="column is-narrow"><a class="tag is-light article-tag" href="/tags/Digital-Life/">#Digital Life</a></span>
    
        <span class="column is-narrow"><a class="tag is-light article-tag" href="/tags/Reading/">#Reading</a></span>
    
        <span class="column is-narrow"><a class="tag is-light article-tag" href="/tags/Individual-Development/">#Individual Development</a></span>
    
        <span class="column is-narrow"><a class="tag is-light article-tag" href="/tags/Derivative/">#Derivative</a></span>
    
    </div>
    
    
    <div class="columns is-mobile is-multiline article-nav">
        <span class="column is-12-mobile is-half-desktop  article-nav-prev">
            
            <a href="/posts/ad2d3bed/">论文阅读心得</a>
            
        </span>
        <span class="column is-12-mobile is-half-desktop  article-nav-next">
            
            <a href="/posts/ed30ba89/">Jekyll + GitHub Pages搭建博客笔记</a>
            
        </span>
    </div>
    
</article>




<div class="comments">
    <h3 class="title is-4">评论</h3>
    
<script>
    var disqus_config = function () {
        this.page.url = 'https://blog.ddlee.cc/posts/3a6233e2/';
        this.page.identifier = 'posts/3a6233e2/';
        
        this.language = 'zh';
        
    };
    (function() {
        var d = document, s = d.createElement('script');  
        s.src = '//' + 'ddlee96' + '.disqus.com/embed.js';
        s.setAttribute('data-timestamp', +new Date());
        (d.head || d.body).appendChild(s);
    })();
</script>

<div id="disqus_thread">
    
    <noscript>Please enable JavaScript to view the <a href="//disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
</div>
</div>

    </div>
</section>
    <footer class="footer">
    <div class="container">
        <div class="columns content">
            <div class="column is-narrow has-text-centered">
                &copy; 2020 ddlee&nbsp;
                Powered by <a href="http://hexo.io/" target="_blank">Hexo</a> & <a href="http://github.com/ppoffice/hexo-theme-minos">Minos</a>
            </div>
            <div class="column is-hidden-mobile"></div>

            
            <div class="column is-narrow">
                <div class="columns is-mobile is-multiline is-centered">
                
                    
                <a class="column is-narrow has-text-black" title="GitHub" href="https://github.com/ddlee-cn">
                    
                    <i class="fab fa-github"></i>
                    
                </a>
                
                    
                <a class="column is-narrow has-text-black" title="Telegram" href="https://t.me/ddleecn">
                    
                    <i class="fab fa-telegram-plane"></i>
                    
                </a>
                
                </div>
            </div>
            
            
        </div>
    </div>
</footer>
    <script src="//cdnjs.cloudflare.com/ajax/libs/jquery/3.3.1/jquery.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/moment.js/2.22.2/moment-with-locales.min.js"></script>

<!-- test if the browser is outdated -->
<div id="outdated">
    <h6>Your browser is out-of-date!</h6>
    <p>Update your browser to view this website correctly. <a id="btnUpdateBrowser" href="http://outdatedbrowser.com/">Update my browser now </a></p>
    <p class="last"><a href="#" id="btnCloseUpdateBrowser" title="Close">&times;</a></p>
</div>
<script src="//cdnjs.cloudflare.com/ajax/libs/outdated-browser/1.1.5/outdatedbrowser.min.js"></script>
<script>
    $(document).ready(function () {
        // plugin function, place inside DOM ready function
        outdatedBrowser({
            bgColor: '#f25648',
            color: '#ffffff',
            lowerThan: 'flex'
        })
    });
</script>

<script>
    window.FontAwesomeConfig = {
        searchPseudoElements: true
    }
    moment.locale("zh-CN");
</script>


    
    
<script src="https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.4/MathJax.js?config=TeX-MML-AM_CHTML"></script>
<script>
    MathJax.Hub.Config({
        "HTML-CSS": {
            matchFontHeight: false
        },
        SVG: {
            matchFontHeight: false
        },
        CommonHTML: {
            matchFontHeight: false
        },
        tex2jax: {
            inlineMath: [
                ['$','$'],
                ['\\(','\\)']
            ]
        }
    });
</script>

    
    
    
    
<script src="//cdnjs.cloudflare.com/ajax/libs/lightgallery/1.6.8/js/lightgallery-all.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/justifiedGallery/3.6.5/js/jquery.justifiedGallery.min.js"></script>
<script>
    (function ($) {
        $(document).ready(function () {
            if (typeof($.fn.lightGallery) === 'function') {
                $('.article.gallery').lightGallery({ selector: '.gallery-item' });
            }
            if (typeof($.fn.justifiedGallery) === 'function') {
                $('.justified-gallery').justifiedGallery();
            }
        });
    })(jQuery);
</script>

    
    
    <script src="https://cdnjs.cloudflare.com/ajax/libs/clipboard.js/2.0.0/clipboard.min.js"></script>
    <style>
        .hljs {
            position: relative;
        }

        .hljs .clipboard-btn {
            float: right;
            color: #9a9a9a;
            background: none;
            border: none;
            cursor: pointer;
        }

        .hljs .clipboard-btn:hover {
          color: #8a8a8a;
        }

        .hljs > .clipboard-btn {
            display: none;
            position: absolute;
            right: 4px;
            top: 4px;
        }

        .hljs:hover > .clipboard-btn {
            display: inline;
        }

        .hljs > figcaption > .clipboard-btn {
            margin-right: 4px;
        }
    </style>
    <script>
      $(document).ready(function () {
        $('figure.hljs').each(function(i, figure) {
          var codeId = 'code-' + i;
          var code = figure.querySelector('.code');
          var copyButton = $('<button>Copy <i class="far fa-clipboard"></i></button>');
          code.id = codeId;
          copyButton.addClass('clipboard-btn');
          copyButton.attr('data-clipboard-target-id', codeId);

          var figcaption = figure.querySelector('figcaption');

          if (figcaption) {
            figcaption.append(copyButton[0]);
          } else {
            figure.prepend(copyButton[0]);
          }
        })

        var clipboard = new ClipboardJS('.clipboard-btn', {
          target: function(trigger) {
            return document.getElementById(trigger.getAttribute('data-clipboard-target-id'));
          }
        });
        clipboard.on('success', function(e) {
          e.clearSelection();
        })
      })
    </script>

    
    

    


<script src="/js/script.js"></script>

    
    <div class="searchbox ins-search">
    <div class="searchbox-mask"></div>
    <div class="searchbox-container ins-search-container">
        <div class="searchbox-input-wrapper">
            <input type="text" class="searchbox-input ins-search-input" placeholder="站内搜索">
            <span class="searchbox-close ins-close ins-selectable"><i class="fa fa-times-circle"></i></span>
        </div>
        <div class="searchbox-result-wrapper ins-section-wrapper">
            <div class="ins-section-container"></div>
        </div>
    </div>
</div>
<script>
    (function (window) {
        var INSIGHT_CONFIG = {
            TRANSLATION: {
                POSTS: '文章',
                PAGES: '页面',
                CATEGORIES: '分类',
                TAGS: '标签',
                UNTITLED: '(无标题)',
            },
            CONTENT_URL: '/content.json',
        };
        window.INSIGHT_CONFIG = INSIGHT_CONFIG;
    })(window);
</script>
<script src="/js/insight.js"></script><!-- hexo-inject:begin --><!-- Begin: Injected MathJax -->
<script type="text/x-mathjax-config">
  MathJax.Hub.Config("");
</script>

<script type="text/x-mathjax-config">
  MathJax.Hub.Queue(function() {
    var all = MathJax.Hub.getAllJax(), i;
    for(i=0; i < all.length; i += 1) {
      all[i].SourceElement().parentNode.className += ' has-jax';
    }
  });
</script>

<script type="text/javascript" src="https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.1/MathJax.js?config=TeX-AMS-MML_HTMLorMML">
</script>
<!-- End: Injected MathJax -->
<!-- hexo-inject:end -->
    
</body>
</html>