<!DOCTYPE html>
<html class="has-navbar-fixed-top">
<head><meta name="generator" content="Hexo 3.9.0">
    <!-- hexo-inject:begin --><!-- hexo-inject:end --><meta charset="utf-8">
<title>有关深度学习的一些想法和困惑 - 萧爽楼</title>
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">

<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/outdated-browser/1.1.5/outdatedbrowser.min.css">




<meta name="description" content="我叫李家丞，现在在USTC念书。博客的内容主要包括个人的生活、读书感想，也包括数学、互联网、编程语言、人工智能等方面的学习侧记。">





    <meta name="description" content="&amp;#x76EE;&amp;#x524D;&amp;#x770B;&amp;#x6765;&amp;#xFF0C;&amp;#x6DF1;&amp;#x5EA6;&amp;#x5B66;&amp;#x4E60;&amp;#x6A21;&amp;#x578B;&amp;#x5728;&amp;#x667A;&amp;#x80FD;&amp;#x65B9;&amp;#x9762;&amp;#x53D6;&amp;#x5F97;&amp;#x7684;&amp;#x8FDB;&amp;#x5C55;&amp;#x53EA;&amp;#x662F;&amp;#x5728;&amp;#x65F6;">
<meta name="keywords" content="AI,Deep Learning,Machine Learning,Research">
<meta property="og:type" content="article">
<meta property="og:title" content="有关深度学习的一些想法和困惑">
<meta property="og:url" content="https://blog.ddlee.cc/posts/684dd540/index.html">
<meta property="og:site_name" content="萧爽楼">
<meta property="og:description" content="&amp;#x76EE;&amp;#x524D;&amp;#x770B;&amp;#x6765;&amp;#xFF0C;&amp;#x6DF1;&amp;#x5EA6;&amp;#x5B66;&amp;#x4E60;&amp;#x6A21;&amp;#x578B;&amp;#x5728;&amp;#x667A;&amp;#x80FD;&amp;#x65B9;&amp;#x9762;&amp;#x53D6;&amp;#x5F97;&amp;#x7684;&amp;#x8FDB;&amp;#x5C55;&amp;#x53EA;&amp;#x662F;&amp;#x5728;&amp;#x65F6;">
<meta property="og:locale" content="zh-cn">
<meta property="og:updated_time" content="2020-05-16T04:12:20.293Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="有关深度学习的一些想法和困惑">
<meta name="twitter:description" content="&amp;#x76EE;&amp;#x524D;&amp;#x770B;&amp;#x6765;&amp;#xFF0C;&amp;#x6DF1;&amp;#x5EA6;&amp;#x5B66;&amp;#x4E60;&amp;#x6A21;&amp;#x578B;&amp;#x5728;&amp;#x667A;&amp;#x80FD;&amp;#x65B9;&amp;#x9762;&amp;#x53D6;&amp;#x5F97;&amp;#x7684;&amp;#x8FDB;&amp;#x5C55;&amp;#x53EA;&amp;#x662F;&amp;#x5728;&amp;#x65F6;">





<link rel="icon" href="/favicon.png">


<link rel="stylesheet" href="//fonts.googleapis.com/css?family=Ovo|Source+Code+Pro">
<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/bulma/0.6.2/css/bulma.min.css">


<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/lightgallery/1.6.8/css/lightgallery.min.css">
<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/justifiedGallery/3.6.5/css/justifiedGallery.min.css">


<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/highlight.js/9.12.0/styles/atom-one-light.min.css">

<link rel="stylesheet" href="/css/style.css">

<script defer src="//use.fontawesome.com/releases/v5.0.8/js/all.js"></script><!-- hexo-inject:begin --><!-- hexo-inject:end -->


    
    
    
    
    
    
    
    
    
    

    


</head>
<body>
    
<!-- hexo-inject:begin --><!-- hexo-inject:end --><nav class="navbar is-transparent is-fixed-top navbar-main" role="navigation" aria-label="main navigation">
    <div class="container">
        <div class="navbar-brand">
            <a class="navbar-item navbar-logo" href="/">
                
                    
                    萧爽楼
                    
                
            </a>
            <div class="navbar-burger">
                <span></span>
                <span></span>
                <span></span>
            </div>
        </div>
        
        <div class="navbar-menu navbar-start">
            
            <a class="navbar-item " href="/archives">归档</a>
            
            <a class="navbar-item " href="/gallery">图库</a>
            
            <a class="navbar-item " href="/recommendation">推荐</a>
            
            <a class="navbar-item " href="/links">友链</a>
            
            <a class="navbar-item " href="/about">关于</a>
            
        </div>
        
        <div class="navbar-menu navbar-end">
            
            <a class="navbar-item search" title="搜索" href="javascript:;">
                <i class="fas fa-search"></i>
            </a>
            
            
            
            <a class="navbar-item" title="RSS" href="/atom.xml">
                
                RSS
                
            </a>
               
            <a class="navbar-item" title="ddlee.cc" href="https://ddlee.cc">
                
                ddlee.cc
                
            </a>
               
            
        </div>
    </div>
</nav>

    <section class="section">
    <div class="container">
    <article class="article content gallery" itemscope itemprop="blogPost">
    <h1 class="article-title is-size-3 is-size-4-mobile" itemprop="name">
        
            有关深度学习的一些想法和困惑
        
    </h1>
    <div class="article-meta columns is-variable is-1 is-multiline is-mobile is-size-7-mobile">
        <span class="column is-narrow">
            <time datetime="2018-09-06T13:35:33.000Z" itemprop="datePublished">9月 6 2018</time>
        </span>
        
        <span class="column is-narrow article-category">
            <i class="far fa-folder"></i>
            <a class="article-category-link" href="/categories/AI/">AI</a>
        </span>
        
        
        <span class="column is-narrow">
            
            
            19 分钟 读完 (约 2851 字)
        </span>
        
    </div>
    <div class="article-entry is-size-6-mobile" itemprop="articleBody">
    
        <link rel="stylesheet" type="text/css" href="https://cdn.jsdelivr.net/hint.css/2.4.1/hint.min.css"><p>&#x672C;&#x6587;&#x662F;&#x6211;&#x5728;&#x76EE;&#x6807;&#x68C0;&#x6D4B;&#x4EFB;&#x52A1;&#x4E0A;&#x5B9E;&#x8DF5;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x65B9;&#x6CD5;&#x7684;&#x4E00;&#x70B9;&#x60F3;&#x6CD5;&#x548C;&#x7591;&#x60D1;&#xFF0C;&#x5B66;&#x5386;&#x5C1A;&#x6D45;&#xFF0C;&#x89C6;&#x91CE;&#x6709;&#x9650;&#xFF0C;&#x8FD8;&#x8BF7;&#x5927;&#x5BB6;&#x8BC4;&#x8BBA;&#x6307;&#x6B63;&#x3002;</p>
<h3 id="&#x6211;&#x4EEC;&#x79BB;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x8FD8;&#x6709;&#x591A;&#x8FDC;&#xFF1F;"><a href="#&#x6211;&#x4EEC;&#x79BB;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x8FD8;&#x6709;&#x591A;&#x8FDC;&#xFF1F;" class="headerlink" title="&#x6211;&#x4EEC;&#x79BB;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x8FD8;&#x6709;&#x591A;&#x8FDC;&#xFF1F;"></a>&#x6211;&#x4EEC;&#x79BB;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x8FD8;&#x6709;&#x591A;&#x8FDC;&#xFF1F;</h3><p>&#x8FD9;&#x53EF;&#x8BF4;&#x4E0D;&#x51C6;&#x3002;&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x5BF9;&#x4EBA;&#x7C7B;&#x672C;&#x8EAB;&#x7684;&#x667A;&#x80FD;&#x8FD8;&#x6CA1;&#x6709;&#x4E00;&#x4E2A;&#x88AB;&#x5E7F;&#x6CDB;&#x63A5;&#x53D7;&#x7684;&#x7406;&#x8BBA;&#x548C;&#x6982;&#x5FF5;&#x6846;&#x67B6;&#xFF0C;&#x4F60;&#x6CA1;&#x529E;&#x6CD5;&#x5B9A;&#x4E49;&#x7EC8;&#x70B9;&#x65F6;&#xFF0C;&#x4F60;&#x5F53;&#x7136;&#x8BF4;&#x4E0D;&#x51C6;&#x4F60;&#x79BB;&#x5B83;&#x6709;&#x591A;&#x8FDC;&#x3002;</p>
<p>&#x5728;&#x6211;&#x770B;&#x6765;&#xFF0C;&#x76EE;&#x524D;&#x57FA;&#x4E8E;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x65B9;&#x6CD5;&#x7684;&#x6A21;&#x578B;&#xFF0C;&#x5927;&#x90E8;&#x5206;&#x5B9E;&#x73B0;&#x7684;&#x5B9E;&#x9645;&#x4E0A;&#x662F; <strong>&#x5728;&#x65F6;&#x95F4;&#x548C;&#x89C4;&#x6A21;&#x5C3A;&#x5EA6;&#x4E0A;&#x5BF9;&#x67D0;&#x4E9B;&#x4EBA;&#x7C7B;&#x57FA;&#x672C;&#x80FD;&#x529B;&#x7684;&#x5EF6;&#x4F38;</strong>&#x3002;&#x5982;&#x89C6;&#x89C9;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x4EBA;&#x8138;&#x8BC6;&#x522B;&#xFF0C;&#x6211;&#x4EEC;&#x672C;&#x6765;&#x628A;&#x8BA4;&#x8138;&#x4F5C;&#x4E3A;&#x81EA;&#x5DF1;&#x7684;&#x4E00;&#x9879;&#x57FA;&#x672C;&#x80FD;&#x529B;&#xFF0C;&#x4F46;&#x5F53;&#x89C4;&#x6A21;&#x6269;&#x5927;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x4FBF;&#x65E0;&#x80FD;&#x4E3A;&#x529B;&#xFF1A;&#x6211;&#x4EEC;&#x96BE;&#x4EE5;&#x4ECE;&#x4E0A;&#x767E;&#x4E07;&#x5343;&#x4E07;&#x5F20;&#x8138;&#x4E2D;&#x627E;&#x5230;&#x8DDF;&#x76EE;&#x6807;&#x6700;&#x76F8;&#x4F3C;&#x7684;&#x90A3;&#x4E00;&#x4E2A;&#x3002;&#x4E8E;&#x662F;&#xFF0C;&#x4EBA;&#x8138;&#x8BC6;&#x522B;&#x6A21;&#x578B;&#x5EF6;&#x4F38;&#x4E86;&#x6211;&#x4EEC;&#x5728;&#x89C4;&#x6A21;&#x5C42;&#x9762;&#x4E0A;&#x8BA4;&#x8138;&#x7684;&#x80FD;&#x529B;&#xFF0C;&#x540C;&#x65F6;&#x8FD8;&#x6709;&#x65F6;&#x95F4;&#x4E0A;&#x7684;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x4F60;&#x5E76;&#x4E0D;&#x4F1A;&#x628A;&#x8BA4;&#x8138;&#x8FD9;&#x4E00;&#x80FD;&#x529B;&#x79F0;&#x4E3A;&#x667A;&#x80FD;&#xFF0C;&#x5B83;&#x771F;&#x7684;&#x53EA;&#x662F;&#x6211;&#x4EEC;&#x7684;&#x4E00;&#x9879;&#x57FA;&#x672C;&#x80FD;&#x529B;&#x800C;&#x5DF2;&#x3002;&#x5C31;&#x50CF;&#x4EA4;&#x901A;&#x5DE5;&#x5177;&#x662F;&#x6211;&#x4EEC;&#x53CC;&#x817F;&#x7684;&#x5EF6;&#x4F38;&#xFF0C;&#x76EE;&#x524D;&#x7684;&#x667A;&#x80FD;&#x7CFB;&#x7EDF;&#x53EA;&#x662F;&#x6211;&#x4EEC;&#x719F;&#x77E5;&#x80FD;&#x529B;&#x7684;&#x5EF6;&#x4F38;&#x3002;</p>
<p>&#x66F4;&#x8FDC;&#x4E9B;&#xFF0C;&#x76EE;&#x524D;&#x7684;&#x667A;&#x80FD;&#x7CFB;&#x7EDF;&#x8FD8;&#x4E0D;&#x80FD;&#x6210;&#x4E3A;&#x4E00;&#x4E2A;&#x4E3B;&#x52A8;&#x7684;&#x884C;&#x4E3A;&#x5BF9;&#x8C61;&#xFF0C;&#x800C;&#x4E14;&#x4F60;&#x5E94;&#x8BE5;&#x5BF9;&#x90A3;&#x4E9B;&#x5BF9;&#x667A;&#x80FD;&#x7CFB;&#x7EDF;&#x4F7F;&#x7528;&#x62DF;&#x4EBA;&#x5316;&#x8868;&#x8FBE;&#x7684;&#x6587;&#x7AE0;&#x63D0;&#x8D77;&#x8B66;&#x60D5;&#x3002;&#x590F;&#x5929;&#xFF0C;OpenAI&#x7684;OpenAI Five<sup id="fnref:1"><a href="#fn:1" rel="footnote">1</a></sup>&#x6311;&#x6218;Dota2&#x4EBA;&#x7C7B;&#x73A9;&#x5BB6;&#x65F6;&#xFF0C;&#x6709;&#x5A92;&#x4F53;&#x8FD8;&#x62A5;&#x9053;OpenAI Five&#x5B66;&#x4E60;&#x4E86;&#x4E0A;&#x4E00;&#x5C40;&#x4E2D;&#x4EBA;&#x7C7B;&#x7684;&#x6218;&#x672F;&#xFF0C;&#x5E76;&#x5728;&#x81EA;&#x6211;&#x8FDB;&#x5316;&#x3002;&#x8FD9;&#x91CC;&#x5176;&#x5B9E;&#x6DF7;&#x6DC6;&#x4E86;&#x5B66;&#x4E60;&#x6A21;&#x578B;&#x7684;&#x8BAD;&#x7EC3;&#x8FC7;&#x7A0B;&#x548C;&#x63A8;&#x65AD;&#x8FC7;&#x7A0B;&#x3002;&#x6A21;&#x578B;&#x8FDB;&#x5165;&#x63A8;&#x65AD;&#x65F6;&#xFF0C;&#x552F;&#x4E00;&#x5728;&#x5B66;&#x4E60;&#x7684;&#x5176;&#x5B9E;&#x662F;OpenAI Five&#x7684;&#x7814;&#x7A76;&#x8005;&#xFF0C;&#x4ED6;&#x4EEC;&#x5728;&#x89C2;&#x5BDF;&#x4EBA;&#x7C7B;&#x7684;&#x6218;&#x672F;&#xFF0C;&#x5E76;&#x601D;&#x8003;&#x5982;&#x4F55;&#x5C06;&#x8FD9;&#x4E9B;&#x5EFA;&#x6A21;&#x5230;&#x81EA;&#x5DF1;&#x7684;&#x6A21;&#x578B;&#x91CC;&#x3002;&#x518D;&#x8FDC;&#x81F3;&#x667A;&#x80FD;&#x7CFB;&#x7EDF;&#x662F;&#x5426;&#x6709;&#x81EA;&#x7531;&#x610F;&#x5FD7;&#x3001;&#x6709;&#x60C5;&#x7EEA;&#x611F;&#x53D7;&#x7B49;&#xFF0C;&#x90A3;&#x5C06;&#x8FDB;&#x5165;&#x793E;&#x4F1A;&#x5B66;&#x548C;&#x54F2;&#x5B66;&#x7684;&#x8303;&#x7574;&#xFF0C;&#x81F3;&#x5C11;&#x5728;&#x6211;&#x770B;&#x6765;&#x76EE;&#x524D;&#x7F3A;&#x4E4F;&#x6982;&#x5FF5;&#x5DE5;&#x5177;&#x53BB;&#x5EFA;&#x7ACB;&#x5177;&#x6709;&#x6280;&#x672F;&#x6307;&#x5BFC;&#x610F;&#x4E49;&#x7684;&#x4E25;&#x8083;&#x8BA8;&#x8BBA;&#x3002;</p>
<h3 id="&#x90A3;&#x4E48;&#xFF0C;&#x73B0;&#x5728;&#x5230;&#x5E95;&#x662F;&#x4EC0;&#x4E48;&#x72B6;&#x51B5;&#xFF1F;"><a href="#&#x90A3;&#x4E48;&#xFF0C;&#x73B0;&#x5728;&#x5230;&#x5E95;&#x662F;&#x4EC0;&#x4E48;&#x72B6;&#x51B5;&#xFF1F;" class="headerlink" title="&#x90A3;&#x4E48;&#xFF0C;&#x73B0;&#x5728;&#x5230;&#x5E95;&#x662F;&#x4EC0;&#x4E48;&#x72B6;&#x51B5;&#xFF1F;"></a>&#x90A3;&#x4E48;&#xFF0C;&#x73B0;&#x5728;&#x5230;&#x5E95;&#x662F;&#x4EC0;&#x4E48;&#x72B6;&#x51B5;&#xFF1F;</h3><p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x627E;&#x5230;&#x4E86;&#x4E00;&#x79CD;&#x65B0;&#x7684;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x7684;&#x8303;&#x5F0F;&#xFF1A;<strong>&#x8BA9;&#x6E21;&#x4E00;&#x90E8;&#x5206;&#x5BF9;&#x6A21;&#x578B;&#x7684;&#x63A7;&#x5236;&#x6743;&#x548C;&#x89E3;&#x91CA;&#x6027;&#xFF0C;&#x6765;&#x63D0;&#x9AD8;&#x5BF9;&#x6570;&#x636E;&#xFF08;&#x548C;&#x7B97;&#x529B;&#xFF09;&#x7684;&#x5229;&#x7528;&#x6548;&#x7387;&#x3002;</strong>&#x8FC7;&#x53BB;&#xFF0C;&#x6211;&#x4EEC;&#x5BF9;&#x95EE;&#x9898;&#x8FDB;&#x884C;&#x903B;&#x8F91;&#x4E0A;&#x7684;&#x89E3;&#x6784;&#xFF0C;&#x91C7;&#x7528;&#x7B56;&#x7565;&#x3001;&#x89C4;&#x5219;&#x3001;&#x903B;&#x8F91;&#x7CFB;&#x7EDF;&#x7B49;&#x5C06;&#x95EE;&#x9898;&#x5206;&#x89E3;&#x548C;&#x9010;&#x6B65;&#x9010;&#x5C42;&#x89E3;&#x51B3;&#x3002;&#x4F46;&#x8FD9;&#x79CD;&#x65B9;&#x6848;&#x5E76;&#x4E0D;&#x80FD;&#x9002;&#x7528;&#x6240;&#x6709;&#x95EE;&#x9898;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x90A3;&#x4E9B;&#x6211;&#x4EEC;&#x5C1A;&#x4E0D;&#x80FD;&#x7406;&#x89E3;&#x7684;&#x8FC7;&#x7A0B;&#x3002;&#x4E0E;&#x6B64;&#x540C;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x53D1;&#x73B0;&#x5C3D;&#x7BA1;&#x4E0D;&#x80FD;&#x7406;&#x89E3;&#x4E2A;&#x4E2D;&#x539F;&#x7406;&#xFF0C;&#x4F46;&#x6211;&#x4EEC;&#x6709;&#x5927;&#x91CF;&#x5BF9;&#x8FD9;&#x4E00;&#x8FC7;&#x7A0B;&#x7684;&#x89C2;&#x5BDF;&#x7ED3;&#x679C;&#xFF0C;&#x4E8E;&#x662F;&#xFF0C;&#x8BBE;&#x8BA1;&#x4E00;&#x4E2A;&#x5177;&#x6709;&#x5927;&#x91CF;&#x5F85;&#x5B9A;&#x53C2;&#x6570;&#x7684;&#x6A21;&#x578B;&#xFF0C;&#x7528;&#x8FD9;&#x6837;&#x7684;&#x6A21;&#x578B;&#x53BB;&#x62DF;&#x5408;&#x89C2;&#x5BDF;&#x5230;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x4FBF;&#x6210;&#x4E86;&#x4E00;&#x79CD;&#x81EA;&#x7136;&#x7684;&#x65B9;&#x6848;&#x3002;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x6A21;&#x578B;&#xFF0C;&#x5219;&#x662F;&#x5728;&#x8FD9;&#x4E00;&#x601D;&#x8DEF;&#x4E0B;&#x7684;&#x4E00;&#x79CD;&#x5177;&#x6709;&#x5F88;&#x9AD8;&#x7075;&#x6D3B;&#x6027;&#x548C;&#x6269;&#x5C55;&#x7A7A;&#x95F4;&#x7684;&#x5EFA;&#x6A21;&#x65B9;&#x6CD5;&#x3002;</p>
<p>&#x4E8E;&#x662F;&#xFF0C;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x65B9;&#x6CD5;&#x5728;&#x4EAB;&#x53D7;&#x9AD8;&#x5EA6;&#x7075;&#x6D3B;&#x6027;&#x5BF9;&#x6570;&#x636E;&#x5145;&#x5206;&#x7684;&#x5229;&#x7528;&#x6548;&#x7387;&#x540C;&#x65F6;&#xFF0C;&#x4E5F;&#x80CC;&#x4E0A;&#x4E86;&#x96BE;&#x4EE5;&#x89E3;&#x91CA;&#x548C;&#x516C;&#x7406;&#x5316;&#x91CD;&#x8D1F;&#x3002;&#x4ECE;&#x8FD9;&#x4E2A;&#x610F;&#x4E49;&#x4E0A;&#x8BB2;&#xFF0C;&#x6570;&#x636E;&#x5176;&#x5B9E;&#x662F;&#x6A21;&#x578B;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x3002;&#x5BF9;&#x4E8E;&#x76EE;&#x524D;&#x57FA;&#x4E8E;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x65B9;&#x6CD5;&#x5728;&#x67D0;&#x4E9B;&#x4EFB;&#x52A1;&#x4E0A;&#x53D6;&#x5F97;&#x7684;&#x8FDB;&#x5C55;&#xFF0C;&#x201C;&#x8FBE;&#x5230;&#x53EF;&#x7528;&#x201D;&#x662F;&#x6BD4;&#x201C;&#x8D85;&#x8D8A;&#x4EBA;&#x7C7B;&#x6C34;&#x5E73;&#x201D;&#x6216;&#x8005;&#x201C;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x201D;&#x7B49;&#x66F4;&#x4E0D;&#x5BB9;&#x6613;&#x5F15;&#x8D77;&#x56F0;&#x60D1;&#x7684;&#x8868;&#x8FF0;&#x3002;</p>
<h3 id="&#x600E;&#x6837;&#x624D;&#x662F;&#x7B97;&#x590D;&#x73B0;&#x4E86;&#x4E00;&#x4E2A;&#x5B66;&#x4E60;&#x6A21;&#x578B;&#xFF1F;"><a href="#&#x600E;&#x6837;&#x624D;&#x662F;&#x7B97;&#x590D;&#x73B0;&#x4E86;&#x4E00;&#x4E2A;&#x5B66;&#x4E60;&#x6A21;&#x578B;&#xFF1F;" class="headerlink" title="&#x600E;&#x6837;&#x624D;&#x662F;&#x7B97;&#x590D;&#x73B0;&#x4E86;&#x4E00;&#x4E2A;&#x5B66;&#x4E60;&#x6A21;&#x578B;&#xFF1F;"></a>&#x600E;&#x6837;&#x624D;&#x662F;&#x7B97;&#x590D;&#x73B0;&#x4E86;&#x4E00;&#x4E2A;&#x5B66;&#x4E60;&#x6A21;&#x578B;&#xFF1F;</h3><p>&#x5728;&#x4E00;&#x4E2A;&#x7EAF;&#x51C0;&#x548C;&#x81EA;&#x6070;&#x7684;&#x6570;&#x5B66;&#x8BBA;&#x8BC1;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x5B9A;&#x4E49;&#x3001;&#x5F15;&#x7406;&#x3001;&#x63A8;&#x7406;&#x4F9D;&#x636E;&#x90FD;&#x6E05;&#x6E05;&#x695A;&#x695A;&#xFF0C;&#x6211;&#x4EEC;&#x53EA;&#x9700;&#x5B8C;&#x6210;&#x903B;&#x8F91;&#x4E0A;&#x7684;&#x9A8C;&#x8BC1;&#xFF0C;&#x5373;&#x53EF;&#x8BA4;&#x4E3A;&#x8FD9;&#x4E00;&#x7ED3;&#x8BBA;&#x88AB;&#x6211;&#x4EEC;&#x63A5;&#x53D7;&#x4E86;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x5B66;&#x4E60;&#x6A21;&#x578B;&#x8981;&#x901A;&#x8FC7;&#x4E00;&#x5B9A;&#x7684;&#x4F18;&#x5316;&#x8FC7;&#x7A0B;&#x8FBE;&#x5230;&#x53EF;&#x7528;&#x7684;&#x7A0B;&#x5EA6;&#xFF0C;&#x5E76;&#x4E25;&#x91CD;&#x4F9D;&#x8D56;&#x5B9E;&#x9A8C;&#x548C;&#x590D;&#x6742;&#x8BA1;&#x7B97;&#x8FC7;&#x7A0B;&#x7684;&#x7814;&#x7A76;&#x65B9;&#x5F0F;&#xFF0C;&#x8FD9;&#x4E9B;&#x8BA9; <strong>&#x6240;&#x4F7F;&#x7528;&#x7684;&#x4F18;&#x5316;&#x7B97;&#x6CD5;&#x548C;&#x5DE5;&#x5177;&#x6808;&#x90FD;&#x6210;&#x4E86;&#x6A21;&#x578B;&#x7684;&#x4E00;&#x90E8;&#x5206;</strong>&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x67D0;&#x4E00;&#x6587;&#x7AE0;&#x4E2D;&#x63CF;&#x8FF0;&#x7684;&#x6A21;&#x578B;&#xFF0C;&#x6211;&#x4EEC;&#x5982;&#x4F55;&#x5224;&#x65AD;&#x5176;&#x4ED6;&#x4EBA;&#x80FD;&#x591F;&#x590D;&#x73B0;&#x5176;&#x7ED3;&#x679C;&#xFF1F;&#x662F;&#x5426;&#x610F;&#x5473;&#x7740;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x548C;&#x4F5C;&#x8005;&#x4ECE;&#x5B8C;&#x5168;&#x4E00;&#x6837;&#x7684;&#x968F;&#x673A;&#x521D;&#x59CB;&#x5316;&#x8D77;&#x70B9;&#x5F00;&#x59CB;&#xFF0C;&#x4F7F;&#x7528;&#x5B8C;&#x5168;&#x76F8;&#x540C;&#x7684;&#x4F18;&#x5316;&#x7B97;&#x6CD5;&#x548C;&#x4F18;&#x5316;&#x5668;&#x914D;&#x7F6E;&#xFF0C;&#x7ECF;&#x8FC7;&#x540C;&#x6837;&#x7684;&#x8FED;&#x4EE3;&#x6B21;&#x6570;&#xFF0C;&#x5230;&#x8FBE;&#x540C;&#x6837;&#x7684;&#x6A21;&#x578B;&#x53C2;&#x6570;&#x72B6;&#x6001;&#xFF1F;&#x66F4;&#x6DF1;&#x4E00;&#x70B9;&#xFF0C;&#x6211;&#x4EEC;&#x6240;&#x4F7F;&#x7528;&#x7684;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x5BF9;&#x6570;&#x636E;&#x7684;&#x8868;&#x793A;&#x3001;&#x9009;&#x7528;&#x7684;&#x6D6E;&#x70B9;&#x6570;&#x7CBE;&#x5EA6;&#x3001;&#x4E43;&#x81F3;&#x786C;&#x4EF6;&#x8BBE;&#x5907;&#x7B49;&#xFF0C;&#x4F1A;&#x4E0D;&#x4F1A;&#x5BF9;&#x8FD9;&#x4E00;&#x8BA1;&#x7B97;&#x8FC7;&#x7A0B;&#x7684;&#x590D;&#x73B0;&#x4EA7;&#x751F;&#x5F71;&#x54CD;&#xFF1F;</p>
<h3 id="&#x6211;&#x4EEC;&#x5982;&#x4F55;&#x786E;&#x8BA4;&#x4E00;&#x9879;&#x5DE5;&#x4F5C;&#x7684;&#x8D21;&#x732E;&#xFF1F;"><a href="#&#x6211;&#x4EEC;&#x5982;&#x4F55;&#x786E;&#x8BA4;&#x4E00;&#x9879;&#x5DE5;&#x4F5C;&#x7684;&#x8D21;&#x732E;&#xFF1F;" class="headerlink" title="&#x6211;&#x4EEC;&#x5982;&#x4F55;&#x786E;&#x8BA4;&#x4E00;&#x9879;&#x5DE5;&#x4F5C;&#x7684;&#x8D21;&#x732E;&#xFF1F;"></a>&#x6211;&#x4EEC;&#x5982;&#x4F55;&#x786E;&#x8BA4;&#x4E00;&#x9879;&#x5DE5;&#x4F5C;&#x7684;&#x8D21;&#x732E;&#xFF1F;</h3><p>&#x4F9D;&#x8D56;&#x5DE5;&#x7A0B;&#x5B9E;&#x73B0;&#x548C;&#x8BA1;&#x7B97;&#x8FC7;&#x7A0B;&#x5E26;&#x6765;&#x7684;&#x5F0A;&#x7AEF;&#xFF0C;&#x8FD8;&#x4F53;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x96BE;&#x4EE5;&#x5EFA;&#x7ACB;&#x53EF;&#x4EE5;&#x88AB;&#x5E7F;&#x6CDB;&#x63A5;&#x53D7;&#x7684;&#x8D21;&#x732E;&#x786E;&#x8BA4;&#x6807;&#x51C6;&#x3002;&#x6211;&#x4EEC;&#x5F88;&#x96BE;&#x5224;&#x65AD;&#x67D0;&#x9879;&#x5DE5;&#x4F5C;&#x5E26;&#x6765;&#x7684;&#x771F;&#x6B63;&#x8D21;&#x732E;&#x4EE5;&#x53CA;&#x5982;&#x4F55;&#x786E;&#x8BA4;&#x548C;&#x9A8C;&#x8BC1;&#xFF0C;&#x4E0D;&#x8981;&#x8BEF;&#x4F1A;&#xFF0C;&#x6211;&#x6CA1;&#x6709;&#x5962;&#x6C42;&#x6709;&#x4E00;&#x4E2A;&#x50CF;&#x5E0C;&#x5C14;&#x4F2F;&#x7279;&#x95EE;&#x9898;&#x90A3;&#x6837;&#x7684;&#x7EB2;&#x9886;&#x6027;&#x6307;&#x5357;&#x3002;&#x8FD9;&#x63D0;&#x9192;&#x6211;&#x4EEC;&#x4E00;&#x9879;&#x5DE5;&#x4F5C;&#x4E2D;&#x6700;&#x91CD;&#x8981;&#x7684;&#x90E8;&#x5206;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x4F5C;&#x8005;&#x7684; <strong>&#x6D88;&#x878D;&#x5B9E;&#x9A8C;(Ablation Study)</strong>&#x3002;&#x8FD9;&#x4E9B;&#x5B9E;&#x9A8C;&#x7684;&#x5BF9;&#x7167;&#x8BBE;&#x7F6E;&#x662F;&#x5426;&#x80FD;&#x591F;&#x652F;&#x6491;&#x4F5C;&#x8005;&#x7684;&#x6539;&#x8FDB;&#x4E4B;&#x5904;&#xFF1F;&#x5B9E;&#x9A8C;&#x662F;&#x5426;&#x63A7;&#x5236;&#x4E86;&#x8DB3;&#x591F;&#x7684;&#x53D8;&#x91CF;&#xFF0C;&#x5BF9;&#x6BD4;&#x662F;&#x5426;&#x5408;&#x7406;&#xFF1F;</p>
<p>&#x53E6;&#x5916;&#xFF0C;&#x8F83;&#x4E3A;&#x4E25;&#x82DB;&#x7684;&#x590D;&#x73B0;&#x6761;&#x4EF6;&#x4E5F;&#x9650;&#x5236;&#x4E86;&#x5F88;&#x591A;&#x5DE5;&#x4F5C;&#x7684;&#x53EF;&#x63A8;&#x5E7F;&#x6027;&#xFF0C;&#x67D0;&#x9879;&#x5DE5;&#x4F5C;&#x7684;&#x6539;&#x8FDB;&#x5E38;&#x5E38;&#x5E76;&#x4E0D;&#x80FD;&#x5B8C;&#x5168;&#x72EC;&#x7ACB;&#x51FA;&#x6765;&#xFF0C;&#x5728;&#x5176;&#x4ED6;&#x7ED3;&#x6784;&#x548C;&#x6A21;&#x578B;&#x4E0A;&#x53D1;&#x6325;&#x540C;&#x6837;&#x51FA;&#x8272;&#x7684;&#x6027;&#x80FD;&#x3002;&#x8FD9;&#x5176;&#x5B9E;&#x8981;&#x6C42;&#x4F5C;&#x8005;&#x53BB;&#x505A;&#x66F4;&#x591A;&#x7684;&#x9C81;&#x68D2;&#x6027;&#x548C;&#x63A8;&#x5E7F;&#x6027;&#x5B9E;&#x9A8C;&#xFF0C;&#x6765;&#x652F;&#x6491;&#x5176;&#x6539;&#x8FDB;&#x4E4B;&#x5904;&#x7684;&#x9002;&#x7528;&#x6027;&#x3002;&#x8FD9;&#x91CC;&#x662F;&#x6211;&#x7591;&#x60D1;&#x6BD4;&#x8F83;&#x5927;&#x7684;&#x5730;&#x65B9;&#xFF1A;&#x6211;&#x4EEC;&#x8BE5;&#x5982;&#x4F55;&#x8BC4;&#x5B9A;&#x67D0;&#x9879;&#x5DE5;&#x4F5C;&#x4E3A;&#x89E3;&#x51B3;&#x67D0;&#x4E00;&#x95EE;&#x9898;&#x505A;&#x51FA;&#x7684;&#x8D21;&#x732E;&#xFF1F;&#x4E00;&#x4E2A;&#x5BB9;&#x6613;&#x89C2;&#x6D4B;&#x7684;&#x6307;&#x6807;&#x662F;&#x5728;&#x6807;&#x51C6;&#x8BC4;&#x6D4B;&#x96C6;&#x4E0A;&#x7684;&#x8868;&#x73B0;&#xFF0C;&#x4F46;&#x5982;&#x4F55;&#x5206;&#x79BB;&#x5DE5;&#x4F5C;&#x4E2D;&#x63D0;&#x51FA;&#x7684;&#x65B9;&#x6CD5;&#x548C;&#x8BC4;&#x6D4B;&#x8FD9;&#x4E00;&#x6307;&#x6807;&#x8FC7;&#x7A0B;&#x5E26;&#x6765;&#x7684;&#x5F71;&#x54CD;&#xFF1F;&#x5982;&#x679C;&#x9700;&#x8981;&#x7ED9;&#x51FA;&#x67D0;&#x4E9B;&#x5DE5;&#x4F5C;&#x505A;&#x4E3A;&#x57FA;&#x51C6;&#xFF0C;&#x90A3;&#x8FD9;&#x4E9B;&#x5DE5;&#x4F5C;&#x8BE5;&#x5982;&#x4F55;&#x9009;&#x53D6;&#xFF0C;&#x9009;&#x53D6;&#x540E;&#x53C8;&#x5982;&#x4F55;&#x63A7;&#x5236;&#x53D8;&#x91CF;&#x6765;&#x4FDD;&#x8BC1;&#x5BF9;&#x8981;&#x8BC4;&#x6D4B;&#x5DE5;&#x4F5C;&#x63D0;&#x51FA;&#x65B9;&#x6CD5;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x516C;&#x5141;&#x7684;&#x57FA;&#x51C6;&#x5462;&#xFF1F;</p>
<p>&#x524D;&#x9762;&#x63D0;&#x5230;&#xFF0C;&#x6570;&#x636E;&#x53EF;&#x4EE5;&#x88AB;&#x8BA4;&#x4E3A;&#x662F;&#x6A21;&#x578B;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x3002;&#x4E8E;&#x662F;&#xFF0C;ImageNet&#x8FD9;&#x6837;&#x7684;&#x516C;&#x5F00;&#x8BC4;&#x6D4B;&#x96C6;&#x53EF;&#x4EE5;&#x4F5C;&#x4E3A;&#x6807;&#x51C6;&#x6765;&#x8861;&#x91CF;&#x4E0D;&#x540C;&#x6A21;&#x578B;&#x7684;&#x8868;&#x73B0;&#x5982;&#x4F55;&#xFF0C;&#x8FD9;&#x786E;&#x5B9E;&#x662F;&#x4E00;&#x9879;&#x91CD;&#x8981;&#x7684;&#x6807;&#x51C6;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x66F4;&#x4E3A;&#x91CD;&#x8981;&#x7684;&#x8FD8;&#x5305;&#x62EC;&#x95EE;&#x9898;&#x8868;&#x8FF0;&#x548C;&#x8BC4;&#x6D4B;&#x6807;&#x51C6;&#x7684;&#x6F14;&#x8FDB;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x66F4;&#x7ACB;&#x4F53;&#x6DF1;&#x5165;&#x5730;&#x8BA4;&#x8BC6;&#x76EE;&#x6807;&#x95EE;&#x9898;&#xFF0C;&#x800C;&#x975E;&#x5355;&#x7EAF;&#x5730;&#x6269;&#x5C55;&#x6570;&#x636E;&#x96C6;&#x89C4;&#x6A21;&#x3002;&#x5F53;Google&#x516C;&#x5E03;&#x4ED6;&#x4EEC;&#x7684;Open Images&#x6570;&#x636E;&#x96C6;<sup id="fnref:2"><a href="#fn:2" rel="footnote">2</a></sup>&#x65F6;&#xFF0C;&#x66F4;&#x5438;&#x5F15;&#x6211;&#x7684;&#x4E0D;&#x662F;&#x89C4;&#x6A21;&#x6709;&#x591A;&#x5927;&#xFF0C;&#x800C;&#x662F;&#x662F;&#x5426;&#x63D0;&#x51FA;&#x4E86;&#x66F4;&#x516C;&#x5141;&#x6E05;&#x6670;&#x7684;&#x8BC4;&#x6D4B;&#x6807;&#x51C6;&#xFF08;&#x7136;&#x800C;&#x4ED6;&#x4EEC;&#x6CA1;&#x6709;&#xFF09;&#x3002;</p>
<h3 id="&#x600E;&#x6837;&#x7684;&#x8BBA;&#x8BC1;&#x548C;&#x89E3;&#x91CA;&#x624D;&#x662F;&#x503C;&#x5F97;&#x4FE1;&#x670D;&#x7684;&#xFF1F;"><a href="#&#x600E;&#x6837;&#x7684;&#x8BBA;&#x8BC1;&#x548C;&#x89E3;&#x91CA;&#x624D;&#x662F;&#x503C;&#x5F97;&#x4FE1;&#x670D;&#x7684;&#xFF1F;" class="headerlink" title="&#x600E;&#x6837;&#x7684;&#x8BBA;&#x8BC1;&#x548C;&#x89E3;&#x91CA;&#x624D;&#x662F;&#x503C;&#x5F97;&#x4FE1;&#x670D;&#x7684;&#xFF1F;"></a>&#x600E;&#x6837;&#x7684;&#x8BBA;&#x8BC1;&#x548C;&#x89E3;&#x91CA;&#x624D;&#x662F;&#x503C;&#x5F97;&#x4FE1;&#x670D;&#x7684;&#xFF1F;</h3><p>&#x76EE;&#x524D;&#xFF0C;&#x4E00;&#x90E8;&#x5206;&#x5DE5;&#x4F5C;&#x7684;&#x6210;&#x679C;&#x6C47;&#x62A5;&#x548C;&#x5DE5;&#x7A0B;&#x5B9E;&#x73B0;&#x4E4B;&#x95F4;&#x5B58;&#x5728;&#x89E3;&#x91CA;&#x6027;&#x7684;&#x9E3F;&#x6C9F;&#x3002;&#x6211;&#x4EEC;&#x65E0;&#x6CD5;&#x6E05;&#x6670;&#x5730;&#x63CF;&#x8FF0;&#x67D0;&#x4E9B;&#x914D;&#x7F6E;&#x548C;&#x505A;&#x6CD5;&#x5176;&#x4E4B;&#x6240;&#x4EE5;&#x5982;&#x6B64;&#x7684;&#x9053;&#x7406;&#x548C;&#x5B9E;&#x9645;&#x53D1;&#x6325;&#x7684;&#x6548;&#x679C;&#xFF0C;&#x6211;&#x4EEC;&#x53EA;&#x80FD;&#x8BF4;&#x5B9E;&#x9A8C;&#x8868;&#x660E;&#x662F;&#x8FD9;&#x6837;&#x7684;&#x3002;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#x662F;&#x5728;&#x76EE;&#x6807;&#x68C0;&#x6D4B;&#x7684;&#x5355;&#x9636;&#x6BB5;&#x6A21;&#x578B;&#x4EE3;&#x8868;&#x6027;&#x5DE5;&#x4F5C;SSD&#x4E2D;&#xFF0C;&#x4F5C;&#x8005;&#x63D0;&#x4EA4;&#x7684;&#x8BBA;&#x6587;&#x548C;&#x5F00;&#x6E90;&#x7684;&#x4EE3;&#x7801;&#x5B9E;&#x73B0;&#x4E4B;&#x95F4;&#x6709;&#x76F8;&#x5F53;&#x5927;&#x7684;&#x8DDD;&#x79BB;&#x3002;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x4F5C;&#x8005;&#x7684;&#x4EE3;&#x7801;&#x5145;&#x6EE1;&#x4E86;&#x5DE5;&#x7A0B;&#x811A;&#x624B;&#x67B6;&#xFF0C;&#x6211;&#x66FE;&#x6CE8;&#x610F;&#x5230;&#x4E00;&#x4E2A;&#x5C06;IOU&#x9608;&#x503C;&#x9010;&#x6B65;&#x8870;&#x51CF;&#x7684;&#x8D85;&#x53C2;<sup id="fnref:3"><a href="#fn:3" rel="footnote">3</a></sup>&#xFF0C;&#x4F46;&#x5728;&#x6700;&#x7EC8;&#x7684;&#x914D;&#x7F6E;&#x4E2D;&#x5374;&#x6CA1;&#x6709;&#x88AB;&#x4F7F;&#x7528;&#xFF0C;&#x81EA;&#x7136;&#x5728;&#x8BBA;&#x6587;&#x4E2D;&#x4E5F;&#x6CA1;&#x6709;&#x63D0;&#x53CA;&#x3002;&#x4E00;&#x4E2A;&#x53EF;&#x80FD;&#x7684;&#x539F;&#x56E0;&#x662F;&#xFF0C;&#x4F5C;&#x8005;&#x8FDB;&#x884C;&#x7684;&#x5C1D;&#x8BD5;&#x6CA1;&#x6709;&#x53D6;&#x5F97;&#x9884;&#x671F;&#x7684;&#x6548;&#x679C;&#x3002;&#x90A3;&#x4E48;&#x95EE;&#x9898;&#x662F;&#xFF0C;&#x5982;&#x4F55;&#x786E;&#x5B9A;&#xFF0C;&#x6700;&#x7EC8;&#x88AB;&#x4F7F;&#x7528;&#x7684;&#x90E8;&#x5206;&#x90FD;&#x6709;&#x7B26;&#x5408;&#x903B;&#x8F91;&#x7684;&#x89E3;&#x91CA;&#xFF0C;&#x5E76;&#x4E14;&#x662F;&#x5FC5;&#x8981;&#x7684;&#x5462;&#xFF1F;</p>
<p>&#x53E6;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x7684;&#x95EE;&#x9898;&#x662F;&#x672F;&#x8BED;&#x7684;&#x8FC7;&#x8F7D;&#x548C;&#x6EE5;&#x7528;&#x73B0;&#x8C61;&#x3002;&#x8FD9;&#x4E9B;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x67D0;&#x4E00;&#x540D;&#x8BCD;&#x88AB;&#x6211;&#x4EEC;&#x8D4B;&#x4E88;&#x4E86;&#x8FC7;&#x591A;&#x4E14;&#x5E76;&#x4E0D;&#x8FD1;&#x4F3C;&#x7684;&#x542B;&#x4E49;&#xFF0C;&#x5E38;&#x5E38;&#x4F1A;&#x5F15;&#x8D77;&#x76F8;&#x5F53;&#x7684;&#x56F0;&#x60D1;&#x548C;&#x6C9F;&#x901A;&#x4E0A;&#x7684;&#x4E0D;&#x4FBF;&#x3002;&#x6BD4;&#x5982;&#x7279;&#x5F81;&#xFF08;Feature&#xFF09;&#x8FD9;&#x4E00;&#x8BCD;&#xFF0C;&#x65E2;&#x5728;&#x901A;&#x7528;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x4E2D;&#x4EE3;&#x6307;&#x8DDF;&#x5B9E;&#x4F8B;&#x76F8;&#x5BF9;&#x7684;&#x6570;&#x636E;&#x7EF4;&#x5EA6;&#xFF0C;&#x53C8;&#x5728;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x4E2D;&#x4EE3;&#x8868;&#x67D0;&#x4E00;&#x5C42;&#x5F20;&#x91CF;&#xFF0C;FPN&#x8BBA;&#x6587;<sup id="fnref:4"><a href="#fn:4" rel="footnote">4</a></sup>&#x4E2D;&#x4E3A;&#x5176;&#x52A0;&#x4E0A;&#x9AD8;&#x7B49;&#x7EA7;&#x8BED;&#x4E49;&#xFF08;High-level Semantic&#xFF09;&#x8FD9;&#x4E00;&#x4FEE;&#x9970;&#x8BED;&#x5219;&#x53C8;&#x6697;&#x793A;&#x5B83;&#x8FD8;&#x8DDF;&#x6211;&#x4EEC;&#x7684;&#x89C6;&#x89C9;&#x7CFB;&#x7EDF;&#x62BD;&#x8C61;&#x51FA;&#x6765;&#x7528;&#x4E8E;&#x8FA8;&#x522B;&#x7269;&#x4F53;&#x7684;&#x6982;&#x5FF5;&#x6709;&#x5171;&#x901A;&#x4E4B;&#x5904;&#x3002;&#x8FD9;&#x6837;&#x7684;&#x8FC7;&#x8F7D;&#x548C;&#x6EE5;&#x7528;&#x5BB9;&#x6613;&#x5F15;&#x8D77;&#x6982;&#x5FF5;&#x4E0A;&#x7684;&#x6DF7;&#x6DC6;&#x548C;&#x8BA8;&#x8BBA;&#x65F6;&#x7684;&#x8BEF;&#x4F1A;&#xFF0C;&#x6211;&#x4EEC;&#x4E5F;&#x8BB8;&#x9700;&#x8981;&#x66F4;&#x89C4;&#x8303;&#x548C;&#x6E05;&#x6670;&#x7684;&#x8868;&#x8FF0;&#x8BCD;&#x5E93;&#x3002;</p>
<p>&#x90E8;&#x5206;&#x5DE5;&#x4F5C;&#x8FD8;&#x5B58;&#x5728;&#x88AB;&#x6211;&#x79F0;&#x4E3A;&#x201C;&#x8F6F;&#x6570;&#x5B66;&#x5316;&#x201D;&#x7684;&#x73B0;&#x8C61;&#x3002;&#x5728;&#x6CA1;&#x6709;&#x63D0;&#x4F9B;&#x7CBE;&#x51C6;&#x5B9A;&#x4E49;&#x548C;&#x5B9A;&#x7406;&#x4F53;&#x7CFB;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x67D0;&#x4E9B;&#x8BBA;&#x6587;&#x4E2D;&#x501F;&#x7528;&#x4E00;&#x90E8;&#x5206;&#x6570;&#x5B66;&#x8868;&#x8FF0;&#x6765;&#x89E3;&#x91CA;&#x81EA;&#x5DF1;&#x505A;&#x6CD5;&#x7684;&#x5408;&#x7406;&#x6027;&#xFF0C;&#x4F46;&#x8BA9;&#x4EBA;&#x96BE;&#x4EE5;&#x5224;&#x65AD;&#x7684;&#x662F;&#x8FD9;&#x4E00;&#x90E8;&#x5206;&#x8868;&#x8FF0;&#x7684;&#x539F;&#x672C;&#x6570;&#x5B66;&#x542B;&#x4E49;&#x548C;&#x80CC;&#x666F;&#x662F;&#x5426;&#x7B26;&#x5408;&#x8BBA;&#x6587;&#x4E2D;&#x7684;&#x60C5;&#x666F;&#x3002;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#x662F;&#x63D0;&#x51FA;Batch Normalization&#x8BBA;&#x6587;<sup id="fnref:5"><a href="#fn:5" rel="footnote">5</a></sup>&#x4E2D;&#xFF0C;&#x4F5C;&#x8005;&#x7528;Internal Covariate Shift&#x6765;&#x89E3;&#x91CA;&#x4F7F;&#x7528;&#x5F52;&#x4E00;&#x5316;&#x7684;&#x539F;&#x56E0;&#xFF0C;&#x4F46;&#x8FD9;&#x4E00;&#x672F;&#x8BED;&#x7684;&#x80CC;&#x666F;&#x548C;&#x5B9A;&#x4E49;&#x7B49;&#x90FD;&#x4E0D;&#x80FD;&#x81EA;&#x6210;&#x4F53;&#x7CFB;&#x3002;&#x4F46;&#x8FD9;&#x4E00;&#x70B9;&#x88AB;&#x4E0D;&#x5C11;&#x4EBA;&#x5FFD;&#x7565;&#x4E86;&#xFF1A;&#x5B83;&#x53EA;&#x8981;&#x8D77;&#x4F5C;&#x7528;&#x5C31;&#x662F;&#x4E86;&#x3002;&#x518D;&#x5982;MobileNetV2&#x7684;&#x8BBA;&#x6587;<sup id="fnref:6"><a href="#fn:6" rel="footnote">6</a></sup>&#x7684;&#x9644;&#x5F55;&#x90E8;&#x5206;&#x7528;&#x77E9;&#x9635;&#x662F;&#x5426;&#x53EF;&#x9006;&#x6765;&#x8861;&#x91CF;&#x4F7F;&#x7528;ReLU&#x5355;&#x5143;&#x540E;&#x7684;&#x4FE1;&#x606F;&#x635F;&#x5931;&#xFF0C;&#x5E76;&#x7528;n-volume&#x6307;&#x4EE3;&#x7279;&#x5F81;&#x5C42;&#x6240;&#x80FD;&#x8868;&#x8FBE;&#x7684;&#x7A7A;&#x95F4;&#x7EF4;&#x5EA6;&#x5927;&#x5C0F;&#xFF0C;&#x4E14;&#x4E0D;&#x8BF4;&#x6240;&#x7528;&#x4E8E;&#x8861;&#x91CF;&#x548C;&#x6307;&#x4EE3;&#x7684;&#x5BF9;&#x8C61;&#x5C1A;&#x65E0;&#x5E7F;&#x6CDB;&#x63A5;&#x53D7;&#x7684;&#x5B9A;&#x4E49;&#xFF0C;&#x8FD9;&#x4E9B;&#x4ECE;&#x4EE3;&#x6570;&#x4E2D;&#x501F;&#x7528;&#x8FC7;&#x6765;&#x7684;&#x6982;&#x5FF5;&#x672C;&#x8EAB;&#x5C31;&#x672A;&#x7ECF;&#x8BBA;&#x8BC1;&#x5176;&#x9002;&#x7528;&#x7684;&#x5408;&#x7406;&#x6027;&#x3002;</p>
<h3 id="&#x7ED3;&#x8BED;"><a href="#&#x7ED3;&#x8BED;" class="headerlink" title="&#x7ED3;&#x8BED;"></a>&#x7ED3;&#x8BED;</h3><p>&#x4E0A;&#x9762;&#x63D0;&#x5230;&#x7684;&#x8FD9;&#x4E9B;&#x76F8;&#x5BF9;&#x4FDD;&#x5B88;&#x4E14;&#x4E0D;&#x6210;&#x719F;&#x7684;&#x8BA4;&#x8BC6;&#x548C;&#x56F0;&#x60D1;&#x5E76;&#x4E0D;&#x80FD;&#x6210;&#x4E3A;&#x6211;&#x4EEC;&#x5426;&#x5B9A;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x65B9;&#x6CD5;&#x53D6;&#x5F97;&#x6210;&#x5C31;&#x7684;&#x7406;&#x7531;&#xFF0C;&#x66F4;&#x5E94;&#x8BE5;&#x6210;&#x4E3A;&#x524D;&#x884C;&#x8DEF;&#x4E0A;&#x67D0;&#x6B21;&#x5C0F;&#x61A9;&#x65F6;&#x505A;&#x51FA;&#x7684;&#x56DE;&#x987E;&#x548C;&#x53CD;&#x601D;&#x3002;&#x4E0A;&#x9762;&#x7684;&#x8FD9;&#x4E9B;&#x56F0;&#x60D1;&#x6765;&#x81EA;&#x4E8E;&#x6211;&#x5E76;&#x4E0D;&#x591F;&#x591A;&#x7684;&#x8BBA;&#x6587;&#x9605;&#x8BFB;&#x7ECF;&#x9A8C;&#xFF0C;&#x4E5F;&#x4EC5;&#x5C40;&#x9650;&#x5728;&#x57FA;&#x4E8E;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x65B9;&#x6CD5;&#x7684;&#x56FE;&#x7247;&#x5206;&#x7C7B;&#x548C;&#x76EE;&#x6807;&#x68C0;&#x6D4B;&#x9886;&#x57DF;&#xFF0C;&#x8FD8;&#x8BF7;&#x8BFB;&#x8005;&#x591A;&#x591A;&#x8BC4;&#x8BBA;&#x4EA4;&#x6D41;&#x3002;</p>
<div id="footnotes"><hr><div id="footnotelist"><ol style="list-style:none; padding-left: 0;"><li id="fn:1"><span style="display: inline-block; vertical-align: top; padding-right: 10px;">1.</span><span style="display: inline-block; vertical-align: top;"><a href="https://blog.openai.com/openai-five/" target="_blank" rel="noopener">OpenAI Five - OpenAI Blog</a></span><a href="#fnref:1" rev="footnote"> &#x21A9;</a></li><li id="fn:2"><span style="display: inline-block; vertical-align: top; padding-right: 10px;">2.</span><span style="display: inline-block; vertical-align: top;"><a href="https://storage.googleapis.com/openimages/web/challenge.html" target="_blank" rel="noopener">Open Images Dataset V4</a></span><a href="#fnref:2" rev="footnote"> &#x21A9;</a></li><li id="fn:3"><span style="display: inline-block; vertical-align: top; padding-right: 10px;">3.</span><span style="display: inline-block; vertical-align: top;"><a href="https://github.com/weiliu89/caffe/blob/ssd/src/caffe/util/bbox_util.cpp#L1932" target="_blank" rel="noopener">caffe/tree/ssd/src/caffe/util/bbox_util.cpp - GitHub</a></span><a href="#fnref:3" rev="footnote"> &#x21A9;</a></li><li id="fn:4"><span style="display: inline-block; vertical-align: top; padding-right: 10px;">4.</span><span style="display: inline-block; vertical-align: top;"><a href="https://arxiv.org/abs/1612.03144" target="_blank" rel="noopener">Feature Pyramids for Object Detection - arXiv</a></span><a href="#fnref:4" rev="footnote"> &#x21A9;</a></li><li id="fn:5"><span style="display: inline-block; vertical-align: top; padding-right: 10px;">5.</span><span style="display: inline-block; vertical-align: top;"><a href="https://arxiv.org/abs/1502.03167" target="_blank" rel="noopener">Batch Normalization: Accelerating Deep Network Training by Reducing Internal Covariate Shift - arXiv</a></span><a href="#fnref:5" rev="footnote"> &#x21A9;</a></li><li id="fn:6"><span style="display: inline-block; vertical-align: top; padding-right: 10px;">6.</span><span style="display: inline-block; vertical-align: top;"><a href="https://arxiv.org/abs/1801.04381" target="_blank" rel="noopener">MobileNetV2: Inverted Residuals and Linear Bottlenecks - arXiv</a></span><a href="#fnref:6" rev="footnote"> &#x21A9;</a></li></ol></div></div>
    
    </div>
    
    <div class="columns is-variable is-1 is-multiline is-mobile">
    
        <span class="column is-narrow"><a class="tag is-light article-tag" href="/tags/AI/">#AI</a></span>
    
        <span class="column is-narrow"><a class="tag is-light article-tag" href="/tags/Deep-Learning/">#Deep Learning</a></span>
    
        <span class="column is-narrow"><a class="tag is-light article-tag" href="/tags/Machine-Learning/">#Machine Learning</a></span>
    
        <span class="column is-narrow"><a class="tag is-light article-tag" href="/tags/Research/">#Research</a></span>
    
    </div>
    
    
    <div class="columns is-mobile is-multiline article-nav">
        <span class="column is-12-mobile is-half-desktop  article-nav-prev">
            
            <a href="/posts/cb148915/">我（曾经）的付费数字内容</a>
            
        </span>
        <span class="column is-12-mobile is-half-desktop  article-nav-next">
            
            <a href="/posts/cea44253/">《西部世界》狂想曲（含剧透）</a>
            
        </span>
    </div>
    
</article>




<div class="comments">
    <h3 class="title is-4">评论</h3>
    
<script>
    var disqus_config = function () {
        this.page.url = 'https://blog.ddlee.cc/posts/684dd540/';
        this.page.identifier = 'posts/684dd540/';
        
        this.language = 'zh';
        
    };
    (function() {
        var d = document, s = d.createElement('script');  
        s.src = '//' + 'ddlee96' + '.disqus.com/embed.js';
        s.setAttribute('data-timestamp', +new Date());
        (d.head || d.body).appendChild(s);
    })();
</script>

<div id="disqus_thread">
    
    <noscript>Please enable JavaScript to view the <a href="//disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
</div>
</div>

    </div>
</section>
    <footer class="footer">
    <div class="container">
        <div class="columns content">
            <div class="column is-narrow has-text-centered">
                &copy; 2020 ddlee&nbsp;
                Powered by <a href="http://hexo.io/" target="_blank">Hexo</a> & <a href="http://github.com/ppoffice/hexo-theme-minos">Minos</a>
            </div>
            <div class="column is-hidden-mobile"></div>

            
            <div class="column is-narrow">
                <div class="columns is-mobile is-multiline is-centered">
                
                    
                <a class="column is-narrow has-text-black" title="GitHub" href="https://github.com/ddlee-cn">
                    
                    <i class="fab fa-github"></i>
                    
                </a>
                
                    
                <a class="column is-narrow has-text-black" title="Telegram" href="https://t.me/ddleecn">
                    
                    <i class="fab fa-telegram-plane"></i>
                    
                </a>
                
                </div>
            </div>
            
            
        </div>
    </div>
</footer>
    <script src="//cdnjs.cloudflare.com/ajax/libs/jquery/3.3.1/jquery.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/moment.js/2.22.2/moment-with-locales.min.js"></script>

<!-- test if the browser is outdated -->
<div id="outdated">
    <h6>Your browser is out-of-date!</h6>
    <p>Update your browser to view this website correctly. <a id="btnUpdateBrowser" href="http://outdatedbrowser.com/">Update my browser now </a></p>
    <p class="last"><a href="#" id="btnCloseUpdateBrowser" title="Close">&times;</a></p>
</div>
<script src="//cdnjs.cloudflare.com/ajax/libs/outdated-browser/1.1.5/outdatedbrowser.min.js"></script>
<script>
    $(document).ready(function () {
        // plugin function, place inside DOM ready function
        outdatedBrowser({
            bgColor: '#f25648',
            color: '#ffffff',
            lowerThan: 'flex'
        })
    });
</script>

<script>
    window.FontAwesomeConfig = {
        searchPseudoElements: true
    }
    moment.locale("zh-CN");
</script>


    
    
<script src="https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.4/MathJax.js?config=TeX-MML-AM_CHTML"></script>
<script>
    MathJax.Hub.Config({
        "HTML-CSS": {
            matchFontHeight: false
        },
        SVG: {
            matchFontHeight: false
        },
        CommonHTML: {
            matchFontHeight: false
        },
        tex2jax: {
            inlineMath: [
                ['$','$'],
                ['\\(','\\)']
            ]
        }
    });
</script>

    
    
    
    
<script src="//cdnjs.cloudflare.com/ajax/libs/lightgallery/1.6.8/js/lightgallery-all.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/justifiedGallery/3.6.5/js/jquery.justifiedGallery.min.js"></script>
<script>
    (function ($) {
        $(document).ready(function () {
            if (typeof($.fn.lightGallery) === 'function') {
                $('.article.gallery').lightGallery({ selector: '.gallery-item' });
            }
            if (typeof($.fn.justifiedGallery) === 'function') {
                $('.justified-gallery').justifiedGallery();
            }
        });
    })(jQuery);
</script>

    
    
    <script src="https://cdnjs.cloudflare.com/ajax/libs/clipboard.js/2.0.0/clipboard.min.js"></script>
    <style>
        .hljs {
            position: relative;
        }

        .hljs .clipboard-btn {
            float: right;
            color: #9a9a9a;
            background: none;
            border: none;
            cursor: pointer;
        }

        .hljs .clipboard-btn:hover {
          color: #8a8a8a;
        }

        .hljs > .clipboard-btn {
            display: none;
            position: absolute;
            right: 4px;
            top: 4px;
        }

        .hljs:hover > .clipboard-btn {
            display: inline;
        }

        .hljs > figcaption > .clipboard-btn {
            margin-right: 4px;
        }
    </style>
    <script>
      $(document).ready(function () {
        $('figure.hljs').each(function(i, figure) {
          var codeId = 'code-' + i;
          var code = figure.querySelector('.code');
          var copyButton = $('<button>Copy <i class="far fa-clipboard"></i></button>');
          code.id = codeId;
          copyButton.addClass('clipboard-btn');
          copyButton.attr('data-clipboard-target-id', codeId);

          var figcaption = figure.querySelector('figcaption');

          if (figcaption) {
            figcaption.append(copyButton[0]);
          } else {
            figure.prepend(copyButton[0]);
          }
        })

        var clipboard = new ClipboardJS('.clipboard-btn', {
          target: function(trigger) {
            return document.getElementById(trigger.getAttribute('data-clipboard-target-id'));
          }
        });
        clipboard.on('success', function(e) {
          e.clearSelection();
        })
      })
    </script>

    
    

    


<script src="/js/script.js"></script>

    
    <div class="searchbox ins-search">
    <div class="searchbox-mask"></div>
    <div class="searchbox-container ins-search-container">
        <div class="searchbox-input-wrapper">
            <input type="text" class="searchbox-input ins-search-input" placeholder="站内搜索">
            <span class="searchbox-close ins-close ins-selectable"><i class="fa fa-times-circle"></i></span>
        </div>
        <div class="searchbox-result-wrapper ins-section-wrapper">
            <div class="ins-section-container"></div>
        </div>
    </div>
</div>
<script>
    (function (window) {
        var INSIGHT_CONFIG = {
            TRANSLATION: {
                POSTS: '文章',
                PAGES: '页面',
                CATEGORIES: '分类',
                TAGS: '标签',
                UNTITLED: '(无标题)',
            },
            CONTENT_URL: '/content.json',
        };
        window.INSIGHT_CONFIG = INSIGHT_CONFIG;
    })(window);
</script>
<script src="/js/insight.js"></script><!-- hexo-inject:begin --><!-- Begin: Injected MathJax -->
<script type="text/x-mathjax-config">
  MathJax.Hub.Config("");
</script>

<script type="text/x-mathjax-config">
  MathJax.Hub.Queue(function() {
    var all = MathJax.Hub.getAllJax(), i;
    for(i=0; i < all.length; i += 1) {
      all[i].SourceElement().parentNode.className += ' has-jax';
    }
  });
</script>

<script type="text/javascript" src="https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.1/MathJax.js?config=TeX-AMS-MML_HTMLorMML">
</script>
<!-- End: Injected MathJax -->
<!-- hexo-inject:end -->
    
</body>
</html>